{
  "content": "Sometimes, the video or audio content in a web page cannot be properly downloaded or played in Firefox. This article will help you solve these problems.\n\n## Table of Contents\n\n• 1Check volume control for Firefox in the Volume Mixer\n• 2Reload the website\n• 3Allow autoplay of media with sound\n• 4You may need to install the required PulseAudio software\n• 5HTML5 audio and video\n• 6You may need the latest Media Feature Pack for N versions of Windows\n• 7Digital Rights Management (DRM) protected videos\n• 8Clear the cache\n• 9Disable interfering extensions or ad-blocking software\n• 10Check some Firefox settings\n• 11Reset preferences\n• 12Remove specific entries in the hosts file (advanced users)\n• 13Related links\n\n\n# Check volume control for Firefox in the Volume Mixer\n\n\nThe Volume Mixer has a specific volume control for Firefox.[Check the Volume Mixer]and make sure the volume level for*Mozilla Firefox*is not low or muted.[VolumeMixer-Win7][Win10 Volume Mixer]\n\n# Reload the website\n\n\nSometimes a change you make in the system settings, such as selecting another sound device in the Volume Mixer, may not be applied correctly in an already open tab. Try reloading the website to see if it solves the issue.\n\n# Allow autoplay of media with sound\n\n\nFirefox may be blocking media with sound from playing automatically. To allow media autoplay, see[Allow or block media autoplay in Firefox].\n\n# You may need to install the required PulseAudio software\n\n\nIf you see a notification saying “*To play audio, you may need to install the required PulseAudio software*”, it means that Firefox cannot find or use PulseAudio. The[PulseAudio software]is required to play any audio from Firefox. Most Linux distributions now come with PulseAudio pre-installed.\n\nUse your system's software package manager and ensure that PulseAudio is correctly installed.\n\n# HTML5 audio and video\n\n\nFirefox has built in support for open media formats usually associated with MP3, WebM, Ogg, and Wave containers. However, MP4 containers usually depend on platform decoders for AAC and H.264 audio and video streams. For more information, see[Audio and video files in Firefox].\n\n# You may need the latest Media Feature Pack for N versions of Windows\n\n\nWindows N versions are missing Windows Media Player and related software for media functions. You may need to install or update the Media Feature Pack from Microsoft. See[Fix video and audio problems on Firefox for Windows N editions]for details.\n\n# Digital Rights Management (DRM) protected videos\n\n\nIf you have problems playing DRM-controlled content from Amazon Prime, Netflix, Hulu, Disney+ and other streaming services, make sure that your Firefox Settings\nGeneral panel**Digital Rights Management (DRM) Content**setting,*Play DRM-controlled content*is check marked and that the Google Widevine plugin is enabled. See[Watch DRM content on Firefox]for more information.\n**Note:** **Note:**Google Widevine ended support for 32-bit Linux on May 31, 2021. Only 64-bit Linux is supported.\n**Note:** **Note:**The current version of Google Widevine is no longer compatible with older Mac operating systems such as OS X 10.9 and 10.10. Only versions OS X 10.11 and above are supported.\n\n# Clear the cache\n\n\nSee[How to clear the Firefox cache].\n\n# Disable interfering extensions or ad-blocking software\n\n\nAd-blocking software, such as anti-banner filters of your Internet Security program, or extensions, such as uBlock Origin or Adblock Plus, can prevent audio or video content from playing.\n\n• If the site works with ad-blocking disabled, you may want to add the site to your whitelist in your adblocker filter.\n• If the video or audio plays when you disable all extensions, then one of your extensions was causing the problem. For more information, see[Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems].\n\n\n# Check some Firefox settings\n\n• Cookies:\n\n• In the Menu bar at the top of the screen, click Firefoxand then select Preferencesor Settings, depending on your macOS version.[Fx89menuButton]Click the menu button and select Settings.\n• Select the Privacy & Securitypanel and go to the**Cookies and Site Data**section.\n• Verify that cookies are enabled and that the site is not blocked in the*Exceptions*list.\n• History:\n\n• In the Menu bar at the top of the screen, click Firefoxand then select Preferencesor Settings, depending on your macOS version.[Fx89menuButton]Click the menu button and select Settings.\n• Select the Privacy & Securitypanel and go to the**History**section.\n• Make sure that Firefox is set to Remember history.\n• Pop-up windows:\n\n• In the Menu bar at the top of the screen, click Firefoxand then select Preferencesor Settings, depending on your macOS version.[Fx89menuButton]Click the menu button and select Settings.\n• Select the Privacy & Securitypanel and go to the**Permissions**section.\n• Allow the website as an exception to the*Block pop-up windows*setting.\n\n\n# Reset preferences\n\n\nSee[Reset Firefox preferences to troubleshoot and fix problems].\n\n# Remove specific entries in the hosts file (advanced users)\n\n\nIf you use a[hosts file], you can temporarily disable it by renaming it Xhosts. Or, you can edit the hosts file to remove specific entries that may be causing videos on certain sites to fail (see[this thread]for an example). To apply changes to your hosts file, you may need to flush the DNS cache by entering the command:`ipconfig /flushdns`in the Run dialog box on Windows.\n\n# Related links\n\n• [I can’t play audio on a Remote Desktop Connection]\n• [Videos don't have sound on Citrix]\n\n• [What to do if Firefox won't play any sounds]\n• [Manage file types and download actions in Firefox]\n• [Mixed content blocking in Firefox]\n\n\n***Based on information from[Video or audio does not play (mozillaZine KB)]***",
  "title": "Fix common audio and video issues",
  "summary": "This article will help you solve audio and video problems on web pages.",
  "url": "https://support.mozilla.org/en-US/kb/fix-common-audio-and-video-issues",
  "slug": "fix-common-audio-and-video-issues",
  "source": "Mozilla Support (SUMO)",
  "products": [
    "firefox"
  ],
  "topics": [
    "audio-and-video",
    "browse"
  ],
  "locale": "en-US",
  "metadata": {
    "extraction_method": "ImprovedHTMLExtractor",
    "char_count": 5820,
    "word_count": 909,
    "has_structure": true
  }
}