{"content": "Sometimes, the video or audio content in a web page cannot be properly downloaded or played in Firefox. This article will help you solve these problems. Table of Contents 1 Check volume control for Firefox in the Volume Mixer 2 Reload the website 3 Allow autoplay of media with sound 4 You may need to install the required PulseAudio software 5 HTML5 audio and video 6 You may need the latest Media Feature Pack for N versions of Windows 7 Digital Rights Management (DRM) protected videos 8 Clear the cache 9 Disable interfering extensions or ad-blocking software 10 Check some Firefox settings 11 Reset preferences 12 Remove specific entries in the hosts file (advanced users) 13 Related links Check volume control for Firefox in the Volume Mixer The Volume Mixer has a specific volume control for Firefox. Check the Volume Mixer and make sure the volume level for Mozilla Firefox is not low or muted. Reload the website Sometimes a change you make in the system settings, such as selecting another sound device in the Volume Mixer , may not be applied correctly in an already open tab. Try reloading the website to see if it solves the issue. Allow autoplay of media with sound Firefox may be blocking media with sound from playing automatically. To allow media autoplay, see Allow or block media autoplay in Firefox . You may need to install the required PulseAudio software If you see a notification saying “ To play audio, you may need to install the required PulseAudio software ”, it means that Firefox cannot find or use PulseAudio. The PulseAudio software is required to play any audio from Firefox. Most Linux distributions now come with PulseAudio pre-installed. Use your system's software package manager and ensure that PulseAudio is correctly installed. HTML5 audio and video Firefox has built in support for open media formats usually associated with MP3, WebM, Ogg, and Wave containers. However, MP4 containers usually depend on platform decoders for AAC and H.264 audio and video streams. For more information, see Audio and video files in Firefox . You may need the latest Media Feature Pack for N versions of Windows Windows N versions are missing Windows Media Player and related software for media functions. You may need to install or update the Media Feature Pack from Microsoft. See Fix video and audio problems on Firefox for Windows N editions for details. Digital Rights Management (DRM) protected videos If you have problems playing DRM-controlled content from Amazon Prime, Netflix, Hulu, Disney+ and other streaming services, make sure that your Firefox Settings General panel Digital Rights Management (DRM) Content setting, Play DRM-controlled content is check marked and that the Google Widevine plugin is enabled. See Watch DRM content on Firefox for more information. Note: Google Widevine ended support for 32-bit Linux on May 31, 2021. Only 64-bit Linux is supported. Note: The current version of Google Widevine is no longer compatible with older Mac operating systems such as OS X 10.9 and 10.10. Only versions OS X 10.11 and above are supported. Clear the cache See How to clear the Firefox cache . Disable interfering extensions or ad-blocking software Ad-blocking software, such as anti-banner filters of your Internet Security program, or extensions, such as uBlock Origin or Adblock Plus, can prevent audio or video content from playing. If the site works with ad-blocking disabled, you may want to add the site to your whitelist in your adblocker filter. If the video or audio plays when you disable all extensions, then one of your extensions was causing the problem. For more information, see Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems . Check some Firefox settings Cookies: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select the Privacy & Security panel and go to the Cookies and Site Data section. Verify that cookies are enabled and that the site is not blocked in the Exceptions list. History: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select the Privacy & Security panel and go to the History section. Make sure that Firefox is set to Remember history . Pop-up windows: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select the Privacy & Security panel and go to the Permissions section. Allow the website as an exception to the Block pop-up windows setting. Reset preferences See Reset Firefox preferences to troubleshoot and fix problems . Remove specific entries in the hosts file (advanced users) If you use a hosts file , you can temporarily disable it by renaming it Xhosts . Or, you can edit the hosts file to remove specific entries that may be causing videos on certain sites to fail (see this thread for an example). To apply changes to your hosts file, you may need to flush the DNS cache by entering the command: ipconfig /flushdns in the Run dialog box on Windows . Related links I can’t play audio on a Remote Desktop Connection Videos don't have sound on Citrix What to do if Firefox won't play any sounds Manage file types and download actions in Firefox Mixed content blocking in Firefox Based on information from Video or audio does not play (mozillaZine KB)", "title": "Fix common audio and video issues", "summary": "This article will help you solve audio and video problems on web pages.", "url": "https://support.mozilla.org/en-US/kb/fix-common-audio-and-video-issues", "slug": "fix-common-audio-and-video-issues", "source": "Mozilla Support (SUMO)", "products": ["firefox"], "topics": ["audio-and-video", "browse"], "locale": "en-US", "metadata": {"char_count": 5575, "word_count": 939, "has_html": true, "downloaded_at": "2025-08-26T08:25:25.679594"}}
{"content": "When you use the simplified online Firefox Installer described in the How to install Firefox on Windows article, you can't make any changes to the installation, such as the program folder where Firefox is installed. This article explains how to customize your Firefox installation with the full, offline installer. Table of Contents 1 Where to download Firefox for a custom installation 2 How to install Firefox with custom settings 2.1 Choose where Firefox is installed 2.2 Choose optional components 2.3 Choose shortcuts 3 Summary Where to download Firefox for a custom installation You can download the Firefox Setup file in your language, from this Firefox download page . Note : You can install the 32-bit version of Firefox on 64-bit Windows but 64-bit Firefox is recommended . On 32-bit systems, only the 32-bit version of Firefox can be installed. How to install Firefox with custom settings When you run the Firefox Setup file, the Mozilla Firefox Setup Wizard will open. After clicking Next you can choose a Standard or Custom installation. The standard setup will be selected by default. A custom setup lets you choose the folder where Firefox program files will be installed, as well as which shortcuts to create. These options are not available in a standard setup. Select the Custom setup type and click Next . Choose where Firefox is installed The next step is where you can choose the location of the folder where the Firefox program will be installed. C:\\Program Files\\Mozilla Firefox\\ is the default folder path on 32-bit Windows. It's also the default location on 64-bit Windows when the 64-bit Firefox version is installed. When the 32-bit Firefox version is installed on 64-bit Windows, the default folder path is C:\\Program Files (x86)\\Mozilla Firefox\\ You can change the folder where Firefox will be installed either by manually typing the location of another folder on your computer, or you can click Browse… to select a new folder. Space required: The amount of space on your hard drive that's needed to install Firefox. Space available: The amount of space available on your hard drive. Click Next to continue. Choose optional components In the next screen, you can choose whether to install the optional Mozilla Maintenance Service which allows application updates to occur in the background, without requiring you to click Yes in the Windows User Account Control (UAC) dialog. For more information, see What is the Mozilla Maintenance Service? Note: This option may be missing in some cases, as when installing Firefox with a limited user account or when the Mozilla Maintenance Service is already installed. Choose shortcuts On my desktop: You can choose to create a Firefox shortcut icon on the Windows desktop. In my Start menu Programs folder: This will create a Firefox shortcut icon in the Windows Start menu Programs folder. After choosing which Firefox program shortcuts to create, click Next . Note: If you already have a Firefox shortcut from another installation you wish to keep, you should rename the existing shortcut before you finish installing Firefox; otherwise, it will be overwritten. Summary The Summary that comes up next will show the folder location where Firefox will be installed. Check mark Use Firefox as my default web browser if you want Firefox to start up when you open a link in your mail application, an Internet shortcut or HTML document. This option will be missing if you don't have permission to set Windows registry keys or if you are installing Firefox over an existing version and Firefox is already the default browser. For more information, see Make Firefox your default browser . If you are reinstalling Firefox over an existing version, you will see an Upgrade button instead of an Install button. Click Install or Upgrade to complete the installation. When Firefox is finished installing, the Completing the Mozilla Firefox Setup Wizard screen will appear. Click Finish . This will start Firefox unless you first clear the Launch Firefox now checkbox. Congratulations, you are done installing Firefox!", "title": "Custom installation of Firefox on Windows", "summary": "The custom setup option in the Firefox full, offline installer lets you choose the program folder location and shortcuts. Learn more.", "url": "https://support.mozilla.org/en-US/kb/custom-installation-firefox-on-windows", "slug": "custom-installation-firefox-on-windows", "source": "Mozilla Support (SUMO)", "products": ["firefox"], "topics": ["installation-and-updates"], "locale": "en-US", "metadata": {"char_count": 4075, "word_count": 664, "has_html": true, "downloaded_at": "2025-08-26T08:25:26.387888"}}
{"content": "Firefox lets you easily import bookmarks and other data from Google Chrome. This article gives you step-by-step instructions for getting it done. Table of Contents 1 Start the Firefox import process 1.1 Import from Firefox Settings 1.2 Import from the Library window 2 Choose data and complete the import 2.1 Import passwords from Chrome with the CSV file via the migration wizard 2.2 Complete imported extensions installation 3 Related content Start the Firefox import process Use one of these methods to import your data into Firefox from Google Chrome: Import from Firefox Settings You can import your Google Chrome bookmarks and other data from the Firefox Settings panel: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the General panel to the left, click Import Data under the Import browser data section. The Import Wizard will open. From here, you can choose the Google Chrome profile and the data you wish to import ( see below ). Import from the Library window You can import data from Google Chrome into Firefox from the Bookmarks Library window: Click the Firefox menu button to open the menu panel. Click Bookmarks and then click the Manage bookmarks bar at the bottom. The Library window will open. From the toolbar in the Library window, click Import and Backup and choose Import Data from Another Browser… This will open the Import Wizard. Tip: Another way to import from another browser is to enable the Menu bar (press Alt on the keyboard to enable it temporarily), click File in Menu bar at the top of the screen and select Import from Another Browser… Choose data and complete the import In the Import Wizard that appears, select the Chrome profile and the data you wish to import. To choose the data you want to import, click on the + button. Once you've made your selection, click on Import to kick off the import process. Note: The Payment methods option enables you to import payment methods saved in Chrome to Firefox. You won’t be able to import payment methods from Chrome on Windows to Firefox anymore, as the capability will no longer be supported due to changes in Chrome’s encryption mechanism. All set! Click Done to wrap up the import. The import process will transfer the selected data to Firefox, such as: Saved passwords: Your saved usernames and passwords. Bookmarks: Web pages you have saved in your bookmarks. Browsing history: Information on the sites you have visited. Extensions: Chrome extensions that match similar Firefox versions. Form autofill data: Information you use to populate online forms. Note: Extensions can be imported starting in Firefox version 116. Because Chrome defaults to saving bookmarks in its own bookmarks toolbar, you should be able to find your imported bookmarks in the Firefox Bookmarks Toolbar , which may be hidden. To show the Bookmarks Toolbar: Click the menu button , click More Tools… and choose Customize Toolbar… Click the Toolbars dropdown menu at the bottom of the screen and select Bookmarks Toolbar . The Bookmarks Toolbar can be set to Always Show , Never Show or Only Show on New Tab . Click Done . Tip: You can also turn the Bookmarks Toolbar on or off from the Firefox menu bar at the top of the screen , if the Menu bar is enabled : Click View , go down to Toolbars and select Bookmarks Toolbar . Import passwords from Chrome with the CSV file via the migration wizard Note: You are not able to import passwords from Chrome to Firefox automatically on Windows or Linux. You’ll have to import them using a CSV file via the migration wizard. You’ll need to export the CSV file containing your passwords from Chrome. Open Chrome , then the main menu , and go to Passwords and Autofill > Google Passwords Manager . Select Settings from the menu. Export passwords > Download file and save the CSV file to your device. Then, import the CSV file using the method explained above , by clicking Import Data and selecting Passwords from CSV file . Please be aware that while the issue will be broadly applicable to all Firefox versions, for now we're only updating the Firefox UI starting in Firefox version 139 (English locales only) and version 140 (all locales) to reflect the change. Complete imported extensions installation Starting in Firefox version 116, you can import extensions from Google Chrome. When you import your data from Chrome to Firefox, we aim to provide a smooth transition for your extensions by carefully matching the most-used Chrome add-ons to similar Firefox versions. The import process focuses on finding comparable Firefox extensions that: Are created by the same developer. Have updated in the last six months. Are approved and recommended on AMO . Offer equivalent functionality. This ensures we transfer over optimized extensions that integrate securely and reliably into your Firefox browser. After importing your data, there are just a couple of steps to finalize the installation of your new Firefox extensions: Click the menu button in the top-right corner. Select Finalize the installation of your imported add-ons from the menu. That's it! The compatible extensions you imported from Chrome will finish installing. Related content To import passwords from a CSV file, see Import login and password data from a file . To import bookmarks from an HTML file, see Import Bookmarks from an HTML file . To import your information from another browser, see Import data from another browser . To learn more about customizing Firefox, see Customize Firefox controls, buttons and toolbars . For more information on using bookmarks in Firefox, see Bookmarks in Firefox .", "title": "Import bookmarks and other data from Google Chrome", "summary": "Firefox lets you easily import bookmarks and other data from Google Chrome. This article gives you step-by-step instructions for getting it done.", "url": "https://support.mozilla.org/en-US/kb/import-bookmarks-google-chrome", "slug": "import-bookmarks-google-chrome", "source": "Mozilla Support (SUMO)", "products": ["firefox"], "topics": ["bookmarks", "browse", "import-and-export-settings", "settings"], "locale": "en-US", "metadata": {"char_count": 5709, "word_count": 962, "has_html": true, "downloaded_at": "2025-08-26T08:25:27.096685"}}
{"content": "Firefox lets you import bookmarks from other browsers installed on your computer. It also lets you import other data, such as browsing history and saved passwords, from some of these browsers. If you have logins and passwords stored in another browser, sometimes Firefox will suggest importing that login data into Firefox, to help you log in to a website. Note: Firefox does not save or sync login data from another browser unless you choose to import it. This data is stored locally in a readable form on your computer by the other browser. Table of Contents 1 How to import your data from another browser 1.1 Import from Firefox Settings 1.2 Import from the Library window 2 Choose data and complete the import 2.1 Import passwords from Chrome with the CSV file via the migration wizard 2.2 Import extensions from Chrome 3 Related content How to import your data from another browser Use one of these methods to import your data into Firefox: Import from Firefox Settings You can import your bookmarks and other data from the Firefox Settings panel: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the General panel, click on Import Data under the Import browser data section. The Import Wizard will open. From here, you can choose the browser, profile, and data you wish to import ( see below ). Import from the Library window You can import data from another browser into Firefox from the Bookmarks Library window: Click the Firefox menu button to open the menu panel. Click Bookmarks and then click the Manage bookmarks bar at the bottom. The Library window will open. From the toolbar in the Library window, click Import and Backup and choose Import Data from Another Browser… . The Import Wizard will open. Tip: Another way to import from another browser is to enable the Menu bar (press Alt on the keyboard to enable it temporarily), click File in Menu bar at the top of the screen and select Import from Another Browser… Choose data and complete the import In the Import Wizard, select the browser, profile and data you wish to import. The import will start. You may be prompted to add your system password to proceed. All set! Click Done to wrap up the import. The import process will transfer the selected data to Firefox, for example: Saved passwords: Your saved usernames and passwords. Bookmarks: Web pages you have saved in your bookmarks. Browsing history: Information on the sites you have visited. Extensions: Google Chrome extensions that match similar Firefox versions. Form autofill data: Information you use to populate online forms. Note: You won’t be able to import payment methods from Chrome on Windows to Firefox anymore, as the capability will no longer be supported due to changes in Chrome’s encryption mechanism. Afterward, the Firefox Bookmarks menu or Bookmarks Toolbar will include the bookmarks imported from the other browser. The Bookmarks toolbar will automatically appear to help you easily find your newly imported bookmarks. Note: If the Import Wizard does not list your other browser, you can still import bookmarks from that browser, but you will need to first export and save the bookmarks as an HTML file (visit the support site for your other browser if you need help with that). You can then import those bookmarks into Firefox from the HTML file. Import passwords from Chrome with the CSV file via the migration wizard Note: You'll no longer be able to import passwords from Chrome to Firefox automatically on Windows. You’ll have to import them using a CSV file via the migration wizard. You’ll need to export the CSV file containing your passwords from Chrome. Open Chrome , then the main menu , and go to Passwords and Autofill > Google Passwords Manager . Select Settings from the menu. Next to Export passwords , click Download file , and save the CSV file to your device. Then, import the CSV file using the methods explained above . Please be aware that while the issue will be broadly applicable to all Firefox versions, for now we're only updating the Firefox UI starting in Firefox version 139 (English locales only) and version 140 (all locales) to reflect the change. Import extensions from Chrome See Import bookmarks and other data from Google Chrome . Related content Import Bookmarks and other data from Microsoft Edge Importing Safari data into Firefox To import passwords from a CSV file, see Import login and password data from a file . To add bookmarks to Firefox from a bookmarks HTML file, see Import Bookmarks from an HTML file . To recover your Firefox data from a different Firefox installation or profile, see Restore bookmarks, passwords, and data from an old Firefox profile . For general information about bookmarks, see Bookmarks in Firefox .", "title": "Import data from another browser", "summary": "We'll show you how to import bookmarks, preferences, browsing history, passwords and other information from another browser.", "url": "https://support.mozilla.org/en-US/kb/import-data-another-browser", "slug": "import-data-another-browser", "source": "Mozilla Support (SUMO)", "products": ["firefox"], "topics": ["bookmarks", "browse", "import-and-export-settings", "settings"], "locale": "en-US", "metadata": {"char_count": 4851, "word_count": 825, "has_html": true, "downloaded_at": "2025-08-26T08:25:27.801265"}}
{"content": "December 2018 : Firefox's built-in feed reader and Live Bookmarks have been removed, starting with Firefox version 64. For alternatives, see Feed reader replacements for Firefox . If you check specific websites for new content on a regular basis, Live Bookmarks can deliver the most recent updates to you, without having to visit the site. Note: Live Bookmarks will only work with sites that offer web feeds . When a web feed is available from a web page, you can use Firefox to subscribe to it as a Live Bookmark. Firefox checks your Live Bookmarks every hour for updates, which enables you to stay current with the latest information from your favorite sites. Live Bookmarks work with any web feed in RSS, RDF, or Atom format. Table of Contents 1 Add a Live Bookmark 2 View Live Bookmarks 2.1 Reload Live Bookmarks 3 Delete a Live Bookmark Add a Live Bookmark Press the Alt key on your keyboard to temporarily show the classic menu bar, then select the Bookmarks menu. On the menu bar, click the Bookmarks menu. If the site has a feed, the Subscribe to This Page... option will be enabled. Click it. If available, choose between feeds or comments. Click Subscribe Now on the page that appears. Pick a name for your Live Bookmark and choose where to save it. By default, it'll be saved to the Bookmarks Toolbar . Then click Subscribe . That is it! Your Live Bookmark is created. Tip: You can add a Subscribe button to your Firefox toolbar or menu (the button will darken on pages with web feeds). See Customize Firefox controls, buttons and toolbars to learn how. View Live Bookmarks Live Bookmarks are saved as folders in Bookmarks Toolbar or Menu, like bookmarks. To see what's new, click it to view the latest items from the feed. To view a page from the feed, select the item in the menu. To view the feed home page, select Open feed-name (e.g. Open \"The Mozilla Blog\" ). To retrieve a Live Bookmark URL, right-click on the Live Bookmark and select Copy . Paste it into the text field of your choice. Reload Live Bookmarks Live bookmarks automatically reload every hour, but you can reload them manually: Right-click Hold down the Control key while you click on the Live Bookmark and select Reload Live Bookmark . Delete a Live Bookmark Deleting a Live Bookmark is the same as deleting regular bookmarks. Right-click Hold down the Control key while you click on the Live Bookmark and select Delete . Note: Only the entire Live Bookmark, which displays as a folder, can be deleted. Individual entries cannot be removed from the Live Bookmark.", "title": "Live Bookmarks - Subscribe to a web page for news and updates", "summary": "Use the \"Subscribe to This Page\" feature to add Live Bookmarks to Firefox and receive recent news and updates without visiting the website.", "url": "https://support.mozilla.org/en-US/kb/live-bookmarks", "slug": "live-bookmarks", "source": "Mozilla Support (SUMO)", "products": ["firefox"], "topics": ["bookmarks"], "locale": "en-US", "metadata": {"char_count": 2546, "word_count": 448, "has_html": true, "downloaded_at": "2025-08-26T08:25:28.503432"}}
