{
  "slug": "how-save-web-page",
  "title": "How to save a web page",
  "summary": "Firefox allows you to save a web page to your computer so that you can do things like read it when you're not connected to the Internet. Here's how.",
  "url": "https://support.mozilla.org/en-US/kb/how-save-web-page",
  "html": "<p>With Firefox, you can save a web page to your computer, enabling you to access it even when you're offline. Here's a straightforward guide on how to do it:\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_saving-a-web-page\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Saving a web page</span></a></li><li class=\"toclevel-1\"><a href=\"#w_saving-parts-of-a-web-page\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Saving parts of a web page</span></a></li></ul></div>\n<h1 id=\"w_saving-a-web-page\">Saving a web page</h1>\n<ol><li>Click on the menu button The image \"new fx menu\" does not exist., and then click <span class=\"for\" data-for=\"fx57\"><span class=\"menu\">Save Page As</span></span><span class=\"for\" data-for=\"not fx57\"><span class=\"menu\">Save Page</span></span>. The <em>Save As</em> dialog window will open.\n</li><li>In the dialog window, type in a name for the page you want to save and choose a location. <span class=\"for\" data-for=\"mac\">In the <em>Format</em> drop-down, choose the type of file that you want to save the page as:</span><span class=\"for\" data-for=\"win\">In the <em>Save as type</em> drop-down, choose the type of file that you want to save the page as:</span><span class=\"for\" data-for=\"linux\">At the bottom right corner of the dialog window, choose a file type from the drop-down menu</span>\n<dl><dd><span class=\"for\" data-for=\"win\"><img alt=\"Choosing File Type\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2014-02-13-06-26-08-6708fc.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"mac\"><img alt=\"save webpage\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2014-06-25-21-55-18-43781d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"linux\"><img alt=\"save as linux\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2014-06-25-22-16-53-bdb898.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</dd></dl>\n<ul><li> <strong>Web page, complete</strong>: Save the whole web page along with pictures. This choice allows you to view it as originally shown with pictures, but it may not keep the HTML link structure of the original page. Firefox creates a new directory where the page is saved to save pictures and other files necessary to show the whole web page. \n</li><li> <strong>Web page, HTML only</strong>: Save the original page without pictures. This choice preserves the original HTML link structure in one file. \n</li><li> <strong>Text files</strong>: Save the original page as a text file. This choice will not preserve the original HTML link structure but will allow you to see a text version of the web page in any text editor.\n</li><li> <strong>All files</strong>: This is equivalent to \"Web page, HTML only,\" but you may specify a file extension (e.g. \".htm\" or \".shtml\"). \n</li></ul>\n</li><li> Click <span class=\"button\">Save</span>. A copy of the page will be saved as the type you specified in the location you chose.\n</li></ol>\n<h1 id=\"w_saving-parts-of-a-web-page\">Saving parts of a web page</h1>\n<p><strong>To save an image</strong>: <span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Ctrl</span> key while you click</span> on the image you want to save, and then select <span class=\"menu\">Save Image As...</span> from the context menu. Then select a location on your computer to save the copy of the image.<br><img alt=\"Save Image As\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2014-02-13-06-40-25-26f168.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> \n</p><p>To save other elements on the page, including image scripts, stylesheets, and more, use the <a href=\"/en-US/kb/firefox-page-info-window#w_media\">Page Info window's Media panel</a>.\n</p>",
  "text": "With Firefox, you can save a web page to your computer, enabling you to access it even when you're offline. Here's a straightforward guide on how to do it: Table of Contents 1 Saving a web page 2 Saving parts of a web page Saving a web page Click on the menu button The image \"new fx menu\" does not exist., and then click Save Page As Save Page . The Save As dialog window will open. In the dialog window, type in a name for the page you want to save and choose a location. In the Format drop-down, choose the type of file that you want to save the page as: In the Save as type drop-down, choose the type of file that you want to save the page as: At the bottom right corner of the dialog window, choose a file type from the drop-down menu Web page, complete : Save the whole web page along with pictures. This choice allows you to view it as originally shown with pictures, but it may not keep the HTML link structure of the original page. Firefox creates a new directory where the page is saved to save pictures and other files necessary to show the whole web page. Web page, HTML only : Save the original page without pictures. This choice preserves the original HTML link structure in one file. Text files : Save the original page as a text file. This choice will not preserve the original HTML link structure but will allow you to see a text version of the web page in any text editor. All files : This is equivalent to \"Web page, HTML only,\" but you may specify a file extension (e.g. \".htm\" or \".shtml\"). Click Save . A copy of the page will be saved as the type you specified in the location you chose. Saving parts of a web page To save an image : Right-click Hold down the Ctrl key while you click on the image you want to save, and then select Save Image As... from the context menu. Then select a location on your computer to save the copy of the image. To save other elements on the page, including image scripts, stylesheets, and more, use the Page Info window's Media panel .",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse",
    "download-and-save",
    "save-content"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4405,
    "text_bytes": 1990,
    "word_count": 384,
    "downloaded_at": "2025-08-26T08:59:42.690302"
  }
}