{
  "slug": "about-your-important-data-and-their-files",
  "title": "About your important data and their files",
  "summary": "Learn more about your important Firefox data within your profile such as bookmarks, history and passwords.",
  "url": "https://support.mozilla.org/en-US/kb/about-your-important-data-and-their-files",
  "html": "Check out the table below to understand your Firefox data within your <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile</a>, what it means, and where you can read more information. <div class=\"note\"><strong>Note:</strong> This is not a complete list. It contains files you may wish to back up or <a href=\"/en-US/kb/restore-bookmarks-passwords-and-data-from-an-old-firefox-profile\">restore from another profile</a>.</div>\n<p>\n</p>\n<table>\n<tbody><tr>\n<th>File\n</th><th>File type\n</th><th>Definition\n</th><th>More details\n</th></tr>\n<tr>\n<td>places.sqlite\n</td><td>Bookmarks, downloads, and browsing history\n</td><td>It contains all your Firefox bookmarks and lists of files you have downloaded and of websites you have previously visited.\n</td><td><a href=\"/en-US/kb/bookmarks-firefox\">Bookmarks in Firefox</a>\n</td></tr>\n<tr>\n<td>favicons.sqlite\n</td><td>Bookmarks, downloads, and browsing history\n</td><td>It stores website favicon images. Use it when recovering the places.sqlite file.\n</td><td><a href=\"/en-US/kb/bookmarks-firefox\">Bookmarks in Firefox</a>\n</td></tr>\n<tr>\n<td>key4.db\n</td><td>Passwords\n</td><td>It stores your key database for your passwords. To transfer saved passwords, you must copy this file along with the following file.\n</td><td><a href=\"/en-US/kb/password-manager-remember-delete-edit-logins\">Password Manager - Remember, delete and edit logins and passwords in Firefox</a>\n</td></tr>\n<tr>\n<td>logins.json\n</td><td>Passwords\n</td><td>Encrypted information about your saved usernames and passwords.\n</td><td><a href=\"/en-US/kb/password-manager-remember-delete-edit-logins\">Password Manager - Remember, delete and edit logins and passwords in Firefox</a>\n</td></tr>\n<tr>\n<td>permissions.sqlite\n</td><td>Site-specific preferences\n</td><td>It stores many of your Firefox permissions that are decided on a per-site basis. For example, it stores which sites are allowed to, or blocked from, setting cookies, installing extensions, displaying popups, etc.\n</td><td><a href=\"/en-US/kb/site-permissions-panel\">Site permissions</a>\n</td></tr>\n<tr>\n<td>search.json.mozlz4\n</td><td>Search engines\n</td><td>It stores user-installed search engines.\n</td><td><a href=\"/en-US/kb/add-or-remove-search-engine-firefox\">Add or remove a search engine in Firefox</a>\n</td></tr>\n<tr>\n<td>persdict.dat\n</td><td>Personal dictionary\n</td><td>It stores any custom words you have added to Firefox's dictionary. If you have never added a custom word to the Firefox dictionary, then you will not have this file.\n</td><td><a href=\"/en-US/kb/how-do-i-use-firefox-spell-checker\">How do I use the Firefox spell checker?</a>\n</td></tr>\n<tr>\n<td>formhistory.sqlite\n</td><td>Autocomplete history\n</td><td>It remembers what you have searched for in the Firefox search bar and what information you have entered into forms on websites.\n</td><td><a href=\"/en-US/kb/control-whether-firefox-automatically-fills-forms\">Control whether Firefox automatically fills in forms</a>\n</td></tr>\n<tr>\n<td>cookies.sqlite\n</td><td>Cookies\n</td><td>Cookies are used by websites for a variety of reasons, some of which include keeping you logged in to a website you have previously logged in to, remembering any preferences a website has allowed you to set, authenticating you as a person who has visited a specific website before, etc.\n</td><td><a href=\"/en-US/kb/cookies-information-websites-store-on-your-computer\">Cookies - Information that websites store on your computer</a>\n</td></tr>\n<tr>\n<td>cert9.db\n</td><td>Security certificate settings\n</td><td>It stores all your security certificate settings and any secure website certificates you have imported into Firefox.\n</td><td><a href=\"/en-US/kb/secure-website-certificate\">Secure website certificate</a>\n</td></tr>\n<tr>\n<td>handlers.json\n</td><td>File types and download actions\n</td><td>It stores your preferences with respect to what Firefox does when it comes across known file types, such as whether you want to save a file or open it with a specific application.\n</td><td><a href=\"/en-US/kb/change-firefox-behavior-when-open-file\">Manage file types and download actions in Firefox</a>\n</td></tr></tbody></table>\n<p><br>\n<em>Based on information from <a href=\"http://kb.mozillazine.org/Transferring_data_to_a_new_profile_-_Firefox\">Transferring data to a new profile - Firefox (mozillaZine KB)</a></em>\n</p>",
  "text": "Check out the table below to understand your Firefox data within your profile , what it means, and where you can read more information. Note: This is not a complete list. It contains files you may wish to back up or restore from another profile . File File type Definition More details places.sqlite Bookmarks, downloads, and browsing history It contains all your Firefox bookmarks and lists of files you have downloaded and of websites you have previously visited. Bookmarks in Firefox favicons.sqlite Bookmarks, downloads, and browsing history It stores website favicon images. Use it when recovering the places.sqlite file. Bookmarks in Firefox key4.db Passwords It stores your key database for your passwords. To transfer saved passwords, you must copy this file along with the following file. Password Manager - Remember, delete and edit logins and passwords in Firefox logins.json Passwords Encrypted information about your saved usernames and passwords. Password Manager - Remember, delete and edit logins and passwords in Firefox permissions.sqlite Site-specific preferences It stores many of your Firefox permissions that are decided on a per-site basis. For example, it stores which sites are allowed to, or blocked from, setting cookies, installing extensions, displaying popups, etc. Site permissions search.json.mozlz4 Search engines It stores user-installed search engines. Add or remove a search engine in Firefox persdict.dat Personal dictionary It stores any custom words you have added to Firefox's dictionary. If you have never added a custom word to the Firefox dictionary, then you will not have this file. How do I use the Firefox spell checker? formhistory.sqlite Autocomplete history It remembers what you have searched for in the Firefox search bar and what information you have entered into forms on websites. Control whether Firefox automatically fills in forms cookies.sqlite Cookies Cookies are used by websites for a variety of reasons, some of which include keeping you logged in to a website you have previously logged in to, remembering any preferences a website has allowed you to set, authenticating you as a person who has visited a specific website before, etc. Cookies - Information that websites store on your computer cert9.db Security certificate settings It stores all your security certificate settings and any secure website certificates you have imported into Firefox. Secure website certificate handlers.json File types and download actions It stores your preferences with respect to what Firefox does when it comes across known file types, such as whether you want to save a file or open it with a specific application. Manage file types and download actions in Firefox Based on information from Transferring data to a new profile - Firefox (mozillaZine KB)",
  "products": [
    "firefox"
  ],
  "topics": [
    "backup-recovery-and-sync",
    "recover-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4359,
    "text_bytes": 2804,
    "word_count": 433,
    "downloaded_at": "2025-08-26T11:02:53.455481"
  }
}