{
  "slug": "add-on-signing-in-firefox",
  "title": "Add-on signing in Firefox",
  "summary": "Learn about add-on signing and what to do if an extension you want to use could not be verified for use in Firefox.",
  "url": "https://support.mozilla.org/en-US/kb/add-on-signing-in-firefox",
  "html": "<p><a href=\"/en-US/kb/find-and-install-add-ons-add-features-to-firefox\">Add-ons</a> that can change your browser's settings without your consent or steal your information have become increasingly common. Some add-ons can add unwanted toolbars or buttons, change your search settings or inject ads into your computer. Firefox does now verify that the add-ons you install have been signed by Mozilla, digitally. This article explains the <em>add-on signing</em> feature and how it works.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-is-add-on-signing\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What is add-on signing?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-types-of-add-ons-need-to-be-signed\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">What types of add-ons need to be signed?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_where-would-i-encounter-unsigned-add-ons\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Where would I encounter unsigned add-ons?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-can-i-do-if-firefox-disables-an-installed-add-on\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">What can I do if Firefox disables an installed add-on?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_what-are-my-options-if-i-want-to-use-an-unsigned-add-on-advanced-users\"><span class=\"tocnumber\">4.1</span> <span class=\"toctext\">What are my options if I want to use an unsigned add-on? (advanced users)</span></a></li></ul></li></ul></div>\n<h1 id=\"w_what-is-add-on-signing\">What is add-on signing?</h1>\n<p>Mozilla verifies and “signs” add-ons that follow a set of security guidelines. All add-ons hosted on <a href=\"https://addons.mozilla.org\">addons.mozilla.org</a> have to go through this process in order to be signed. Add-ons hosted on other sites will need to follow the same guidelines in order to be signed by Mozilla.\n</p>\n<div class=\"note\"><strong>Developers:</strong> To learn more about the add-on signing guidelines, see <a href=\"https://developer.mozilla.org/en-US/Add-ons/Distribution\">Signing and distributing your add-on</a> and <a href=\"https://developer.mozilla.org/en-US/Add-ons/AMO/Policy/Reviews\">Review Policies</a> at <em>MDN Web Docs</em>.</div>\n<p>While Firefox currently has a <a href=\"/en-US/kb/add-ons-cause-issues-are-on-blocklist\">blocklist</a> system, it is becoming difficult to track and block the growing number of malicious or unverified add-ons. The add-on signing process requires developers to follow <a href=\"https://developer.mozilla.org/en-US/Add-ons/AMO/Policy/Reviews\">Mozilla Developer guidelines</a>. Add-on signing in Firefox helps protect against browser hijackers and other <a href=\"https://wikipedia.org/wiki/Malware\">malware</a> by making it harder for them to be installed.\n</p><p>Firefox prevents you from installing unsigned add-ons and disables any unsigned add-ons that are already installed.\n</p>\n<h1 id=\"w_what-types-of-add-ons-need-to-be-signed\">What types of add-ons need to be signed?</h1>\n<p><a href=\"/en-US/kb/find-and-install-add-ons-add-features-to-firefox#w_what-types-of-add-ons-can-i-install\">Extensions</a> (add-ons that add features to Firefox), <a href=\"/en-US/kb/use-firefox-another-language\">language packs</a> and <a href=\"/en-US/kb/use-themes-change-look-of-firefox\">Themes</a> (add-ons that change the visual appearance of Firefox) need to be signed. Other types of add-ons do not need to be signed.\n</p>\n<h1 id=\"w_where-would-i-encounter-unsigned-add-ons\">Where would I encounter unsigned add-ons?</h1>\n<p>Add-ons installed through the <a href=\"https://addons.mozilla.org/firefox/\">official Firefox Add-ons site</a> go through security checks before they are published. These add-ons are verified and signed. When you install an add-on through another website, Firefox checks to make sure that the add-on is digitally signed.\n</p>\n<h1 id=\"w_what-can-i-do-if-firefox-disables-an-installed-add-on\">What can I do if Firefox disables an installed add-on?</h1>\n<p>If all of your add-ons have been disabled, your Firefox version may be out of date. See <a href=\"/en-US/kb/root-certificate-expiration\">Update Firefox to prevent add-ons issues from root certificate expiration</a>.\n</p><p>If an unsigned add-on is disabled, you won't be able to use it and the Add-ons manager will show a message that the add-on <em>could not be verified for use in Firefox and has been disabled</em>. You can <a href=\"/en-US/kb/disable-or-remove-add-ons#w_how-to-remove-extensions-and-themes\">remove the add-on</a> from Firefox and then reinstall a signed version from the <a href=\"https://addons.mozilla.org/\">Mozilla Add-ons site</a> if one is available.\n</p><p>If a signed version is not available, contact the add-on developer or vendor to see if they can offer an updated and signed version of that add-on. You can also ask them to <a href=\"https://developer.mozilla.org/en-US/Add-ons/Distribution\">get their add-on signed</a>.\n</p>\n<h2 id=\"w_what-are-my-options-if-i-want-to-use-an-unsigned-add-on-advanced-users\">What are my options if I want to use an unsigned add-on? (advanced users)</h2>\n<p></p><div class=\"warning\"><strong>Warning:</strong> These instructions are for experienced Firefox users. Changing settings in the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a> (<em>about:config</em>) can have serious effects on your browser’s stability, security and performance.\n<br><strong>Only proceed if you are comfortable with advanced settings and understand the potential impacts</strong>.</div>\nFirefox <a href=\"https://www.mozilla.org/firefox/organizations/\">Extended Support Release (ESR)</a>, Firefox <a href=\"https://www.mozilla.org/firefox/developer/\">Developer Edition</a> and <a href=\"https://nightly.mozilla.org/\">Nightly</a> versions of Firefox will allow you to override the setting to enforce the extension signing requirement, by changing the preference <span class=\"pref\">xpinstall.signatures.required</span> to <span class=\"pref\">false</span> in the <a href=\"/en-US/kb/about-config-editor-firefox\">Firefox Configuration Editor</a> (<em>about:config</em> page). To override the language pack signing requirement, you would set the preference <span class=\"pref\">extensions.langpacks.signatures.required</span> to <span class=\"pref\">false</span>. There are also special unbranded versions of Firefox that allow this override. See the Mozilla wiki article, <a href=\"https://wiki.mozilla.org/Add-ons/Extension_Signing\">Add-ons/Extension Signing</a> for more information.\n<p></p>",
  "text": "Add-ons that can change your browser's settings without your consent or steal your information have become increasingly common. Some add-ons can add unwanted toolbars or buttons, change your search settings or inject ads into your computer. Firefox does now verify that the add-ons you install have been signed by Mozilla, digitally. This article explains the add-on signing feature and how it works. Table of Contents 1 What is add-on signing? 2 What types of add-ons need to be signed? 3 Where would I encounter unsigned add-ons? 4 What can I do if Firefox disables an installed add-on? 4.1 What are my options if I want to use an unsigned add-on? (advanced users) What is add-on signing? Mozilla verifies and “signs” add-ons that follow a set of security guidelines. All add-ons hosted on addons.mozilla.org have to go through this process in order to be signed. Add-ons hosted on other sites will need to follow the same guidelines in order to be signed by Mozilla. Developers: To learn more about the add-on signing guidelines, see Signing and distributing your add-on and Review Policies at MDN Web Docs . While Firefox currently has a blocklist system, it is becoming difficult to track and block the growing number of malicious or unverified add-ons. The add-on signing process requires developers to follow Mozilla Developer guidelines . Add-on signing in Firefox helps protect against browser hijackers and other malware by making it harder for them to be installed. Firefox prevents you from installing unsigned add-ons and disables any unsigned add-ons that are already installed. What types of add-ons need to be signed? Extensions (add-ons that add features to Firefox), language packs and Themes (add-ons that change the visual appearance of Firefox) need to be signed. Other types of add-ons do not need to be signed. Where would I encounter unsigned add-ons? Add-ons installed through the official Firefox Add-ons site go through security checks before they are published. These add-ons are verified and signed. When you install an add-on through another website, Firefox checks to make sure that the add-on is digitally signed. What can I do if Firefox disables an installed add-on? If all of your add-ons have been disabled, your Firefox version may be out of date. See Update Firefox to prevent add-ons issues from root certificate expiration . If an unsigned add-on is disabled, you won't be able to use it and the Add-ons manager will show a message that the add-on could not be verified for use in Firefox and has been disabled . You can remove the add-on from Firefox and then reinstall a signed version from the Mozilla Add-ons site if one is available. If a signed version is not available, contact the add-on developer or vendor to see if they can offer an updated and signed version of that add-on. You can also ask them to get their add-on signed . What are my options if I want to use an unsigned add-on? (advanced users) Warning: These instructions are for experienced Firefox users. Changing settings in the Configuration Editor ( about:config ) can have serious effects on your browser’s stability, security and performance. Only proceed if you are comfortable with advanced settings and understand the potential impacts . Firefox Extended Support Release (ESR) , Firefox Developer Edition and Nightly versions of Firefox will allow you to override the setting to enforce the extension signing requirement, by changing the preference xpinstall.signatures.required to false in the Firefox Configuration Editor ( about:config page). To override the language pack signing requirement, you would set the preference extensions.langpacks.signatures.required to false . There are also special unbranded versions of Firefox that allow this override. See the Mozilla wiki article, Add-ons/Extension Signing for more information.",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6590,
    "text_bytes": 3852,
    "word_count": 618,
    "downloaded_at": "2025-08-26T10:36:33.751481"
  }
}