{
  "slug": "avoid-crashes-tips-and-tricks",
  "title": "Avoid crashes - Tips and tricks",
  "summary": "Here are some easy things you can do to avoid crashes and keep Firefox running in tip-top shape.",
  "url": "https://support.mozilla.org/en-US/kb/avoid-crashes-tips-and-tricks",
  "html": "<p>There's never a good time for a crash, and when Firefox crashes in the middle of something important it can be really frustrating. Luckily, we've got some easy things you can do to avoid crashes and keep Firefox running in tip-top shape. For the tech savvy, we've got articles that will help you troubleshoot and solve specific problems. And don't worry if you need extra help with any of this, we have a community of volunteers standing by.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_update-your-software\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Update your software</span></a></li><li class=\"toclevel-1\"><a href=\"#w_check-for-viruses-or-spyware\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Check for viruses or spyware</span></a></li><li class=\"toclevel-1\"><a href=\"#w_troubleshoot-your-crash\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Troubleshoot your crash</span></a></li><li class=\"toclevel-1\"><a href=\"#w_get-help-from-our-community-of-volunteers\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Get help from our community of volunteers</span></a></li></ul></div>\n<h2 id=\"w_update-your-software\">Update your software</h2>\n<p>Crashes can be caused by different programs running on your computer. Making sure they are all up to date on a regular basis will help you avoid crashes and keep your computer secure and running great.\n</p>\n<ol><li><strong>Update Firefox:</strong> <span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"New Fx Menu\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2014-01-10-13-08-08-f52b8c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"menu\">Help</span> <img alt=\"Help-29\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2014-01-10-13-10-08-eaa722.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">About Firefox</span>.</span><span class=\"for\" data-for=\"mac\">On the menu bar, click the <span class=\"menu\">Firefox</span> menu and select <span class=\"menu\">About Firefox</span>.</span> See <a href=\"/en-US/kb/update-firefox-latest-release\">Update Firefox to the latest release</a> for details.\n</li><li><strong>Update <span class=\"for\" data-for=\"win\">Windows</span><span class=\"for\" data-for=\"mac\">OS X</span><span class=\"for\" data-for=\"linux\">your system</span>:</strong> Make sure you have all of the latest security and stability fixes. <span class=\"for\" data-for=\"win\"><span class=\"for\" data-for=\"not win10\">Go to the <span class=\"menu\">Start</span> menu, select <span class=\"menu\">All Programs</span> and then <span class=\"menu\">Windows Update</span>.</span><span class=\"for\" data-for=\"win10\">Windows 10 periodically checks for updates. If you want to check manually, go to the <span class=\"menu\">Start</span> menu,  select <span class=\"menu\">Settings</span>, then <span class=\"menu\">Update &amp; security</span>, select <span class=\"menu\">Windows Update</span> and <span class=\"button\">Check for updates</span>.  For more details, visit Microsoft's article <a href=\"http://windows.microsoft.com/en-us/windows-10/getstarted-choose-how-updates-are-installed\">Choose how updates are installed</a>.</span></span><span class=\"for\" data-for=\"mac\">Go to the <span class=\"menu\">Apple</span> menu and select <span class=\"menu\">Software Update...</span>.</span><span class=\"for\" data-for=\"linux\">Go to the <span class=\"menu\">System</span> menu, down to <span class=\"menu\">Administration</span> and select <span class=\"menu\">Update Manager</span>.</span>\n</li><li><strong>Update your drivers:</strong> Check your printer driver and graphics drivers are up-to-date. For more info, see <a href=\"/en-US/kb/upgrade-graphics-drivers-use-hardware-acceleration\">Upgrade your graphics drivers to use hardware acceleration and WebGL</a>.\n</li><li><strong>Update Internet Security software:</strong> Make sure you have the latest version of any Internet security software (including firewalls, antivirus programs, anti-spyware programs, and more).\n</li></ol>\n<div class=\"for\" data-for=\"win\">\n<h2 id=\"w_check-for-viruses-or-spyware\">Check for viruses or spyware</h2>\n<p>Update and run anti-virus and malware scanner tools on your computer. For more information, see <a href=\"/en-US/kb/troubleshoot-firefox-issues-caused-malware\">Troubleshoot Firefox issues caused by malware</a>.\n</p></div>\n<h2 id=\"w_troubleshoot-your-crash\">Troubleshoot your crash</h2>\n<p>If Firefox is crashing and you don't mind doing a little detective work, take a look at the <a href=\"/en-US/kb/troubleshoot-firefox-crashes-closing-or-quitting\">Troubleshoot Firefox crashes (closing or quitting unexpectedly)</a> article. It has links to troubleshooting specific types of crashes and has detailed instructions for viewing a report about your crash. You also might find <a href=\"/en-US/kb/troubleshoot-issues-with-plugins-fix-problems\">Troubleshoot issues with plugins like Flash or Java to fix common Firefox problems</a> and <a href=\"/en-US/kb/troubleshoot-extensions-themes-to-fix-problems\">Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems</a> useful for fixing some crashes.\n</p>\n<h2 id=\"w_get-help-from-our-community-of-volunteers\">Get help from our community of volunteers</h2>\n<p>Sometimes tracking down the source of crashes is difficult to do by yourself. That's why we have a community of volunteers ready to help you figure it out.\n</p>\n<ul><li><a href=\"/questions/new\">Ask a question in our support forum</a>\n</li></ul>",
  "text": "There's never a good time for a crash, and when Firefox crashes in the middle of something important it can be really frustrating. Luckily, we've got some easy things you can do to avoid crashes and keep Firefox running in tip-top shape. For the tech savvy, we've got articles that will help you troubleshoot and solve specific problems. And don't worry if you need extra help with any of this, we have a community of volunteers standing by. Table of Contents 1 Update your software 2 Check for viruses or spyware 3 Troubleshoot your crash 4 Get help from our community of volunteers Update your software Crashes can be caused by different programs running on your computer. Making sure they are all up to date on a regular basis will help you avoid crashes and keep your computer secure and running great. Update Firefox: Click the menu button , click Help and select About Firefox . On the menu bar, click the Firefox menu and select About Firefox . See Update Firefox to the latest release for details. Update Windows OS X your system : Make sure you have all of the latest security and stability fixes. Go to the Start menu, select All Programs and then Windows Update . Windows 10 periodically checks for updates. If you want to check manually, go to the Start menu, select Settings , then Update & security , select Windows Update and Check for updates . For more details, visit Microsoft's article Choose how updates are installed . Go to the Apple menu and select Software Update... . Go to the System menu, down to Administration and select Update Manager . Update your drivers: Check your printer driver and graphics drivers are up-to-date. For more info, see Upgrade your graphics drivers to use hardware acceleration and WebGL . Update Internet Security software: Make sure you have the latest version of any Internet security software (including firewalls, antivirus programs, anti-spyware programs, and more). Check for viruses or spyware Update and run anti-virus and malware scanner tools on your computer. For more information, see Troubleshoot Firefox issues caused by malware . Troubleshoot your crash If Firefox is crashing and you don't mind doing a little detective work, take a look at the Troubleshoot Firefox crashes (closing or quitting unexpectedly) article. It has links to troubleshooting specific types of crashes and has detailed instructions for viewing a report about your crash. You also might find Troubleshoot issues with plugins like Flash or Java to fix common Firefox problems and Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems useful for fixing some crashes. Get help from our community of volunteers Sometimes tracking down the source of crashes is difficult to do by yourself. That's why we have a community of volunteers ready to help you figure it out. Ask a question in our support forum",
  "products": [
    "firefox"
  ],
  "topics": [
    "crashing-and-slow-performance",
    "performance-and-connectivity"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5831,
    "text_bytes": 2883,
    "word_count": 482,
    "downloaded_at": "2025-08-26T11:03:32.118673"
  }
}