{
  "slug": "certificate-cannot-be-trusted-warning-kazakhstan",
  "title": "\"Certificate cannot be trusted\" warning in Kazakhstan",
  "summary": "Firefox is blocking the use of Kazakhstan root CA certificate to protect your privacy. Learn more about how to stay safe.",
  "url": "https://support.mozilla.org/en-US/kb/certificate-cannot-be-trusted-warning-kazakhstan",
  "html": "<p>Internet Service Providers (ISPs) in Kazakhstan have been prompting users to install a government-issued root certificate on their devices. Many users were not aware that the certificate was being used to intercept their network communications, enabling a <a href=\"https://wikipedia.org/wiki/Man-in-the-middle_attack\">Man-in-the-Middle (MITM) attack</a>.\n</p><p>The security and privacy of HTTPS encrypted communications in Firefox and other browsers relies on trusted Certificate Authorities (CAs) to issue website certificates only to someone that controls the domain name or website. However, if you install a root certificate manually, you are choosing to trust a certificate that doesn’t necessarily have to follow any privacy and security standards.\n</p><p>For your security, Firefox will block the use of the Kazakhstan root CA certificate, considering it invalid even if you’ve installed it. \n</p><p>See <a href=\"https://blog.mozilla.org/blog/2019/08/21/mozilla-takes-action-to-protect-users-in-kazakhstan/\">the Mozilla Blog</a> for more information.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_how-do-i-know-if-firefox-has-blocked-the-kazakhstan-root-ca-certificate\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">How do I know if Firefox has blocked the Kazakhstan root CA certificate?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-remove-this-certificate\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How do I remove this certificate?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-can-i-do-to-protect-my-privacy\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">What can I do to protect my privacy?</span></a></li></ul></div>\n<h1 id=\"w_how-do-i-know-if-firefox-has-blocked-the-kazakhstan-root-ca-certificate\">How do I know if Firefox has blocked the Kazakhstan root CA certificate?</h1>\n<p>If you attempt to access a site that responds with this certificate, you will get an error message saying the certificate cannot be trusted.\n</p>\n<h1 id=\"w_how-do-i-remove-this-certificate\">How do I remove this certificate?</h1>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Go to the <span class=\"menu\">Privacy &amp; Security</span> panel.\n</li><li>Scroll down to the end and click <span class=\"button\">View Certificates</span>.\n</li><li>Under <em>Authorities</em>, select <strong>Qaznet Trust network</strong> from the list and click <span class=\"button\">Delete</span>.\n</li></ol>\n<div class=\"note\">You may have also installed the root certificate into the operating system (e.g. Windows, Android) of your device. If so, you must also follow instructions specific to your operating system to remove it, or else Firefox may not protect you from this threat.</div>\n<h1 id=\"w_what-can-i-do-to-protect-my-privacy\">What can I do to protect my privacy?</h1>\n<ul><li>If you installed the root CA certificate, remove it immediately.\n</li><li>Change your passwords to a strong, unique password for each of your online accounts.\n</li><li>Research the use of virtual private network (VPN) software, or the <a href=\"https://www.torproject.org/download/\">Tor Browser</a>, to access the Web. The Electronic Frontier Foundation provides helpful guidance on choosing a VPN (see <a href=\"https://ssd.eff.org/en/module/choosing-vpn-thats-right-you\">Choosing the VPN That's Right for You</a>).\n</li></ul>",
  "text": "Internet Service Providers (ISPs) in Kazakhstan have been prompting users to install a government-issued root certificate on their devices. Many users were not aware that the certificate was being used to intercept their network communications, enabling a Man-in-the-Middle (MITM) attack . The security and privacy of HTTPS encrypted communications in Firefox and other browsers relies on trusted Certificate Authorities (CAs) to issue website certificates only to someone that controls the domain name or website. However, if you install a root certificate manually, you are choosing to trust a certificate that doesn’t necessarily have to follow any privacy and security standards. For your security, Firefox will block the use of the Kazakhstan root CA certificate, considering it invalid even if you’ve installed it. See the Mozilla Blog for more information. Table of Contents 1 How do I know if Firefox has blocked the Kazakhstan root CA certificate? 2 How do I remove this certificate? 3 What can I do to protect my privacy? How do I know if Firefox has blocked the Kazakhstan root CA certificate? If you attempt to access a site that responds with this certificate, you will get an error message saying the certificate cannot be trusted. How do I remove this certificate? In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Go to the Privacy & Security panel. Scroll down to the end and click View Certificates . Under Authorities , select Qaznet Trust network from the list and click Delete . You may have also installed the root certificate into the operating system (e.g. Windows, Android) of your device. If so, you must also follow instructions specific to your operating system to remove it, or else Firefox may not protect you from this threat. What can I do to protect my privacy? If you installed the root CA certificate, remove it immediately. Change your passwords to a strong, unique password for each of your online accounts. Research the use of virtual private network (VPN) software, or the Tor Browser , to access the Web. The Electronic Frontier Foundation provides helpful guidance on choosing a VPN (see Choosing the VPN That's Right for You ).",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4013,
    "text_bytes": 2294,
    "word_count": 381,
    "downloaded_at": "2025-08-26T10:51:50.115990"
  }
}