{
  "slug": "changes-toolbars-and-window-sizes-are-not-saved",
  "title": "Changes to toolbars and window sizes are not saved",
  "summary": "If Firefox doesn't remember changes you've made to toolbar customizations or to browser window size or position, this article has solutions.",
  "url": "https://support.mozilla.org/en-US/kb/changes-toolbars-and-window-sizes-are-not-saved",
  "html": "<p>In some cases, Firefox may not remember changes you've made to your toolbar settings or certain other configuration changes, such as window size or position. This article explains how to fix the underlying problem that may result in one or more of the following symptoms:\n</p>\n<ul><li> You have <a href=\"/en-US/kb/customize-firefox-controls-buttons-and-toolbars\">customized your Firefox toolbar</a> to add, rearrange or remove buttons but the changes are not saved when you restart Firefox.\n</li><li> You have resized or moved the browser window, but the new size or position is not remembered when you restart Firefox.\n</li><li> You cannot save new <a href=\"/en-US/kb/bookmarks-firefox\">bookmarks</a>.\n</li></ul>\n<p>Here are two ways that you can solve the problem: \n</p>\n<h1 id=\"w_solution-1-delete-xulstore-json-file\">Solution 1: Delete xulstore.json file</h1>\n<p>You may have a corrupt <strong>xulstore.json</strong> file in your <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">Firefox profile</a>. You can delete this file so that Firefox can create a new one.  \n</p>\n<ol><li><ul><li><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"menu\">Help</span> and select <span class=\"menu\">More Troubleshooting Information</span>.</span><span class=\"for\" data-for=\"mac\">From the <span class=\"menu\">Help</span> menu, select <span class=\"menu\">More Troubleshooting Information</span>.</span> The <strong>Troubleshooting Information</strong> tab will open.\n</li><li>Under the <strong>Application Basics</strong> section next to <em><span class=\"for\" data-for=\"not linux\">Profile Folder</span><span class=\"for\" data-for=\"linux\">Profile Directory</span></em>, click <span class=\"button\"><span class=\"for\" data-for=\"win\">Open Folder</span><span class=\"for\" data-for=\"mac\">Show in Finder</span><span class=\"for\" data-for=\"linux\">Open Directory</span></span>. <span class=\"for\" data-for=\"mac\">A window will open that contains your profile folder.</span><span class=\"for\" data-for=\"win\">Your profile folder will open.</span><span class=\"for\" data-for=\"linux\">Your profile directory will open.</span>\n</li></ul>\n<div class=\"note\"><strong>Note:</strong>  If<span class=\"for\" data-for=\"win10,win11\"> Firefox displays an error after clicking <span class=\"button\">Open Folder</span> or if</span> you are unable to open or use Firefox, follow the instructions in <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data#w_finding-your-profile-without-opening-firefox\">Finding your profile without opening Firefox</a>.</div>\n</li><li>Close Firefox: <span class=\"for\" data-for=\"win\">Click the Firefox menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Exit</span>.</span><span class=\"for\" data-for=\"mac\">Click the Firefox menu at the top of the screen and select <span class=\"menu\">Quit Firefox</span>.</span><span class=\"for\" data-for=\"linux\">Click the Firefox menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Quit</span>.</span>\n\n</li><li>Locate and delete the file <span class=\"filepath\">xulstore.json</span> (or rename it, for example, to  <em>xulstore.jsonOLD</em>, to keep the old file as a backup).  \n</li><li>You can close the profile folder and open Firefox now.\n</li></ol>\n<h1 id=\"w_solution-2-refresh-firefox\">Solution 2: Refresh Firefox</h1>\n<p>If you don't want to try the first solution or if it didn't work, the Firefox <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">refresh feature</a> will automatically restore default toolbar settings and browser window size or position, and will also remove add-ons (extensions and themes) that could be interfering.\n</p><div class=\"note\"><strong>Note</strong>: When you refresh Firefox, your bookmarks, browsing history, open tabs, windows, passwords, cookies and web form auto-fill information will be saved. However, your extensions and themes will be removed and your preferences will be reset. <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">Learn more.</a></div>\n<ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"menu\">Help</span>, and select <span class=\"menu\">More Troubleshooting Information</span>.\n</li><li>Click <span class=\"button\">Refresh Firefox…</span> then <span class=\"button\">Refresh Firefox</span> in the confirmation window that opens. Firefox will close to refresh itself.\n</li><li>When finished, a window will list your imported information. Click the <span class=\"button\">Finish</span> button. Firefox will open.\n</li><li>Select whether you want Firefox to restore all or some windows and tabs, and click the <span class=\"button\">Let's go!</span> button.\n</li></ol>\n<div class=\"note\"><strong>Note:</strong> There's a Refresh Firefox button in the Firefox <a href=\"/en-US/kb/diagnose-firefox-issues-using-troubleshoot-mode\">Troubleshoot Mode</a> window, if you can't start Firefox normally. You can also do a manual refresh by <a href=\"/en-US/kb/restore-bookmarks-passwords-and-data-from-an-old-firefox-profile#w_create-a-new-firefox-profile\">creating a new profile and transferring your important data to the new profile</a>.</div>\n<p></p>",
  "text": "In some cases, Firefox may not remember changes you've made to your toolbar settings or certain other configuration changes, such as window size or position. This article explains how to fix the underlying problem that may result in one or more of the following symptoms: You have customized your Firefox toolbar to add, rearrange or remove buttons but the changes are not saved when you restart Firefox. You have resized or moved the browser window, but the new size or position is not remembered when you restart Firefox. You cannot save new bookmarks . Here are two ways that you can solve the problem: Solution 1: Delete xulstore.json file You may have a corrupt xulstore.json file in your Firefox profile . You can delete this file so that Firefox can create a new one. Click the menu button , click Help and select More Troubleshooting Information . From the Help menu, select More Troubleshooting Information . The Troubleshooting Information tab will open. Under the Application Basics section next to Profile Folder Profile Directory , click Open Folder Show in Finder Open Directory . A window will open that contains your profile folder. Your profile folder will open. Your profile directory will open. Note: If Firefox displays an error after clicking Open Folder or if you are unable to open or use Firefox, follow the instructions in Finding your profile without opening Firefox . Close Firefox: Click the Firefox menu and select Exit . Click the Firefox menu at the top of the screen and select Quit Firefox . Click the Firefox menu and select Quit . Locate and delete the file xulstore.json (or rename it, for example, to xulstore.jsonOLD , to keep the old file as a backup). You can close the profile folder and open Firefox now. Solution 2: Refresh Firefox If you don't want to try the first solution or if it didn't work, the Firefox refresh feature will automatically restore default toolbar settings and browser window size or position, and will also remove add-ons (extensions and themes) that could be interfering. Note : When you refresh Firefox, your bookmarks, browsing history, open tabs, windows, passwords, cookies and web form auto-fill information will be saved. However, your extensions and themes will be removed and your preferences will be reset. Learn more. Click the menu button , click Help , and select More Troubleshooting Information . Click Refresh Firefox… then Refresh Firefox in the confirmation window that opens. Firefox will close to refresh itself. When finished, a window will list your imported information. Click the Finish button. Firefox will open. Select whether you want Firefox to restore all or some windows and tabs, and click the Let's go! button. Note: There's a Refresh Firefox button in the Firefox Troubleshoot Mode window, if you can't start Firefox normally. You can also do a manual refresh by creating a new profile and transferring your important data to the new profile .",
  "products": [
    "firefox"
  ],
  "topics": [
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6254,
    "text_bytes": 2941,
    "word_count": 490,
    "downloaded_at": "2025-08-26T09:04:16.181375"
  }
}