{
  "slug": "cookies-information-websites-store-on-your-computer",
  "title": "Cookies - Information that websites store on your computer",
  "summary": "Learn what \"cookies\" are, how websites use them, and how you can manage the cookies that Firefox stores.",
  "url": "https://support.mozilla.org/en-US/kb/cookies-information-websites-store-on-your-computer",
  "html": "<p>This article describes what \"cookies\" are, how websites use them, and how you can manage the cookies that Firefox stores.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-is-a-cookie\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What is a cookie?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_cookie-settings\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Cookie settings</span></a></li><li class=\"toclevel-1\"><a href=\"#w_troubleshooting-cookies\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Troubleshooting cookies</span></a></li></ul></div>\n<h1 id=\"w_what-is-a-cookie\">What is a cookie?</h1>\n<p>A <a href=\"http://wikipedia.org/wiki/HTTP_cookie\">cookie</a> is information stored on your computer by a website you visit.  In some browsers, each cookie is a small file but in Firefox, all cookies are stored in a single file, located in the Firefox <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile</a> folder.\n</p><p>Cookies often store your settings for a website, such as your login status and preferred language or location. When you return to the site, Firefox sends back the cookies that belong to the site. This allows you to stay logged in to a website and allows the site to present you with information customized to fit your needs.\n</p><p>Cookies can store a wide range of information, including personally identifiable information (such as your name, home address, email address, or telephone number). However, this information can only be stored if you provide it - websites cannot gain access to information you didn't provide to them, and they can't access other files on your computer.\n</p><p>By default, the activities of storing and sending cookies are invisible to you. However, you can change your Firefox settings to allow you to approve or deny cookie storage requests, delete stored cookies automatically when you close Firefox, and more.\n</p>\n<h1 id=\"w_cookie-settings\">Cookie settings</h1>\n<p>You can access your Firefox Settings\n to manage cookies as follows:\n</p>\n<ol><li> <span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li> Select the <span class=\"menu\">Privacy &amp; Security</span> panel.\n</li></ol>\n<p>Cookie settings are under <strong><a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a></strong> and <strong>Cookies and Site Data</strong>.\n<img alt=\"CookiesAndSiteData\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-07-30-05-43-39-012ea1.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"700\">\n</p><p>For instructions on how to manage cookie settings for certain tasks, see:\n</p>\n<ul><li> <a href=\"/en-US/kb/clear-cookies-and-site-data-firefox\">Clear cookies and site data in Firefox</a>: How to remove cookies that have already been stored by websites.\n</li><li> <a href=\"/en-US/kb/block-websites-storing-cookies-site-data-firefox\">Block websites from storing cookies and site data in Firefox</a>: How to block certain websites from storing cookies.\n</li><li> <a href=\"/en-US/kb/third-party-cookies-firefox-tracking-protection\">Third-party cookies and Firefox tracking protection</a>: How to block websites other than the one you're currently visiting from storing cookies.\n</li></ul>\n<h1 id=\"w_troubleshooting-cookies\">Troubleshooting cookies</h1>\n<p>If you are having a problem with Firefox that involves cookies, see:\n</p>\n<ul><li> <a href=\"/en-US/kb/websites-say-cookies-are-blocked-unblock-them\">Websites say cookies are blocked - Unblock them</a>\n</li><li> <a href=\"/en-US/kb/fix-login-issues-on-websites-require-passwords\">Fix login issues on websites that require a username and password</a>\n</li></ul>",
  "text": "This article describes what \"cookies\" are, how websites use them, and how you can manage the cookies that Firefox stores. Table of Contents 1 What is a cookie? 2 Cookie settings 3 Troubleshooting cookies What is a cookie? A cookie is information stored on your computer by a website you visit. In some browsers, each cookie is a small file but in Firefox, all cookies are stored in a single file, located in the Firefox profile folder. Cookies often store your settings for a website, such as your login status and preferred language or location. When you return to the site, Firefox sends back the cookies that belong to the site. This allows you to stay logged in to a website and allows the site to present you with information customized to fit your needs. Cookies can store a wide range of information, including personally identifiable information (such as your name, home address, email address, or telephone number). However, this information can only be stored if you provide it - websites cannot gain access to information you didn't provide to them, and they can't access other files on your computer. By default, the activities of storing and sending cookies are invisible to you. However, you can change your Firefox settings to allow you to approve or deny cookie storage requests, delete stored cookies automatically when you close Firefox, and more. Cookie settings You can access your Firefox Settings to manage cookies as follows: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select the Privacy & Security panel. Cookie settings are under Enhanced Tracking Protection and Cookies and Site Data . For instructions on how to manage cookie settings for certain tasks, see: Clear cookies and site data in Firefox : How to remove cookies that have already been stored by websites. Block websites from storing cookies and site data in Firefox : How to block certain websites from storing cookies. Third-party cookies and Firefox tracking protection : How to block websites other than the one you're currently visiting from storing cookies. Troubleshooting cookies If you are having a problem with Firefox that involves cookies, see: Websites say cookies are blocked - Unblock them Fix login issues on websites that require a username and password",
  "products": [
    "firefox"
  ],
  "topics": [
    "tracking-protection"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4460,
    "text_bytes": 2388,
    "word_count": 398,
    "downloaded_at": "2025-08-26T09:04:14.090323"
  }
}