{
  "slug": "crash-report",
  "title": "Crash reports in Firefox for Desktop",
  "summary": "Learn about backlogged crash reports, how Firefox handles them and how to manage the setting to allow or prevent automatically sending crash reports",
  "url": "https://support.mozilla.org/en-US/kb/crash-report",
  "html": "<p></p><div class=\"note\"> \n<p><span class=\"for\" data-for=\"fx\"><img alt=\"progressive rollout banner\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-28-12-46-04-f31ad5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\nFirefox handles data with transparency—learn more about what that means for you. <a href=\"https://www.mozilla.org/privacy/firefox/\">Read the Firefox Privacy Notice</a>.\n</p>\n</div>\nWhen Firefox for Desktop crashes, it can send a crash report to Mozilla to help us fix bugs and improve the browser. You can choose to send them on a case-by-case basis after a crash or enable automatic submission.\n<p></p><p>This article explains what’s included in a crash report, how Mozilla uses it, and how you can manage the setting to automatically send crash reports.\n</p>\n<h1 id=\"w_whats-included-in-a-crash-report\">What’s included in a crash report?</h1>\n<ul><li><strong>Crash metadata:</strong> Information such as the operating system, Firefox version, and the time of the crash. This allows us to narrow down what platforms/user groups are affected by the crash.\n</li><li><strong>Device memory usage:</strong> Information about available memory at the time of the crash. Memory information can be a useful tool to determine whether a crash is caused by low system memory.\n</li><li><strong>Crash stack traces:</strong> Technical details about the code running at the time of the crash. These details guide developers to identify the cause of the crash (whether due to Firefox or third-party code).\n</li><li><strong>Snapshots from the program memory:</strong> Small fragments of memory will be stored in the report to help developers analyze the crash. These might contain private information and will only be accessible by a small number of developers within Mozilla.\n</li><li><strong>Browsing metadata:</strong> The URL that was loaded at the time of the crash may be included if you opt-in to sending it. Sometimes, crashes can only be reproduced by certain webpages, so the URL involved may be valuable to debug the cause of the crash.\n</li><li><strong>Hardware testing results:</strong> We receive a remarkable number of crashes that are simply due to bad hardware. To help identify these cases, we perform simple hardware tests and include results in reports. The tests do not take long and the results do not contain personal identifiable information, however users can opt-out of sending this information.\n</li></ul>\n<p>Some crash reports may include additional debugging information, such as minidumps – small memory snapshots that may contain data such as the list of files that were opened by Firefox at the time of crash or the last URL the user was visiting, to help diagnose crashes. Only a limited number of Mozilla engineers have access to this data.\n</p><p>For a detailed breakdown of the data included in crash reports, visit the <a href=\"https://dictionary.telemetry.mozilla.org/apps/firefox_desktop/pings/crash\">Glean Dictionary</a>.\n</p>\n<h1 id=\"w_whats-included-in-a-crash-ping\">What’s included in a crash ping?</h1>\n<p>Firefox also sends <a href=\"https://firefox-source-docs.mozilla.org/toolkit/components/telemetry/data/crash-ping.html\">crash pings</a>, smaller reports containing only the non-identifying metadata about crashes. These are sent automatically unless you opt out of <a href=\"/en-US/kb/technical-and-interaction-data\">technical and interaction data collection</a> in your settings. While crash pings contain less information than crash reports, they serve an important role in prioritizing debugging efforts (since they give a better estimate of the impact of bugs, not to mention they give insights into background process crashes for which we normally do not receive reports). Crash pings also give a much more accurate representation of the overall stability of Firefox.\n</p><p>For a detailed breakdown of the data included in crash reports, visit the <a href=\"https://dictionary.telemetry.mozilla.org/apps/firefox_desktop/pings/crash\">Glean Dictionary</a>.\n</p>\n<h2 id=\"w_how-does-mozilla-use-crash-reports-and-crash-pings\">How does Mozilla use crash reports and crash pings?</h2>\n<p>Mozilla uses crash pings and reports to fix bugs by understanding what caused the crash and prioritizing fixes, improve reliability by identifying trends to make Firefox more stable, and enhance user experience by ensuring future updates are less likely to crash.\n</p>\n<h1 id=\"w_allow-firefox-to-automatically-send-crash-reports\">Allow Firefox to automatically send crash reports</h1>\n<p>You can control whether Firefox automatically sends crash reports:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Go to the <span class=\"menu\">Privacy &amp; Security</span> panel.\n</li><li>Scroll down to the <em>Firefox Data Collection and Use</em> section.\n</li><li>Check or uncheck the box next to <strong>Automatically send crash reports</strong>.\n</li></ol>\n<p><img alt=\"Automatically send crash reports\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-02-25-12-11-54-abdfe9.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"700\">\n</p>\n<h2 id=\"w_what-happens-if-i-enable-this-option\">What happens if I enable this option?</h2>\n<p>If you enable this option, Firefox will automatically send crash reports. This ensures that Mozilla receives important crash data to improve Firefox’s stability. If you leave this option disabled (the default setting), crash reports will remain saved locally on your device until you manually choose to send them — for example, by submitting a crash report after Firefox prompts you following a new crash.\n</p>\n<h1 id=\"w_manually-submitting-crash-reports\">Manually submitting crash reports</h1>\n<p>Aside from choosing to submit crash reports immediately following a crash, you can also view all of your crash reports and potentially submit them later by navigating to <strong>about:crashes</strong> in the URL bar.\n</p>\n<h1 id=\"w_related-content\">Related content</h1>\n<p>To learn more about how Mozilla handles your data, check out these resources:\n</p>\n<ul><li><a href=\"https://www.mozilla.org/privacy/firefox/\">Firefox Privacy Notice</a>\n</li><li><a href=\"/en-US/kb/manage-firefox-data-collection-privacy-settings\">Manage Firefox data collection and privacy settings</a>\n</li><li><a href=\"/en-US/kb/mozillacrashreporter\">Mozilla Crash Reporter</a>\n</li></ul>",
  "text": "Firefox handles data with transparency—learn more about what that means for you. Read the Firefox Privacy Notice . When Firefox for Desktop crashes, it can send a crash report to Mozilla to help us fix bugs and improve the browser. You can choose to send them on a case-by-case basis after a crash or enable automatic submission. This article explains what’s included in a crash report, how Mozilla uses it, and how you can manage the setting to automatically send crash reports. What’s included in a crash report? Crash metadata: Information such as the operating system, Firefox version, and the time of the crash. This allows us to narrow down what platforms/user groups are affected by the crash. Device memory usage: Information about available memory at the time of the crash. Memory information can be a useful tool to determine whether a crash is caused by low system memory. Crash stack traces: Technical details about the code running at the time of the crash. These details guide developers to identify the cause of the crash (whether due to Firefox or third-party code). Snapshots from the program memory: Small fragments of memory will be stored in the report to help developers analyze the crash. These might contain private information and will only be accessible by a small number of developers within Mozilla. Browsing metadata: The URL that was loaded at the time of the crash may be included if you opt-in to sending it. Sometimes, crashes can only be reproduced by certain webpages, so the URL involved may be valuable to debug the cause of the crash. Hardware testing results: We receive a remarkable number of crashes that are simply due to bad hardware. To help identify these cases, we perform simple hardware tests and include results in reports. The tests do not take long and the results do not contain personal identifiable information, however users can opt-out of sending this information. Some crash reports may include additional debugging information, such as minidumps – small memory snapshots that may contain data such as the list of files that were opened by Firefox at the time of crash or the last URL the user was visiting, to help diagnose crashes. Only a limited number of Mozilla engineers have access to this data. For a detailed breakdown of the data included in crash reports, visit the Glean Dictionary . What’s included in a crash ping? Firefox also sends crash pings , smaller reports containing only the non-identifying metadata about crashes. These are sent automatically unless you opt out of technical and interaction data collection in your settings. While crash pings contain less information than crash reports, they serve an important role in prioritizing debugging efforts (since they give a better estimate of the impact of bugs, not to mention they give insights into background process crashes for which we normally do not receive reports). Crash pings also give a much more accurate representation of the overall stability of Firefox. For a detailed breakdown of the data included in crash reports, visit the Glean Dictionary . How does Mozilla use crash reports and crash pings? Mozilla uses crash pings and reports to fix bugs by understanding what caused the crash and prioritizing fixes, improve reliability by identifying trends to make Firefox more stable, and enhance user experience by ensuring future updates are less likely to crash. Allow Firefox to automatically send crash reports You can control whether Firefox automatically sends crash reports: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Go to the Privacy & Security panel. Scroll down to the Firefox Data Collection and Use section. Check or uncheck the box next to Automatically send crash reports . What happens if I enable this option? If you enable this option, Firefox will automatically send crash reports. This ensures that Mozilla receives important crash data to improve Firefox’s stability. If you leave this option disabled (the default setting), crash reports will remain saved locally on your device until you manually choose to send them — for example, by submitting a crash report after Firefox prompts you following a new crash. Manually submitting crash reports Aside from choosing to submit crash reports immediately following a crash, you can also view all of your crash reports and potentially submit them later by navigating to about:crashes in the URL bar. Related content To learn more about how Mozilla handles your data, check out these resources: Firefox Privacy Notice Manage Firefox data collection and privacy settings Mozilla Crash Reporter",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 7275,
    "text_bytes": 4731,
    "word_count": 775,
    "downloaded_at": "2025-08-26T10:59:15.887682"
  }
}