{
  "slug": "dedicated-profiles-firefox-installation",
  "title": "Dedicated profiles per Firefox installation",
  "summary": "Different Firefox installations now use a separate profile to store your bookmarks, passwords and other settings.  Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/dedicated-profiles-firefox-installation",
  "html": "<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-are-profiles\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What are profiles?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-happens-if-i-have-more-than-one-installation-of-firefox\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">What happens if I have more than one installation of Firefox?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-are-my-options\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">What are my options?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_can-i-change-which-firefox-installation-uses-a-previous-profile\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Can I change which Firefox installation uses a previous profile?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-am-a-sync-user-will-my-saved-data-still-remain-synced\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">I am a Sync user, will my saved data still remain synced?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-happens-to-my-profile-if-i-downgrade-to-a-previous-version-of-firefox\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">What happens to my profile if I downgrade to a previous version of Firefox?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-already-use-separate-profiles-for-my-different-firefox-installations\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">I already use separate profiles for my different Firefox installations</span></a></li></ul></div>\n<h1 id=\"w_what-are-profiles\">What are profiles?</h1>\n<p>Firefox saves information such as bookmarks, passwords and user preferences in a set of files called a profile. This profile is stored in a location separate from the Firefox <span class=\"for\" data-for=\"mac,linux\">application</span><span class=\"for\" data-for=\"win\">program files</span>. See <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">this article</a> for details.\n</p>\n<h1 id=\"w_what-happens-if-i-have-more-than-one-installation-of-firefox\">What happens if I have more than one installation of Firefox?</h1>\n<p>Some users have multiple installations of Firefox, each in separate <span class=\"for\" data-for=\"mac,linux\">application</span><span class=\"for\" data-for=\"win\">program</span> folders. Firefox uses a dedicated profile for each installation of Firefox, including <a href=\"https://www.mozilla.org/firefox/channel/desktop/\">Nightly, Beta, Developer Edition</a> and <a href=\"https://www.mozilla.org/firefox/organizations/\">Extended Support Release (ESR)</a> installations. This makes Firefox more stable when switching between installations on the same computer, and also allows you to run different Firefox installations at the same time.\n</p><p>If you install a new, additional installation of Firefox, a new profile will be created. You will not lose the personal data or customizations you had before, since your old profile data is saved and associated with the previous Firefox installation. \n</p>\n<h1 id=\"w_what-are-my-options\">What are my options?</h1>\n<p>You don't need to do anything. Your profile data will be different for each installation of Firefox.\nIf you would like the information you save to Firefox to be the same on all installations, you can <a href=\"/en-US/kb/how-do-i-set-sync-my-computer\">use a Mozilla account to keep them in sync</a>. Sync is the easiest way to make your profiles consistent on all of your installations of Firefox. You also get additional benefits like sending tabs and secure password storage. <a href=\"https://accounts.firefox.com/\">Get started with Sync here</a>.\n</p>\n<h1 id=\"w_can-i-change-which-firefox-installation-uses-a-previous-profile\">Can I change which Firefox installation uses a previous profile?</h1>\n<p>Yes. You can use the Profile Manager for each installation, to set a new default profile. Directions are available in these articles:\n</p>\n<ul><li> <a href=\"/en-US/kb/profile-manager-create-remove-switch-firefox-profiles\">Profile Manager - Create, remove or switch Firefox profiles</a>\n</li><li> <a href=\"/en-US/kb/recover-user-data-missing-after-firefox-update\">Recover user data missing after Firefox update</a> \n</li></ul>\n<h1 id=\"w_i-am-a-sync-user-will-my-saved-data-still-remain-synced\">I am a Sync user, will my saved data still remain synced?</h1>\n<p>Yes. Once you sign in to your Mozilla account on Firefox, any data saved to Sync from other installation of Firefox should appear.\n</p>\n<h1 id=\"w_what-happens-to-my-profile-if-i-downgrade-to-a-previous-version-of-firefox\">What happens to my profile if I downgrade to a previous version of Firefox?</h1>\n<p>You’ll have to create a new profile to avoid corruption issues.\n</p><p>Starting with <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 67, each Firefox installation requires a separate profile. Any previous <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile data</a> is saved and associated with the first Firefox installation opened after the change.\n</p><p>If you try to launch a Firefox installation with a profile that was last used in a more recent version, you'll see a warning that using an older version of Firefox can corrupt profile data such as bookmarks and browsing history:\n</p>\n<dl><dt><img alt=\"Fx68DowngradeProtection-prompt\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-09-10-10-45-17e924.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>Click the <span class=\"button\">Create New Profile</span> button to start Firefox with a new profile.\n</p><p>When you downgrade Firefox and use a new profile, any profile that was used in the higher version is still available in the <a href=\"/en-US/kb/profile-manager-create-remove-switch-firefox-profiles\">Profile Manager</a>, for use in a more recent version of Firefox.\n</p>\n<div class=\"note\"><strong>Note:</strong> Downgrade protection can be overridden by <a href=\"https://wiki.mozilla.org/Firefox/CommandLineOptions\">launching Firefox through the command line</a> with the <strong>--allow-downgrade</strong> parameter.</div>\n<h1 id=\"w_i-already-use-separate-profiles-for-my-different-firefox-installations\">I already use separate profiles for my different Firefox installations</h1>\n<p>If you have already manually created separate profiles for different installations, you will not notice the change (this has been the recommended procedure on Nightly for a while).\n</p>",
  "text": "Table of Contents 1 What are profiles? 2 What happens if I have more than one installation of Firefox? 3 What are my options? 4 Can I change which Firefox installation uses a previous profile? 5 I am a Sync user, will my saved data still remain synced? 6 What happens to my profile if I downgrade to a previous version of Firefox? 7 I already use separate profiles for my different Firefox installations What are profiles? Firefox saves information such as bookmarks, passwords and user preferences in a set of files called a profile. This profile is stored in a location separate from the Firefox application program files . See this article for details. What happens if I have more than one installation of Firefox? Some users have multiple installations of Firefox, each in separate application program folders. Firefox uses a dedicated profile for each installation of Firefox, including Nightly, Beta, Developer Edition and Extended Support Release (ESR) installations. This makes Firefox more stable when switching between installations on the same computer, and also allows you to run different Firefox installations at the same time. If you install a new, additional installation of Firefox, a new profile will be created. You will not lose the personal data or customizations you had before, since your old profile data is saved and associated with the previous Firefox installation. What are my options? You don't need to do anything. Your profile data will be different for each installation of Firefox. If you would like the information you save to Firefox to be the same on all installations, you can use a Mozilla account to keep them in sync . Sync is the easiest way to make your profiles consistent on all of your installations of Firefox. You also get additional benefits like sending tabs and secure password storage. Get started with Sync here . Can I change which Firefox installation uses a previous profile? Yes. You can use the Profile Manager for each installation, to set a new default profile. Directions are available in these articles: Profile Manager - Create, remove or switch Firefox profiles Recover user data missing after Firefox update I am a Sync user, will my saved data still remain synced? Yes. Once you sign in to your Mozilla account on Firefox, any data saved to Sync from other installation of Firefox should appear. What happens to my profile if I downgrade to a previous version of Firefox? You’ll have to create a new profile to avoid corruption issues. Starting with Firefox version 67, each Firefox installation requires a separate profile. Any previous profile data is saved and associated with the first Firefox installation opened after the change. If you try to launch a Firefox installation with a profile that was last used in a more recent version, you'll see a warning that using an older version of Firefox can corrupt profile data such as bookmarks and browsing history: Click the Create New Profile button to start Firefox with a new profile. When you downgrade Firefox and use a new profile, any profile that was used in the higher version is still available in the Profile Manager , for use in a more recent version of Firefox. Note: Downgrade protection can be overridden by launching Firefox through the command line with the --allow-downgrade parameter. I already use separate profiles for my different Firefox installations If you have already manually created separate profiles for different installations, you will not notice the change (this has been the recommended procedure on Nightly for a while).",
  "products": [
    "firefox"
  ],
  "topics": [
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6598,
    "text_bytes": 3570,
    "word_count": 593,
    "downloaded_at": "2025-08-26T10:47:15.982984"
  }
}