{
  "slug": "delete-sync-data-firefox-signing-out-firefox-account",
  "title": "Delete sync data from Firefox by signing out of your Mozilla account",
  "summary": "How to sign out of your Mozilla account and remove your synced data from a device.",
  "url": "https://support.mozilla.org/en-US/kb/delete-sync-data-firefox-signing-out-firefox-account",
  "html": "<p>If you're no longer using your Mozilla account on a particular device (especially when you're giving access to your computer to someone else), you should sign out of your Mozilla account to help ensure that no one can access your synced bookmarks, passwords, add-ons and browsing history.\n</p><p>You can also delete your synced data from that device when you sign out.\n</p>\n<h1 id=\"w_sign-out-of-your-mozilla-account-on-a-device\">Sign out of your Mozilla account on a device</h1>\n<ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the menu panel.\n\n</li><li>Click on your Mozilla account (email address).\n<dl><dt><img alt=\"FxA Login panel Fx88\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-04-26-15-04-20-204532.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"250\">\n</dt></dl>\n</li><li>Click <span class=\"menu\">Sign Out</span>.\n</li><li>To delete your synced information from Firefox on that device, put a checkbox next to <strong>Delete data from this device (logins, passwords, history, bookmarks, etc.)</strong> \n</li></ol>\n<h1 id=\"w_what-does-delete-data-from-this-device-do\">What does “Delete data from this device” do?</h1>\n<div class=\"note\"><strong>Note:</strong> This will not delete your information from other synced devices – only the device you're using to sign out. To delete your Mozilla account altogether, see <a href=\"/en-US/kb/how-do-i-delete-my-firefox-account\">How do I delete my Mozilla account?</a></div>\n<p><strong>If you select this checkbox when signing out, you will delete your Firefox data on the device, including:</strong>\n</p>\n<ul><li>Synced data from the computer:\n<ul><li>Logins \n</li><li>Bookmarks\n</li><li>Passwords\n</li><li>History\n</li><li>Add-ons\n</li></ul>\n</li><li>Cookies and Cache\n</li><li>Browsing and download history\n</li></ul>\n<p>This button will <strong>not delete</strong> the following information from the device:\n</p>\n<ul><li>Website permissions\n</li><li>Modified preferences \n</li><li>Download actions\n</li><li>Toolbar customization\n</li><li>Security certificates\n</li></ul>\n<p>If you’d also like to remove this information, see <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">Refresh Firefox - reset add-ons and settings</a>.\n</p>",
  "text": "If you're no longer using your Mozilla account on a particular device (especially when you're giving access to your computer to someone else), you should sign out of your Mozilla account to help ensure that no one can access your synced bookmarks, passwords, add-ons and browsing history. You can also delete your synced data from that device when you sign out. Sign out of your Mozilla account on a device Click the menu button to open the menu panel. Click on your Mozilla account (email address). Click Sign Out . To delete your synced information from Firefox on that device, put a checkbox next to Delete data from this device (logins, passwords, history, bookmarks, etc.) What does “Delete data from this device” do? Note: This will not delete your information from other synced devices – only the device you're using to sign out. To delete your Mozilla account altogether, see How do I delete my Mozilla account? If you select this checkbox when signing out, you will delete your Firefox data on the device, including: Synced data from the computer: Logins Bookmarks Passwords History Add-ons Cookies and Cache Browsing and download history This button will not delete the following information from the device: Website permissions Modified preferences Download actions Toolbar customization Security certificates If you’d also like to remove this information, see Refresh Firefox - reset add-ons and settings .",
  "products": [
    "firefox",
    "mozilla-account"
  ],
  "topics": [
    "sync-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2647,
    "text_bytes": 1418,
    "word_count": 230,
    "downloaded_at": "2025-08-26T10:53:39.622462"
  }
}