{
  "slug": "dns-over-https",
  "title": "Configure DNS over HTTPS protection levels in Firefox",
  "summary": "DNS over HTTPS (DoH) is a recommended feature that enhances privacy. Learn more about the DoH protection levels you can configure in Firefox settings.",
  "url": "https://support.mozilla.org/en-US/kb/dns-over-https",
  "html": "<p><a href=\"/en-US/kb/firefox-dns-over-https\">DNS over HTTPS (DoH)</a> is a recommended feature that enhances privacy for everyone. When you type a web address into your address bar, Firefox sends a secure DNS request to look up the IP address for that website over the Internet. DNS over HTTPS protection can be configured in four different ways.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_configure-doh-protection-settings\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Configure DoH protection settings</span></a></li><li class=\"toclevel-1\"><a href=\"#w_protection-levels-explained\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Protection levels explained</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_default-protection\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Default Protection</span></a></li><li class=\"toclevel-2\"><a href=\"#w_increased-protection\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">Increased Protection</span></a></li><li class=\"toclevel-2\"><a href=\"#w_max-protection\"><span class=\"tocnumber\">2.3</span> <span class=\"toctext\">Max Protection</span></a></li><li class=\"toclevel-2\"><a href=\"#w_off\"><span class=\"tocnumber\">2.4</span> <span class=\"toctext\">Off</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_add-sites-to-the-exceptions-list\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Add sites to the Exceptions list</span></a></li><li class=\"toclevel-1\"><a href=\"#w_frequently-asked-questions\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Frequently asked questions</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_what-is-a-local-provider\"><span class=\"tocnumber\">4.1</span> <span class=\"toctext\">What is a local provider?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_why-would-a-network-tell-firefox-not-to-use-secure-dns\"><span class=\"tocnumber\">4.2</span> <span class=\"toctext\">Why would a network tell Firefox not to use secure DNS?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_what-does-my-doh-status-mean\"><span class=\"tocnumber\">4.3</span> <span class=\"toctext\">What does my DoH status mean?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_why-is-the-secure-dns-status-not-showing-as-active\"><span class=\"tocnumber\">4.4</span> <span class=\"toctext\">Why is the secure DNS status not showing as active?</span></a></li></ul></li></ul></div>\n<h1 id=\"w_configure-doh-protection-settings\">Configure DoH protection settings</h1>\n<p>Default Protection is automatically enabled in Firefox when DNS over HTTPS (DoH) is activated. If you would like to modify the settings or select a different level of protection, please follow these steps:\n</p>\n<ol><li>Click the menu <img alt=\"PhotonMenuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2017-09-28-11-58-03-e6a66b.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button at the top right of the screen.\n</li><li>Click <span class=\"menu\">Settings</span>.\n</li><li>Click <span class=\"menu\">Privacy &amp; Security</span> on the left.\n</li><li>Scroll down to the <em>DNS over HTTPS</em> section.\n</li></ol>\n<dl><dt><img alt=\"DNS over HTTPS panel\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-01-23-10-57-34-3bfa56.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<h1 id=\"w_protection-levels-explained\">Protection levels explained</h1>\n<h2 id=\"w_default-protection\">Default Protection</h2>\n<p>The Default Protection automatically enables secure DNS in available regions and falls back to the default resolvers if there are issues. Default protection allows you to use local providers when possible. It disables DoH when VPN, parental control or enterprise policies are active or when a network tells Firefox not to use secure DNS.\n</p>\n<h2 id=\"w_increased-protection\">Increased Protection</h2>\n<p>When Increased Protection is on, DoH is constantly active with the provider you select. We will only switch to a backup option if there are any issues with your chosen provider.\n</p>\n<h2 id=\"w_max-protection\">Max Protection</h2>\n<p>Max protection will always use secure DNS and a security warning will show if we can’t connect to the secure DNS resolver, or if the secure DNS resolver indicates there are no addresses for the domain you are trying to access. The warning page will give you an option of adding an exception for that domain if you want to use the system DNS resolver.\n</p>\n<h2 id=\"w_off\">Off</h2>\n<p>When secure DNS is off, you’ll use your default DNS resolver.\n</p>\n<h1 id=\"w_add-sites-to-the-exceptions-list\">Add sites to the Exceptions list</h1>\n<ol><li>Click the menu <img alt=\"PhotonMenuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2017-09-28-11-58-03-e6a66b.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button at the top right of the screen.\n</li><li>Click <span class=\"menu\">Settings</span>.\n</li><li>Click <span class=\"menu\">Privacy &amp; Security</span> on the left.\n</li><li>Scroll down to the <em>DNS over HTTPS</em> section.\n</li><li>Click the <span class=\"button\">Manage Exceptions button</span>.\n</li></ol>\n<p><img alt=\"doh_manage_exceptions\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-05-24-13-12-11-4370aa.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</p>\n<h1 id=\"w_frequently-asked-questions\">Frequently asked questions</h1>\n<h2 id=\"w_what-is-a-local-provider\">What is a local provider?</h2>\n<p>A local provider, typically hosted within a user's local network or by their ISP, secures DNS queries for safer internet access. To detect a local provider, specific heuristics are used, which examine network configuration and DNS response patterns. Note that local providers are only employed in the <em>Default Protection</em> mode of DNS settings. They are used only when all heuristics criteria are met, ensuring that the DNS resolver is local and suitable for secure, efficient query resolutions.\n</p>\n<h2 id=\"w_why-would-a-network-tell-firefox-not-to-use-secure-dns\">Why would a network tell Firefox not to use secure DNS?</h2>\n<p>Some organizations restrict access to certain websites. If an organization has their own secure DNS, they will ask Firefox not to bypass it.\n</p><p>For additional information on DNS over HTTPS, you can refer to some of the <a href=\"/en-US/kb/dns-over-https-doh-faqs\">commonly asked questions (FAQs)</a>.\n</p>\n<h2 id=\"w_what-does-my-doh-status-mean\">What does my DoH status mean?</h2>\n<p>DoH status displays if Firefox is performing secure DNS queries. Based on the protection level you choose, the status indicator will reflect either Active, Not active or Off.\n<img alt=\"DoH_status\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-05-24-12-58-53-3e32b7.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</p>\n<ul><li><strong>Active:</strong> When status is active, Firefox is securely sending DNS queries to ensure your online activities are protected.\n</li><li><strong>Not active:</strong> Firefox detects errors or certain network conditions like VPN, parental controls, enterprise policies that tell Firefox not to use DoH.\n</li><li><strong>Off:</strong> DoH has been disabled.\n</li></ul>\n<h2 id=\"w_why-is-the-secure-dns-status-not-showing-as-active\">Why is the secure DNS status not showing as active?</h2>\n<p>If you have enabled secure DNS and the status is Not Active, common reasons are as follows:\n</p>\n<ul><li>Firefox wasn't able to connect to the provider.\n</li><li>The connection to the provider took longer than expected.\n</li><li>You are not connected to the internet.\n</li><li>There was a problem with the provider.\n</li><li>The browser is configured to <em>Default protection</em> but the network has signaled to Firefox to not enable DNS over HTTPS (for details, see <a href=\"/en-US/kb/dns-over-https-doh-faqs#w_what-are-doh-heuristics\">What are DoH heuristics?</a>)\n</li></ul>",
  "text": "DNS over HTTPS (DoH) is a recommended feature that enhances privacy for everyone. When you type a web address into your address bar, Firefox sends a secure DNS request to look up the IP address for that website over the Internet. DNS over HTTPS protection can be configured in four different ways. Table of Contents 1 Configure DoH protection settings 2 Protection levels explained 2.1 Default Protection 2.2 Increased Protection 2.3 Max Protection 2.4 Off 3 Add sites to the Exceptions list 4 Frequently asked questions 4.1 What is a local provider? 4.2 Why would a network tell Firefox not to use secure DNS? 4.3 What does my DoH status mean? 4.4 Why is the secure DNS status not showing as active? Configure DoH protection settings Default Protection is automatically enabled in Firefox when DNS over HTTPS (DoH) is activated. If you would like to modify the settings or select a different level of protection, please follow these steps: Click the menu button at the top right of the screen. Click Settings . Click Privacy & Security on the left. Scroll down to the DNS over HTTPS section. Protection levels explained Default Protection The Default Protection automatically enables secure DNS in available regions and falls back to the default resolvers if there are issues. Default protection allows you to use local providers when possible. It disables DoH when VPN, parental control or enterprise policies are active or when a network tells Firefox not to use secure DNS. Increased Protection When Increased Protection is on, DoH is constantly active with the provider you select. We will only switch to a backup option if there are any issues with your chosen provider. Max Protection Max protection will always use secure DNS and a security warning will show if we can’t connect to the secure DNS resolver, or if the secure DNS resolver indicates there are no addresses for the domain you are trying to access. The warning page will give you an option of adding an exception for that domain if you want to use the system DNS resolver. Off When secure DNS is off, you’ll use your default DNS resolver. Add sites to the Exceptions list Click the menu button at the top right of the screen. Click Settings . Click Privacy & Security on the left. Scroll down to the DNS over HTTPS section. Click the Manage Exceptions button . Frequently asked questions What is a local provider? A local provider, typically hosted within a user's local network or by their ISP, secures DNS queries for safer internet access. To detect a local provider, specific heuristics are used, which examine network configuration and DNS response patterns. Note that local providers are only employed in the Default Protection mode of DNS settings. They are used only when all heuristics criteria are met, ensuring that the DNS resolver is local and suitable for secure, efficient query resolutions. Why would a network tell Firefox not to use secure DNS? Some organizations restrict access to certain websites. If an organization has their own secure DNS, they will ask Firefox not to bypass it. For additional information on DNS over HTTPS, you can refer to some of the commonly asked questions (FAQs) . What does my DoH status mean? DoH status displays if Firefox is performing secure DNS queries. Based on the protection level you choose, the status indicator will reflect either Active, Not active or Off. Active: When status is active, Firefox is securely sending DNS queries to ensure your online activities are protected. Not active: Firefox detects errors or certain network conditions like VPN, parental controls, enterprise policies that tell Firefox not to use DoH. Off: DoH has been disabled. Why is the secure DNS status not showing as active? If you have enabled secure DNS and the status is Not Active, common reasons are as follows: Firefox wasn't able to connect to the provider. The connection to the provider took longer than expected. You are not connected to the internet. There was a problem with the provider. The browser is configured to Default protection but the network has signaled to Firefox to not enable DNS over HTTPS (for details, see What are DoH heuristics? )",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 8571,
    "text_bytes": 4172,
    "word_count": 703,
    "downloaded_at": "2025-08-26T10:56:03.194175"
  }
}