{
  "slug": "download-firefox-windows-microsoft-store",
  "title": "Download Firefox on Windows from the Microsoft Store",
  "summary": "The \"Mozilla Firefox\" app is available from the Microsoft Store for Windows 10 and Windows 11. Learn how to install it.",
  "url": "https://support.mozilla.org/en-US/kb/download-firefox-windows-microsoft-store",
  "html": "<div class=\"for\" data-for=\"linux,mac,winxp,win7,win8\"><div class=\"note\">Installing Firefox from the Microsoft store requires Windows 10 or Windows 11.</div></div>\n<p>In this article, you'll learn the steps to install Firefox for Windows from the Microsoft Store.\n</p>\n<ol><li>Click on the Windows icon located on the taskbar.\n</li><li>Type <strong>Microsoft Store</strong>.\n</li><li>Select \"Microsoft Store\" from the results. This will take you to the Microsoft app store.\n</li><li>Type <strong>Firefox</strong> in the search bar and press <span class=\"key\">Enter</span>.\n</li><li>Select \"Mozilla Firefox\" from the applications available.\n</li><li>Click <span class=\"button\">Get</span> to start the installation process.\n</li></ol>\n<p><img alt=\"FirefoxWinStore\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-11-09-11-24-22-74ac1b.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</p><p>You will receive updates for Firefox through the Microsoft Store. To learn more, see the Microsoft articles <a href=\"https://support.microsoft.com/en-us/windows/turn-on-automatic-app-updates-70634d32-4657-dc76-632b-66048978e51b\">Turn on automatic app updates</a> and <a href=\"https://support.microsoft.com/en-us/account-billing/get-updates-for-apps-and-games-in-microsoft-store-a1fe19c0-532d-ec47-7035-d1c5a1dd464f\">Get updates for apps and games in Microsoft Store</a>.\n</p>\n<div class=\"warning\"><strong>Warning:</strong>\n<ul><li>Running Firefox installed from Mozilla and running Firefox installed from the Microsoft Store will create two separate <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">Firefox profiles</a>.\n</li><li>You can't install Firefox from the Microsoft Store on Windows in S mode. To learn more, see <a href=\"/en-US/kb/windows-s-mode-wont-let-me-install-firefox\">Windows in S mode won't let me install Firefox</a>.\n</li><li>When Firefox is installed from the Microsoft Store, <a href=\"/en-US/kb/how-change-your-default-browser-firefox-windows\">changing your default browser to Firefox</a> must be done manually, in Windows Settings.\n</li><li>Note: Some users have reported issues related to the about:support page when using the Microsoft Store version of Firefox. For example, <a href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=1760396\">Bug 1760396</a> and <a href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=1788052\">Bug 1788052</a> highlight problems with the about:support page not working correctly or displaying incorrect profile locations. If you encounter such issues, consider checking the bug reports for more information and potential solutions.\n</li></ul>\n</div>",
  "text": "Installing Firefox from the Microsoft store requires Windows 10 or Windows 11. In this article, you'll learn the steps to install Firefox for Windows from the Microsoft Store. Click on the Windows icon located on the taskbar. Type Microsoft Store . Select \"Microsoft Store\" from the results. This will take you to the Microsoft app store. Type Firefox in the search bar and press Enter . Select \"Mozilla Firefox\" from the applications available. Click Get to start the installation process. You will receive updates for Firefox through the Microsoft Store. To learn more, see the Microsoft articles Turn on automatic app updates and Get updates for apps and games in Microsoft Store . Warning: Running Firefox installed from Mozilla and running Firefox installed from the Microsoft Store will create two separate Firefox profiles . You can't install Firefox from the Microsoft Store on Windows in S mode. To learn more, see Windows in S mode won't let me install Firefox . When Firefox is installed from the Microsoft Store, changing your default browser to Firefox must be done manually, in Windows Settings. Note: Some users have reported issues related to the about:support page when using the Microsoft Store version of Firefox. For example, Bug 1760396 and Bug 1788052 highlight problems with the about:support page not working correctly or displaying incorrect profile locations. If you encounter such issues, consider checking the bug reports for more information and potential solutions.",
  "products": [
    "firefox"
  ],
  "topics": [
    "installation-and-updates"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2757,
    "text_bytes": 1495,
    "word_count": 238,
    "downloaded_at": "2025-08-26T10:54:42.629576"
  }
}