{
  "slug": "facebook-container-prevent-facebook-tracking",
  "title": "Facebook Container - Prevent Facebook from tracking you on other websites",
  "summary": "Facebook Container is an add-on that you can install on Firefox to prevent Facebook from tracking your activity on other websites.",
  "url": "https://support.mozilla.org/en-US/kb/facebook-container-prevent-facebook-tracking",
  "html": "<p>Facebook Container is a Firefox add-on that helps you set boundaries with Facebook and other Meta websites. This extension isolates Meta sites (including Facebook, Instagram, and Messenger) from the rest of the web to limit where the company can track you.\n</p>\n<div class=\"note\">To learn more about Containers in general, see <a href=\"/en-US/kb/containers\">Firefox Multi-Account Containers</a>.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_how-does-facebook-container-work\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">How does Facebook Container work?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-install-facebook-container\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How do I install Facebook Container?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_facebook-container-isnt-working-as-expected\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Facebook Container isn't working as expected</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-happens-when-i-log-in-to-other-sites-using-my-facebook-account\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">What happens when I log in to other sites using my Facebook account?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-does-this-affect-facebooks-features\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">How does this affect Facebook’s features?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_will-this-add-on-protect-me-from-metafacebook-completely\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Will this add-on protect me from Meta/Facebook completely?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-use-containers-for-other-websites\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">How do I use Containers for other websites?</span></a></li></ul></div>\n<h1 id=\"w_how-does-facebook-container-work\">How does Facebook Container work?</h1>\n<p>The Facebook like and share buttons that appear on shopping, news and other sites contain Facebook trackers. Even if you don’t use them, Facebook uses these buttons to track you. Facebook Container blocks these trackers and will display a purple fence icon to show you where these trackers were removed.\n</p><p>When you visit a Meta site – like Facebook, Instagram or Messenger – the extension loads it in the special Facebook container, and the fence icon appears in your address bar. This puts Facebook and other Meta sites in their own boundary. You can allow other sites into the Facebook Container boundary, but this will allow Facebook to track more of your web browsing.\n</p><p><img alt=\"Facebook Container SS1\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-05-30-21-34-29-6e3ec7.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</p><p>When you visit a non-Facebook site that has Facebook trackers, Facebook Container alerts you of those trackers and blocks them.\n</p><p>You can add other websites to Facebook Container, if you prefer Facebook to see your activity on that site.\n</p>\n<ol><li>Go to the website that you will add to the Facebook Container.\n</li><li>Click the Facebook Container toolbar fence icon. This will open the extension panel.\n</li><li>Select <span class=\"menu\">Allow Site in Facebook Container</span> at the bottom of the panel.\n</li><li>Confirm your choice by clicking on <span class=\"button\">Allow</span> in the panel.\n</li></ol>\n<p>Follow the same steps to <strong>Remove Site from Facebook Container</strong>.\n</p>\n<h1 id=\"w_how-do-i-install-facebook-container\">How do I install Facebook Container?</h1>\n<ol><li><a href=\"https://addons.mozilla.org/firefox/addon/facebook-container/\">Install Facebook Container</a> from Mozilla Add-on website.\n<dl><dt>This will log you out of supported Meta websites and delete the cookies they set so far in Firefox.\n</dt></dl>\n</li><li>Access Facebook, Messenger or Instagram from your Firefox browser.\n<dl><dt>Firefox will automatically switch to the Facebook Container. If you click a link to a page outside of Meta websites or type in another website in the address bar, Firefox will load them outside the Facebook Container. If a website has Facebook trackers, Facebook Container will block them and alert you.\n</dt></dl>\n</li></ol>\n<h1 id=\"w_facebook-container-isnt-working-as-expected\">Facebook Container isn't working as expected</h1>\n<p>First, make sure the add-on is installed, enabled and up to date by checking your installed add-ons.\n</p>\n<ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"for\" data-for=\"not fx140\"><span class=\"menu\">Add-ons and themes</span></span><span class=\"for\" data-for=\"fx140\"><span class=\"menu\">Extensions and themes</span></span> and select <span class=\"menu\">Extensions</span>.\n\n</li><li>Ensure that installation was completed: If Facebook Container appears on the list, it was successfully installed, and you can move on to the next step.\n</li><li>Make sure it is enabled: If it is disabled, switch the toggle next to “Facebook Container (disabled)”.\n</li><li>Update Facebook Container: See <a href=\"/en-US/kb/how-update-add-ons\">How to update add-ons</a>.\n</li></ol>\n<p>For more information, see <a href=\"/en-US/kb/facebook-container-isnt-working\">Facebook Container isn't working</a>.\n</p>\n<h1 id=\"w_what-happens-when-i-log-in-to-other-sites-using-my-facebook-account\">What happens when I log in to other sites using my Facebook account?</h1>\n<p>Facebook login buttons on other sites contain Facebook trackers. You can still log in, but this allows Facebook to track your activity there. Allowing a site into the Facebook Container boundary allows Meta/Facebook to build a fuller picture of your online life.\n</p>\n<h1 id=\"w_how-does-this-affect-facebooks-features\">How does this affect Facebook’s features?</h1>\n<p>You can still use Facebook as you normally would on <a href=\"http://facebook.com\">facebook.com</a>. Facebook Container removes their trackers on other sites. The following will not work:\n</p>\n<ul><li><strong>Facebook like, share and comment buttons on other websites</strong>. Facebook Container removes their trackers and functionality.\n</li><li><strong>Logging in or creating accounts on other websites using Facebook</strong>. To log in using your Facebook account, you need to first allow the site inside Facebook Container.\n</li></ul>\n<h1 id=\"w_will-this-add-on-protect-me-from-metafacebook-completely\">Will this add-on protect me from Meta/Facebook completely?</h1>\n<p>This add-on does not prevent Facebook and its holding company Meta from mishandling the data it already has or permitted others to obtain about you. Meta/Facebook still has access to everything that you do while you are on <a href=\"http://facebook.com\">facebook.com</a> or in the Facebook app, including your Facebook comments, photo uploads, likes and any data you share with Facebook connected apps. Meta also has access to what you do on Messenger and Instagram, which the company also owns.\n</p><p>Other ad networks may try to link your Facebook activities with your regular browsing. In addition to using this add-on, there are other things you can do to maximize your protection, including changing your Facebook settings, using <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a> and/or using the <a href=\"https://addons.mozilla.org/firefox/addon/multi-account-containers/\">Firefox Multi-Account Containers</a> extension to further limit tracking.\n</p>\n<h1 id=\"w_how-do-i-use-containers-for-other-websites\">How do I use Containers for other websites?</h1>\n<p>Good news! Containers aren’t just for Meta/Facebook. When you install Facebook Container, you might also see other containers. To get the best experience, install <a href=\"https://addons.mozilla.org/firefox/addon/multi-account-containers/\">Firefox Multi-Account Containers</a> in addition to Facebook Container.\n</p><p>To learn more about how Multi-Account Containers work, see the <a href=\"/en-US/kb/containers\">Multi-Account Containers</a> article.\n</p>\n<div class=\"warning\">Mozilla created and supports <a href=\"https://addons.mozilla.org/firefox/addon/facebook-container/\">Facebook Container</a> and <a href=\"https://addons.mozilla.org/firefox/addon/multi-account-containers/\">Firefox Multi-Account Containers</a>. Other container extensions are not maintained by Mozilla. If you are experiencing issues with these other extensions, please contact the developer directly.</div>",
  "text": "Facebook Container is a Firefox add-on that helps you set boundaries with Facebook and other Meta websites. This extension isolates Meta sites (including Facebook, Instagram, and Messenger) from the rest of the web to limit where the company can track you. To learn more about Containers in general, see Firefox Multi-Account Containers . Table of Contents 1 How does Facebook Container work? 2 How do I install Facebook Container? 3 Facebook Container isn't working as expected 4 What happens when I log in to other sites using my Facebook account? 5 How does this affect Facebook’s features? 6 Will this add-on protect me from Meta/Facebook completely? 7 How do I use Containers for other websites? How does Facebook Container work? The Facebook like and share buttons that appear on shopping, news and other sites contain Facebook trackers. Even if you don’t use them, Facebook uses these buttons to track you. Facebook Container blocks these trackers and will display a purple fence icon to show you where these trackers were removed. When you visit a Meta site – like Facebook, Instagram or Messenger – the extension loads it in the special Facebook container, and the fence icon appears in your address bar. This puts Facebook and other Meta sites in their own boundary. You can allow other sites into the Facebook Container boundary, but this will allow Facebook to track more of your web browsing. When you visit a non-Facebook site that has Facebook trackers, Facebook Container alerts you of those trackers and blocks them. You can add other websites to Facebook Container, if you prefer Facebook to see your activity on that site. Go to the website that you will add to the Facebook Container. Click the Facebook Container toolbar fence icon. This will open the extension panel. Select Allow Site in Facebook Container at the bottom of the panel. Confirm your choice by clicking on Allow in the panel. Follow the same steps to Remove Site from Facebook Container . How do I install Facebook Container? Install Facebook Container from Mozilla Add-on website. This will log you out of supported Meta websites and delete the cookies they set so far in Firefox. Access Facebook, Messenger or Instagram from your Firefox browser. Firefox will automatically switch to the Facebook Container. If you click a link to a page outside of Meta websites or type in another website in the address bar, Firefox will load them outside the Facebook Container. If a website has Facebook trackers, Facebook Container will block them and alert you. Facebook Container isn't working as expected First, make sure the add-on is installed, enabled and up to date by checking your installed add-ons. Click the menu button , click Add-ons and themes Extensions and themes and select Extensions . Ensure that installation was completed: If Facebook Container appears on the list, it was successfully installed, and you can move on to the next step. Make sure it is enabled: If it is disabled, switch the toggle next to “Facebook Container (disabled)”. Update Facebook Container: See How to update add-ons . For more information, see Facebook Container isn't working . What happens when I log in to other sites using my Facebook account? Facebook login buttons on other sites contain Facebook trackers. You can still log in, but this allows Facebook to track your activity there. Allowing a site into the Facebook Container boundary allows Meta/Facebook to build a fuller picture of your online life. How does this affect Facebook’s features? You can still use Facebook as you normally would on facebook.com . Facebook Container removes their trackers on other sites. The following will not work: Facebook like, share and comment buttons on other websites . Facebook Container removes their trackers and functionality. Logging in or creating accounts on other websites using Facebook . To log in using your Facebook account, you need to first allow the site inside Facebook Container. Will this add-on protect me from Meta/Facebook completely? This add-on does not prevent Facebook and its holding company Meta from mishandling the data it already has or permitted others to obtain about you. Meta/Facebook still has access to everything that you do while you are on facebook.com or in the Facebook app, including your Facebook comments, photo uploads, likes and any data you share with Facebook connected apps. Meta also has access to what you do on Messenger and Instagram, which the company also owns. Other ad networks may try to link your Facebook activities with your regular browsing. In addition to using this add-on, there are other things you can do to maximize your protection, including changing your Facebook settings, using Enhanced Tracking Protection and/or using the Firefox Multi-Account Containers extension to further limit tracking. How do I use Containers for other websites? Good news! Containers aren’t just for Meta/Facebook. When you install Facebook Container, you might also see other containers. To get the best experience, install Firefox Multi-Account Containers in addition to Facebook Container. To learn more about how Multi-Account Containers work, see the Multi-Account Containers article. Mozilla created and supports Facebook Container and Firefox Multi-Account Containers . Other container extensions are not maintained by Mozilla. If you are experiencing issues with these other extensions, please contact the developer directly.",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 8895,
    "text_bytes": 5452,
    "word_count": 875,
    "downloaded_at": "2025-08-26T10:47:59.486413"
  }
}