{
  "slug": "facebook-container-isnt-working",
  "title": "Facebook Container isn't working",
  "summary": "What to do if Facebook Container doesn't work.",
  "url": "https://support.mozilla.org/en-US/kb/facebook-container-isnt-working",
  "html": "<p>First, make sure the add-on is installed, enabled and up to date by checking your installed add-ons.\n</p>\n<ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"for\" data-for=\"not fx140\"><span class=\"menu\">Add-ons and themes</span></span><span class=\"for\" data-for=\"fx140\"><span class=\"menu\">Extensions and themes</span></span> and select <span class=\"menu\">Extensions</span>.\n\n</li><li><strong>Ensure that installation was completed.</strong> If Facebook Container appears on the list, it was successfully installed and you can move on to the next step.\n</li><li><strong>Make sure it is enabled.</strong> If it is disabled, click <span class=\"button\">Enable</span> to activate it.\n</li><li><strong>Update Facebook Container.</strong> See <a href=\"/en-US/kb/how-update-add-ons\">How to update add-ons</a>\n</li></ol>\n<h1 id=\"w_i-cant-install-facebook-container-even-though-im-on-firefox-57\">I can't install Facebook Container even though I'm on Firefox 57+</h1>\n<p></p><p>If you're on version 57+ and still unable to install Facebook Container, you might have another extension or configuration that causes Firefox to conceal its version.\n</p><p>To work around this, copy and paste this link into your address bar: <strong><a href=\"https://addons.mozilla.org/firefox/downloads/latest/facebook-container/platform:2/addon-954390-latest.xpi\">https://addons.mozilla.org/firefox/downloads/latest/facebook-container/platform:2/addon-954390-latest.xpi</a></strong>.\n</p>\n<div class=\"note\">Firefox may ask for your permission to install the add-on. If it does, click the <strong>Add</strong> button.</div>\n<p></p>\n<h1 id=\"w_how-do-i-know-if-facebook-container-is-working\">How do I know if Facebook Container is working?</h1>\n<div class=\"for\" data-for=\"fx87\"><p>After you've installed and updated the Facebook Container add-on, open a new tab and enter <a href=\"http://facebook.com\">facebook.com</a>. If the word <strong>Facebook</strong> and the container icon appear on the right side of the address bar, then Facebook Container is working properly.\n</p><p><img alt=\"Facebook grey icon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-04-28-14-08-48-7bd1b7.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> \n</p></div><div class=\"for\" data-for=\"not fx87\"><p>After you've installed and updated the Facebook Container add-on, open a new tab and enter <a href=\"http://facebook.com\">facebook.com</a>. If the word <strong>Facebook</strong> appears in blue on the right side of the address bar, and the blue underline appears in that tab, then Facebook Container is working properly.\n</p></div>\n<div class=\"warning\">Mozilla created and supports <a href=\"https://addons.mozilla.org/firefox/addon/facebook-container/\">Facebook Container</a> and <a href=\"https://addons.mozilla.org/firefox/addon/multi-account-containers/\">Firefox Multi-Account Containers</a>. Other container  extensions are not maintained by Mozilla. If you are experiencing issues with these other extensions, please contact the developer directly.</div>\n<h1 id=\"w_affected-facebook-features\">Affected Facebook features</h1>\n<p>Facebook Container prevents Facebook from linking your activity on other websites to your Facebook identity. Therefore, the following will not work:\n</p>\n<ul><li><strong>“Like” buttons and embedded Facebook comments on other websites</strong> Because you are logged in to Facebook only in the container, “Like” buttons and embedded Facebook comments on other websites will not work.\n</li><li><strong>Logging in or creating accounts on other websites using Facebook</strong> Websites that allow you to create an account or log in using Facebook will generally not work properly.\n</li></ul>",
  "text": "First, make sure the add-on is installed, enabled and up to date by checking your installed add-ons. Click the menu button , click Add-ons and themes Extensions and themes and select Extensions . Ensure that installation was completed. If Facebook Container appears on the list, it was successfully installed and you can move on to the next step. Make sure it is enabled. If it is disabled, click Enable to activate it. Update Facebook Container. See How to update add-ons I can't install Facebook Container even though I'm on Firefox 57+ If you're on version 57+ and still unable to install Facebook Container, you might have another extension or configuration that causes Firefox to conceal its version. To work around this, copy and paste this link into your address bar: https://addons.mozilla.org/firefox/downloads/latest/facebook-container/platform:2/addon-954390-latest.xpi . Firefox may ask for your permission to install the add-on. If it does, click the Add button. How do I know if Facebook Container is working? After you've installed and updated the Facebook Container add-on, open a new tab and enter facebook.com . If the word Facebook and the container icon appear on the right side of the address bar, then Facebook Container is working properly. After you've installed and updated the Facebook Container add-on, open a new tab and enter facebook.com . If the word Facebook appears in blue on the right side of the address bar, and the blue underline appears in that tab, then Facebook Container is working properly. Mozilla created and supports Facebook Container and Firefox Multi-Account Containers . Other container extensions are not maintained by Mozilla. If you are experiencing issues with these other extensions, please contact the developer directly. Affected Facebook features Facebook Container prevents Facebook from linking your activity on other websites to your Facebook identity. Therefore, the following will not work: “Like” buttons and embedded Facebook comments on other websites Because you are logged in to Facebook only in the container, “Like” buttons and embedded Facebook comments on other websites will not work. Logging in or creating accounts on other websites using Facebook Websites that allow you to create an account or log in using Facebook will generally not work properly.",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4124,
    "text_bytes": 2326,
    "word_count": 361,
    "downloaded_at": "2025-08-26T10:38:51.637956"
  }
}