{
  "slug": "firefox-does-not-work-common-fixes",
  "title": "Firefox does not work - Common fixes to get you back up and running",
  "summary": "Find solutions to Firefox issues like crashing, not starting, slowness and websites not loading.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-does-not-work-common-fixes",
  "html": "<p>Do you have days where Firefox just doesn't work? Well, we put together this guide to help. It'll show you where you can find solutions to many common issues and, as always, if you need extra help with any of this, we have a community of volunteers standing by.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_restore-firefox-to-its-default-state\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Restore Firefox to its default state</span></a></li><li class=\"toclevel-1\"><a href=\"#w_firefox-crashes\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Firefox crashes</span></a></li><li class=\"toclevel-1\"><a href=\"#w_firefox-wont-start\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Firefox won't start</span></a></li><li class=\"toclevel-1\"><a href=\"#w_firefox-is-slow\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Firefox is slow</span></a></li><li class=\"toclevel-1\"><a href=\"#w_websites-wont-load\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Websites won't load</span></a></li><li class=\"toclevel-1\"><a href=\"#w_this-didnt-solve-my-problem-what-do-i-do-now\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">This didn't solve my problem. What do I do now?</span></a></li></ul></div>\n<h1 id=\"w_restore-firefox-to-its-default-state\">Restore Firefox to its default state</h1>\n<p>The <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">Refresh Firefox feature</a> can fix many issues by restoring Firefox to its default state while saving your essential information. Consider using it before going through a lengthy troubleshooting process.\n\n</p>\n<h1 id=\"w_firefox-crashes\">Firefox crashes</h1>\n<p>Check out our handy guide, <a href=\"/en-US/kb/avoid-crashes-tips-and-tricks\">Avoid crashes - Tips and tricks</a>.\n</p>\n<h1 id=\"w_firefox-wont-start\">Firefox won't start</h1>\n<p>That's a pretty big problem. The <a href=\"/en-US/kb/firefox-wont-start-find-solutions\">Firefox won't start - find solutions</a> article should cover it.\n</p>\n<h1 id=\"w_firefox-is-slow\">Firefox is slow</h1>\n<p>Slowdowns can be caused by a number of things so we've summed them up in the <a href=\"/en-US/kb/quick-fixes-if-your-firefox-slows-down\">Quick fixes if your Firefox slows down</a> guide.\n</p>\n<h1 id=\"w_websites-wont-load\">Websites won't load</h1>\n<p>Getting error messages when you try to load up a website? Here's a few articles to help fix specific connection problems.\n</p>\n<ul><li>If you just upgraded Firefox and it can no longer open any websites but other browsers or programs can, see the <a href=\"/en-US/kb/fix-problems-connecting-websites-after-updating\">Fix problems connecting to websites after updating Firefox</a> article.\n</li><li>If no programs can open websites, see the aptly named <a href=\"/en-US/kb/firefox-and-other-browsers-cant-load-websites\">Firefox and other browsers can't load websites</a> article.\n</li><li>If Firefox is having problems loading certain websites, see <a href=\"/en-US/kb/firefox-cant-load-websites-other-browsers-can\">Firefox can't load websites but other browsers can</a>.\n</li><li>For other issues loading websites, see the <a href=\"/en-US/kb/websites-dont-load-troubleshoot-and-fix-errors\">Websites don't load - troubleshoot and fix error messages</a> article.\n</li></ul>\n<h1 id=\"w_this-didnt-solve-my-problem-what-do-i-do-now\">This didn't solve my problem. What do I do now?</h1>\n<p>Sometimes tracking down the source of these kinds of problems is difficult. We have a community of volunteers ready to help you figure it out. To ask a question or find other support resources, see <a href=\"/en-US/kb/get-community-support\">Get community support</a>.\n</p><p>\n</p>",
  "text": "Do you have days where Firefox just doesn't work? Well, we put together this guide to help. It'll show you where you can find solutions to many common issues and, as always, if you need extra help with any of this, we have a community of volunteers standing by. Table of Contents 1 Restore Firefox to its default state 2 Firefox crashes 3 Firefox won't start 4 Firefox is slow 5 Websites won't load 6 This didn't solve my problem. What do I do now? Restore Firefox to its default state The Refresh Firefox feature can fix many issues by restoring Firefox to its default state while saving your essential information. Consider using it before going through a lengthy troubleshooting process. Firefox crashes Check out our handy guide, Avoid crashes - Tips and tricks . Firefox won't start That's a pretty big problem. The Firefox won't start - find solutions article should cover it. Firefox is slow Slowdowns can be caused by a number of things so we've summed them up in the Quick fixes if your Firefox slows down guide. Websites won't load Getting error messages when you try to load up a website? Here's a few articles to help fix specific connection problems. If you just upgraded Firefox and it can no longer open any websites but other browsers or programs can, see the Fix problems connecting to websites after updating Firefox article. If no programs can open websites, see the aptly named Firefox and other browsers can't load websites article. If Firefox is having problems loading certain websites, see Firefox can't load websites but other browsers can . For other issues loading websites, see the Websites don't load - troubleshoot and fix error messages article. This didn't solve my problem. What do I do now? Sometimes tracking down the source of these kinds of problems is difficult. We have a community of volunteers ready to help you figure it out. To ask a question or find other support resources, see Get community support .",
  "products": [
    "firefox"
  ],
  "topics": [
    "performance-and-connectivity"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3687,
    "text_bytes": 1946,
    "word_count": 337,
    "downloaded_at": "2025-08-26T10:34:37.958963"
  }
}