{
  "slug": "firefox-dns-over-https",
  "title": "Firefox DNS over HTTPS",
  "summary": "DoH improves privacy by hiding domain name lookups from anyone lurking on public Wi-Fi, your ISP or others on your local network. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-dns-over-https",
  "html": "<p>This article describes DNS over HTTPS and how to enable, edit settings, or disable this feature.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_about-dns-over-https\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">About DNS over HTTPS</span></a></li><li class=\"toclevel-1\"><a href=\"#w_benefits\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Benefits</span></a></li><li class=\"toclevel-1\"><a href=\"#w_risks\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Risks</span></a></li><li class=\"toclevel-1\"><a href=\"#w_about-our-rollout-of-dns-over-https\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">About our rollout of DNS over HTTPS</span></a></li><li class=\"toclevel-1\"><a href=\"#w_opt-out\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Opt-out</span></a></li><li class=\"toclevel-1\"><a href=\"#w_enable-disable-and-configure-dns-over-https\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Enable, disable and configure DNS over HTTPS</span></a></li><li class=\"toclevel-1\"><a href=\"#w_configure-networks-to-disable-doh\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">Configure Networks to Disable DoH</span></a></li><li class=\"toclevel-1\"><a href=\"#w_encrypted-client-hello-ech\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">Encrypted Client Hello (ECH)</span></a></li></ul></div>\n<h1 id=\"w_about-dns-over-https\">About DNS over HTTPS</h1>\n<p>When you type a web address or domain name into your address bar (example: <a href=\"https://www.mozilla.org\">www.mozilla.org</a>), your browser sends a request over the Internet to look up the IP address for that website. Traditionally, this request is sent to servers over a plain text connection. This connection is not encrypted, making it easy for third-parties to see what website you’re about to access.\n</p><p><a href=\"https://wikipedia.org/wiki/DNS_over_HTTPS\">DNS over HTTPS</a> (DoH) works differently. It sends the domain name you typed to a DoH-compatible DNS server using an encrypted HTTPS connection instead of a plain text one. This prevents third-parties from seeing what websites you are trying to access.\n</p>\n<h1 id=\"w_benefits\">Benefits</h1>\n<p>DoH improves privacy by hiding domain name lookups from someone lurking on public Wi-Fi, your ISP, or anyone else on your local network. DoH, when enabled, ensures that your ISP cannot collect and sell personal information related to your browsing behavior.\n</p>\n<h1 id=\"w_risks\">Risks</h1>\n<ul><li>Some individuals and organizations rely on DNS to block malware, enable parental controls, or filter your browser’s access to websites. When enabled, DoH bypasses your local DNS resolver and defeats these special policies. When enabling DoH by default for users, Firefox allows users (via settings) and organizations (via enterprise policies and a canary domain lookup) to disable DoH when it interferes with a preferred policy.\n</li><li>When DoH is enabled, Firefox by default directs DoH queries to DNS servers that are operated by a trusted partner, which has the ability to see users' queries. Mozilla has a strong <a href=\"https://wiki.mozilla.org/Security/DOH-resolver-policy\">Trusted Recursive Resolver (TRR) policy</a> in place that forbids our partners from collecting personal identifying information. To mitigate this risk, our partners are contractually bound to adhere to this policy.\n</li><li>DoH could be slower than traditional DNS queries, but in testing, we found that the <a href=\"https://blog.mozilla.org/futurereleases/2019/04/02/dns-over-https-doh-update-recent-testing-results-and-next-steps/\">impact is minimal and in many cases DoH is faster</a>.\n</li></ul>\n<h1 id=\"w_about-our-rollout-of-dns-over-https\">About our rollout of DNS over HTTPS</h1>\n<p>We completed our rollout of DoH by default to all United States Firefox desktop users in 2019 and to all Canadian Firefox desktop users in 2021. We began our rollout by default to Russia and Ukraine Firefox desktop users in March 2022. We are currently working toward rolling out DoH in more countries. As we do so, DoH is enabled for users in “fallback” mode. For example, if the domain name lookups that are using DoH fail for some reason, Firefox will fall back and use the default DNS configured by the operating system (OS) instead of displaying an error.\n</p>\n<h1 id=\"w_opt-out\">Opt-out</h1>\n<p>You can opt out of using DoH or choose a custom DoH provider in the <strong>DNS over HTTPS</strong> Firefox settings.\n</p><p><img alt=\"dnsoverhtttps\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-06-05-12-56-08-52c6dd.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</p><p>In addition, Firefox will check for certain functions that might be affected if DoH is enabled, including:\n</p>\n<ul><li>Are parental controls enabled?\n</li><li>Is the default DNS server filtering potentially malicious content?\n</li><li>Is the device managed by an organization that might have a special DNS configuration?\n</li></ul>\n<p>If any of these tests determine that DoH might interfere with the function, DoH will not be enabled. These tests will run every time the device connects to a different network.\n</p>\n<h1 id=\"w_enable-disable-and-configure-dns-over-https\">Enable, disable and configure DNS over HTTPS</h1>\n<p>See the <a href=\"/en-US/kb/dns-over-https\">Configure DNS over HTTPS protection levels in Firefox</a> article.\n</p>\n<h1 id=\"w_configure-networks-to-disable-doh\">Configure Networks to Disable DoH</h1>\n<ul><li><a href=\"/en-US/kb/configuring-networks-disable-dns-over-https\">Configure networks to disable DNS over HTTPS</a>\n</li><li><a href=\"/en-US/kb/dns-over-https-doh-faqs\">DNS over HTTPS (DoH) FAQs</a>\n</li></ul>\n<h1 id=\"w_encrypted-client-hello-ech\">Encrypted Client Hello (ECH)</h1>\n<p>With <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 118, we rolled out a significant security feature: the Encrypted Client Hello (ECH). Its primary role is to reinforce the security of the initial connection <em>handshake</em> made during online interactions. ECH, in conjunction with DNS over HTTPS (DoH), takes browsing security up a notch:\n</p>\n<ul><li><strong>DoH as a prerequisite:</strong> In Firefox's implementation, ECH relies on DoH to fetch the necessary encryption keys for the <em>handshake</em>. Without DoH activated, ECH cannot operate.\n</li><li><strong>Synergized protection:</strong> DoH works by encrypting DNS queries, effectively safeguarding the conversion of website names to IP addresses. On the other hand, ECH focuses on encrypting the initial exchanges between the user and the website. Together, they present a comprehensive defense against many online threats.\n</li><li><strong>Enhanced protection:</strong> With both ECH and DoH enabled, users gain an enhanced dual-layer of privacy, diminishing potential vulnerabilities and amplifying online discretion.\n</li></ul>\n<p>Ensure DoH is enabled in Firefox to fully benefit from the security enhancements provided by ECH. For a detailed understanding, see <a href=\"/en-US/kb/understand-encrypted-client-hello\">Understand Encrypted Client Hello (ECH)</a> and <a href=\"/en-US/kb/faq-encrypted-client-hello\">Encrypted Client Hello (ECH) - Frequently asked questions</a>.\n</p>",
  "text": "This article describes DNS over HTTPS and how to enable, edit settings, or disable this feature. Table of Contents 1 About DNS over HTTPS 2 Benefits 3 Risks 4 About our rollout of DNS over HTTPS 5 Opt-out 6 Enable, disable and configure DNS over HTTPS 7 Configure Networks to Disable DoH 8 Encrypted Client Hello (ECH) About DNS over HTTPS When you type a web address or domain name into your address bar (example: www.mozilla.org ), your browser sends a request over the Internet to look up the IP address for that website. Traditionally, this request is sent to servers over a plain text connection. This connection is not encrypted, making it easy for third-parties to see what website you’re about to access. DNS over HTTPS (DoH) works differently. It sends the domain name you typed to a DoH-compatible DNS server using an encrypted HTTPS connection instead of a plain text one. This prevents third-parties from seeing what websites you are trying to access. Benefits DoH improves privacy by hiding domain name lookups from someone lurking on public Wi-Fi, your ISP, or anyone else on your local network. DoH, when enabled, ensures that your ISP cannot collect and sell personal information related to your browsing behavior. Risks Some individuals and organizations rely on DNS to block malware, enable parental controls, or filter your browser’s access to websites. When enabled, DoH bypasses your local DNS resolver and defeats these special policies. When enabling DoH by default for users, Firefox allows users (via settings) and organizations (via enterprise policies and a canary domain lookup) to disable DoH when it interferes with a preferred policy. When DoH is enabled, Firefox by default directs DoH queries to DNS servers that are operated by a trusted partner, which has the ability to see users' queries. Mozilla has a strong Trusted Recursive Resolver (TRR) policy in place that forbids our partners from collecting personal identifying information. To mitigate this risk, our partners are contractually bound to adhere to this policy. DoH could be slower than traditional DNS queries, but in testing, we found that the impact is minimal and in many cases DoH is faster . About our rollout of DNS over HTTPS We completed our rollout of DoH by default to all United States Firefox desktop users in 2019 and to all Canadian Firefox desktop users in 2021. We began our rollout by default to Russia and Ukraine Firefox desktop users in March 2022. We are currently working toward rolling out DoH in more countries. As we do so, DoH is enabled for users in “fallback” mode. For example, if the domain name lookups that are using DoH fail for some reason, Firefox will fall back and use the default DNS configured by the operating system (OS) instead of displaying an error. Opt-out You can opt out of using DoH or choose a custom DoH provider in the DNS over HTTPS Firefox settings. In addition, Firefox will check for certain functions that might be affected if DoH is enabled, including: Are parental controls enabled? Is the default DNS server filtering potentially malicious content? Is the device managed by an organization that might have a special DNS configuration? If any of these tests determine that DoH might interfere with the function, DoH will not be enabled. These tests will run every time the device connects to a different network. Enable, disable and configure DNS over HTTPS See the Configure DNS over HTTPS protection levels in Firefox article. Configure Networks to Disable DoH Configure networks to disable DNS over HTTPS DNS over HTTPS (DoH) FAQs Encrypted Client Hello (ECH) With Firefox version 118, we rolled out a significant security feature: the Encrypted Client Hello (ECH). Its primary role is to reinforce the security of the initial connection handshake made during online interactions. ECH, in conjunction with DNS over HTTPS (DoH), takes browsing security up a notch: DoH as a prerequisite: In Firefox's implementation, ECH relies on DoH to fetch the necessary encryption keys for the handshake . Without DoH activated, ECH cannot operate. Synergized protection: DoH works by encrypting DNS queries, effectively safeguarding the conversion of website names to IP addresses. On the other hand, ECH focuses on encrypting the initial exchanges between the user and the website. Together, they present a comprehensive defense against many online threats. Enhanced protection: With both ECH and DoH enabled, users gain an enhanced dual-layer of privacy, diminishing potential vulnerabilities and amplifying online discretion. Ensure DoH is enabled in Firefox to fully benefit from the security enhancements provided by ECH. For a detailed understanding, see Understand Encrypted Client Hello (ECH) and Encrypted Client Hello (ECH) - Frequently asked questions .",
  "products": [
    "firefox"
  ],
  "topics": [
    "performance-and-connectivity",
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 7413,
    "text_bytes": 4810,
    "word_count": 780,
    "downloaded_at": "2025-08-26T10:51:40.447278"
  }
}