{
  "slug": "firefox-uses-too-much-memory-or-cpu-resources",
  "title": "Firefox uses too much memory or CPU resources - How to fix",
  "summary": "Learn how to reduce Firefox's system resource usage for a faster, more stable browsing experience.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-uses-too-much-memory-or-cpu-resources",
  "html": "<p>At times, Firefox may require significant system resources in order to download, process, and display web content. If you are experiencing periods of sustained high resource usage while using Firefox, this article presents some options for you to review.\n</p>\n<ul><li> The CPU (Central Processing Unit) is the \"brain\" of the computer.\n</li><li> The RAM (Random Access Memory) or Memory helps your computer perform multiple tasks at the same time.\n</li><li> When your system resources are being heavily used, the overall performance and stability of the computer can be impacted.\n</li><li> Depending on your operating system, you can review and monitor resource usage through specific tools. See the <a href=\"#w_use-additional-troubleshooting-tools\">Use additional troubleshooting tools</a> section below for more information.\n</li></ul>\n<div class=\"note\"><strong>Note:</strong> If you <a href=\"/en-US/kb/manage-firefox-data-collection-privacy-settings\">send performance data</a>, Mozilla will gather data including memory and CPU usage, which will help make Firefox better for future versions.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_update-to-the-latest-version\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Update to the latest version</span></a></li><li class=\"toclevel-1\"><a href=\"#w_restart-firefox\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Restart Firefox</span></a></li><li class=\"toclevel-1\"><a href=\"#w_restart-your-computer\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Restart your computer</span></a></li><li class=\"toclevel-1\"><a href=\"#w_disable-resource-consuming-extensions-and-themes\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Disable resource consuming extensions and themes</span></a></li><li class=\"toclevel-1\"><a href=\"#w_hide-intrusive-content\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Hide intrusive content</span></a></li><li class=\"toclevel-1\"><a href=\"#w_use-fewer-tabs\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Use fewer tabs</span></a></li><li class=\"toclevel-1\"><a href=\"#w_close-tabs-that-use-too-many-system-resources\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">Close tabs that use too many system resources</span></a></li><li class=\"toclevel-1\"><a href=\"#w_check-firefox-hardware-acceleration\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">Check Firefox hardware acceleration</span></a></li><li class=\"toclevel-1\"><a href=\"#w_close-other-applications\"><span class=\"tocnumber\">9</span> <span class=\"toctext\">Close other applications</span></a></li><li class=\"toclevel-1\"><a href=\"#w_delete-content-prefs-sqlite-file\"><span class=\"tocnumber\">10</span> <span class=\"toctext\">Delete content-prefs.sqlite file</span></a></li><li class=\"toclevel-1\"><a href=\"#w_refresh-firefox\"><span class=\"tocnumber\">11</span> <span class=\"toctext\">Refresh Firefox</span></a></li><li class=\"toclevel-1\"><a href=\"#w_use-additional-troubleshooting-tools\"><span class=\"tocnumber\">12</span> <span class=\"toctext\">Use additional troubleshooting tools</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_firefox-tools\"><span class=\"tocnumber\">12.1</span> <span class=\"toctext\">Firefox tools</span></a></li><li class=\"toclevel-2\"><a href=\"#w_operating-system-tools\"><span class=\"tocnumber\">12.2</span> <span class=\"toctext\">Operating system tools</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_add-ram-to-your-computer\"><span class=\"tocnumber\">13</span> <span class=\"toctext\">Add RAM to your computer</span></a></li><li class=\"toclevel-1\"><a href=\"#w_upgrade-your-computer\"><span class=\"tocnumber\">14</span> <span class=\"toctext\">Upgrade your computer</span></a></li></ul></div>\n<h1 id=\"w_update-to-the-latest-version\">Update to the latest version</h1>\n<p>The latest Firefox version may include performance improvements. <a href=\"/en-US/kb/update-firefox-latest-release\">Update Firefox to the latest release</a>.\n</p>\n<h1 id=\"w_restart-firefox\">Restart Firefox</h1>\n<p>Firefox may use more system resources if it's left open for long periods of time. A workaround for this is to periodically restart Firefox. You can configure Firefox to save your tabs and windows so that when you start it again, you can start where you left off. See <a href=\"/en-US/kb/restore-previous-session\">Restore previous session - Configure when Firefox shows your most recent tabs and windows</a> for details.\n</p>\n<h1 id=\"w_restart-your-computer\">Restart your computer</h1>\n<p>Firefox may grind to a halt due to operating system issues<span class=\"for\" data-for=\"win10,win11\">, such as a pending Windows update,</span> that can be resolved by restarting your computer.\n</p>\n<h1 id=\"w_disable-resource-consuming-extensions-and-themes\">Disable resource consuming extensions and themes</h1>\n<p>Extensions and themes can cause Firefox to use more system resources than it normally would.\n</p><p>To determine if an extension or theme is causing Firefox to use too many resources, <a href=\"/en-US/kb/diagnose-firefox-issues-using-troubleshoot-mode\">start Firefox in Troubleshoot Mode</a> and observe its memory and CPU usage. In Troubleshoot Mode, extensions and themes are disabled, so if you notice a significant improvement, you can try disabling or uninstalling extensions.\n</p>\n<ul><li> For more information on starting Firefox in Troubleshoot Mode and on how to find which extension or theme is causing your problem, see <a href=\"/en-US/kb/troubleshoot-extensions-themes-to-fix-problems\">Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems</a>.\n</li></ul>\n<h1 id=\"w_hide-intrusive-content\">Hide intrusive content</h1>\n<p>Many web pages have content you don't need, but which still use system resources to display its content. Firefox's built-in content blocking can help save resources by preventing third-party tracking content from loading. See the <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a> article for details.\n</p><p>Some extensions allow you to block unnecessary content; for example:\n</p>\n<ul><li> <a href=\"https://addons.mozilla.org/firefox/addon/adblock-plus/\">Adblock Plus</a> and <a href=\"https://addons.mozilla.org/firefox/addon/ublock-origin/\">uBlock Origin</a> allow you to hide ads on websites.\n</li><li> <a href=\"https://addons.mozilla.org/firefox/addon/noscript\">NoScript</a> allows you to selectively enable and disable scripts running on websites.\n</li></ul>\n<p></p><div class=\"note\">Please reach out to the add-on developer directly, if you need help with a specific add-on.</div>\n<p></p>\n<h1 id=\"w_use-fewer-tabs\">Use fewer tabs</h1>\n<p>Each tab requires Firefox to store a web page in memory. If you frequently have <strong>more than 100 tabs open</strong>, consider using a more lightweight mechanism to keep track of pages to read and things to do, such as:\n</p>\n<ul><li> <a href=\"/en-US/kb/bookmarks-firefox\">Bookmarks</a>. <em>Hint: \"<a href=\"/en-US/kb/tabs-organize-websites-single-window#w_tab-tips\">Bookmark All Tabs</a>\" will bookmark a set of tabs.</em>\n</li><li> <a href=\"/en-US/kb/save-web-pages-later-pocket-firefox\">Save web pages for later with Pocket for Firefox</a>.\n</li><li> <a href=\"http://lifehacker.com/378062/five-best-gtd-applications\">To-do list applications</a>.\n</li></ul>\n<h1 id=\"w_close-tabs-that-use-too-many-system-resources\">Close tabs that use too many system resources</h1>\n<p>Some websites use scripts that use a lot of memory and/or CPU to keep them up to date, such as online mail client pages. If these scripts are not optimized, they can lead to the use of too many system resources. You can see which tabs are using the most system resources by opening the <a href=\"/en-US/kb/task-manager-tabs-or-extensions-are-slowing-firefox\">Firefox Task Manager</a> (<em>about:processes</em> page). If you do not need these tabs open all the time, you can close them to reduce system resources usage.\n</p>\n<h1 id=\"w_check-firefox-hardware-acceleration\">Check Firefox hardware acceleration</h1>\n<p>Firefox hardware acceleration eases memory and CPU usage in many cases.\nCheck in <a href=\"/en-US/kb/performance-settings\">Firefox's performance settings</a> that hardware acceleration is turned on.  Also make sure that <a href=\"/en-US/kb/upgrade-graphics-drivers-use-hardware-acceleration\">your graphics drivers are up-to-date</a>.\n</p>\n<h1 id=\"w_close-other-applications\">Close other applications</h1>\n<p>Having many applications running simultaneously may cause your computer to run slowly and other applications to do so as well. By closing down some of the unnecessary applications, system usage will be reduced.\n</p>\n<h1 id=\"w_delete-content-prefs-sqlite-file\">Delete content-prefs.sqlite file</h1>\n<p>Firefox stores your data in various files in your profile folder. The file used for saving individual website settings might be corrupt. If you delete (or rename) that file, your zoom level settings will be reset but it could decrease CPU usage.\n</p>\n<ol><li> <ul><li><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"menu\">Help</span> and select <span class=\"menu\">More Troubleshooting Information</span>.</span><span class=\"for\" data-for=\"mac\">From the <span class=\"menu\">Help</span> menu, select <span class=\"menu\">More Troubleshooting Information</span>.</span> The <strong>Troubleshooting Information</strong> tab will open.\n</li><li>Under the <strong>Application Basics</strong> section next to <em><span class=\"for\" data-for=\"not linux\">Profile Folder</span><span class=\"for\" data-for=\"linux\">Profile Directory</span></em>, click <span class=\"button\"><span class=\"for\" data-for=\"win\">Open Folder</span><span class=\"for\" data-for=\"mac\">Show in Finder</span><span class=\"for\" data-for=\"linux\">Open Directory</span></span>. <span class=\"for\" data-for=\"mac\">A window will open that contains your profile folder.</span><span class=\"for\" data-for=\"win\">Your profile folder will open.</span><span class=\"for\" data-for=\"linux\">Your profile directory will open.</span>\n</li></ul>\n<div class=\"note\"><strong>Note:</strong>  If<span class=\"for\" data-for=\"win10,win11\"> Firefox displays an error after clicking <span class=\"button\">Open Folder</span> or if</span> you are unable to open or use Firefox, follow the instructions in <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data#w_finding-your-profile-without-opening-firefox\">Finding your profile without opening Firefox</a>.</div>\n</li><li> <span class=\"for\" data-for=\"win\">Click the Firefox menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Exit</span>.</span><span class=\"for\" data-for=\"mac\">Click the Firefox menu at the top of the screen and select <span class=\"menu\">Quit Firefox</span>.</span><span class=\"for\" data-for=\"linux\">Click the Firefox menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Quit</span>.</span>\n\n</li><li> In your profile folder, delete the file <span class=\"filepath\">content-prefs.sqlite</span>. It will be recreated next time you open Firefox.\n</li></ol>\n<h1 id=\"w_refresh-firefox\">Refresh Firefox</h1>\n<p>The <em>Refresh Firefox</em> feature can fix many issues by restoring your <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">Firefox profile</a> to its default state while saving your essential information.\nSee <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">Refresh Firefox - reset add-ons and settings</a> for details.\n</p>\n<h1 id=\"w_use-additional-troubleshooting-tools\">Use additional troubleshooting tools</h1>\n<p>There are a variety of troubleshooting tools that can be used both in Firefox and on your operating system to troubleshoot elevated system resource usage.\n</p>\n<h2 id=\"w_firefox-tools\">Firefox tools</h2>\n<ul><li> The <a href=\"/en-US/kb/task-manager-tabs-or-extensions-are-slowing-firefox\">Firefox Task Manager</a> (not to be confused with Windows Task Manager) is a great tool to see whether tabs and extensions are using too many system resources.\n</li><li> The <strong>about:memory</strong> page allows you to troubleshoot specific issues relating to memory (for instance, caused by a website, an extension, a theme, etc.) and sometimes its <span class=\"button\">Minimize memory usage</span> button may help you instantly reduce memory usage. For guidance on use of <strong>about:memory</strong> visit <a href=\"https://firefox-source-docs.mozilla.org/performance/memory/about_colon_memory.html\">about:memory</a>.\n</li><li> Even if you're not a programmer, you can try your hand at some other  <a href=\"https://firefox-source-docs.mozilla.org/performance/index.html#memory-profiling-and-leak-detection-tools\">tools and tips Firefox developers use to debug leaks</a>.\n</li></ul>\n<h2 id=\"w_operating-system-tools\">Operating system tools</h2>\n<div class=\"for\" data-for=\"win\">\n<ul><li> View how system resources are being used by checking <a href=\"https://wikipedia.org/wiki/Task_Manager_(Windows)\">the Windows Task Manager</a> <em>Performance</em> tab<span class=\"for\" data-for=\"win8,win10,win11\"> (click on \"More details\" in the Task Manager to show all tabs)</span>. See <a href=\"https://blogs.windows.com/windowsexperience/2013/06/06/windows-8-task-manager-in-depth/\">this Windows blog post</a> at Microsoft's site for more information. \n</li></ul>\n</div><div class=\"for\" data-for=\"mac\">\n<ul><li> View how system resources are being used by checking Activity Monitor. See <a href=\"https://support.apple.com/en-ca/HT201464\">How to use Activity Monitor on your Mac</a> at Apple's site for more information.\n</li></ul>\n</div><div class=\"for\" data-for=\"linux\">\n<ul><li> Although it's not included on every distribution of Linux, most versions of Linux have a graphical resource monitor. It's often called System Monitor, but there are other alternatives also available.\n</li><li> Running the <code>top</code> command in the terminal will display a list of all the running processes and their system resource consumption.\n</li></ul>\n</div>\n<div class=\"warning\"><strong>WARNING:</strong> There are a variety of third-party programs that promise to increase your computer's performance. You should exercise caution when installing third-party software and only use reputable software provided by an official source.</div>\n<h1 id=\"w_add-ram-to-your-computer\">Add RAM to your computer</h1>\n<p>If you exhausted all tips in the previous sections and your memory usage is still close to the maximum, maybe it's time for you to add more memory to your computer. Adding RAM will provide a huge performance boost.\n</p>\n<h1 id=\"w_upgrade-your-computer\">Upgrade your computer</h1>\n<p>If you exhausted all tips in the previous sections and you are still experiencing high system resource usage, it may be time to upgrade your computer. As technology progresses, software is becoming more advanced and requires more powerful computers to run effectively.\n</p>",
  "text": "At times, Firefox may require significant system resources in order to download, process, and display web content. If you are experiencing periods of sustained high resource usage while using Firefox, this article presents some options for you to review. The CPU (Central Processing Unit) is the \"brain\" of the computer. The RAM (Random Access Memory) or Memory helps your computer perform multiple tasks at the same time. When your system resources are being heavily used, the overall performance and stability of the computer can be impacted. Depending on your operating system, you can review and monitor resource usage through specific tools. See the Use additional troubleshooting tools section below for more information. Note: If you send performance data , Mozilla will gather data including memory and CPU usage, which will help make Firefox better for future versions. Table of Contents 1 Update to the latest version 2 Restart Firefox 3 Restart your computer 4 Disable resource consuming extensions and themes 5 Hide intrusive content 6 Use fewer tabs 7 Close tabs that use too many system resources 8 Check Firefox hardware acceleration 9 Close other applications 10 Delete content-prefs.sqlite file 11 Refresh Firefox 12 Use additional troubleshooting tools 12.1 Firefox tools 12.2 Operating system tools 13 Add RAM to your computer 14 Upgrade your computer Update to the latest version The latest Firefox version may include performance improvements. Update Firefox to the latest release . Restart Firefox Firefox may use more system resources if it's left open for long periods of time. A workaround for this is to periodically restart Firefox. You can configure Firefox to save your tabs and windows so that when you start it again, you can start where you left off. See Restore previous session - Configure when Firefox shows your most recent tabs and windows for details. Restart your computer Firefox may grind to a halt due to operating system issues , such as a pending Windows update, that can be resolved by restarting your computer. Disable resource consuming extensions and themes Extensions and themes can cause Firefox to use more system resources than it normally would. To determine if an extension or theme is causing Firefox to use too many resources, start Firefox in Troubleshoot Mode and observe its memory and CPU usage. In Troubleshoot Mode, extensions and themes are disabled, so if you notice a significant improvement, you can try disabling or uninstalling extensions. For more information on starting Firefox in Troubleshoot Mode and on how to find which extension or theme is causing your problem, see Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems . Hide intrusive content Many web pages have content you don't need, but which still use system resources to display its content. Firefox's built-in content blocking can help save resources by preventing third-party tracking content from loading. See the Enhanced Tracking Protection article for details. Some extensions allow you to block unnecessary content; for example: Adblock Plus and uBlock Origin allow you to hide ads on websites. NoScript allows you to selectively enable and disable scripts running on websites. Please reach out to the add-on developer directly, if you need help with a specific add-on. Use fewer tabs Each tab requires Firefox to store a web page in memory. If you frequently have more than 100 tabs open , consider using a more lightweight mechanism to keep track of pages to read and things to do, such as: Bookmarks . Hint: \" Bookmark All Tabs \" will bookmark a set of tabs. Save web pages for later with Pocket for Firefox . To-do list applications . Close tabs that use too many system resources Some websites use scripts that use a lot of memory and/or CPU to keep them up to date, such as online mail client pages. If these scripts are not optimized, they can lead to the use of too many system resources. You can see which tabs are using the most system resources by opening the Firefox Task Manager ( about:processes page). If you do not need these tabs open all the time, you can close them to reduce system resources usage. Check Firefox hardware acceleration Firefox hardware acceleration eases memory and CPU usage in many cases. Check in Firefox's performance settings that hardware acceleration is turned on. Also make sure that your graphics drivers are up-to-date . Close other applications Having many applications running simultaneously may cause your computer to run slowly and other applications to do so as well. By closing down some of the unnecessary applications, system usage will be reduced. Delete content-prefs.sqlite file Firefox stores your data in various files in your profile folder. The file used for saving individual website settings might be corrupt. If you delete (or rename) that file, your zoom level settings will be reset but it could decrease CPU usage. Click the menu button , click Help and select More Troubleshooting Information . From the Help menu, select More Troubleshooting Information . The Troubleshooting Information tab will open. Under the Application Basics section next to Profile Folder Profile Directory , click Open Folder Show in Finder Open Directory . A window will open that contains your profile folder. Your profile folder will open. Your profile directory will open. Note: If Firefox displays an error after clicking Open Folder or if you are unable to open or use Firefox, follow the instructions in Finding your profile without opening Firefox . Click the Firefox menu and select Exit . Click the Firefox menu at the top of the screen and select Quit Firefox . Click the Firefox menu and select Quit . In your profile folder, delete the file content-prefs.sqlite . It will be recreated next time you open Firefox. Refresh Firefox The Refresh Firefox feature can fix many issues by restoring your Firefox profile to its default state while saving your essential information. See Refresh Firefox - reset add-ons and settings for details. Use additional troubleshooting tools There are a variety of troubleshooting tools that can be used both in Firefox and on your operating system to troubleshoot elevated system resource usage. Firefox tools The Firefox Task Manager (not to be confused with Windows Task Manager) is a great tool to see whether tabs and extensions are using too many system resources. The about:memory page allows you to troubleshoot specific issues relating to memory (for instance, caused by a website, an extension, a theme, etc.) and sometimes its Minimize memory usage button may help you instantly reduce memory usage. For guidance on use of about:memory visit about:memory . Even if you're not a programmer, you can try your hand at some other tools and tips Firefox developers use to debug leaks . Operating system tools View how system resources are being used by checking the Windows Task Manager Performance tab (click on \"More details\" in the Task Manager to show all tabs) . See this Windows blog post at Microsoft's site for more information. View how system resources are being used by checking Activity Monitor. See How to use Activity Monitor on your Mac at Apple's site for more information. Although it's not included on every distribution of Linux, most versions of Linux have a graphical resource monitor. It's often called System Monitor, but there are other alternatives also available. Running the top command in the terminal will display a list of all the running processes and their system resource consumption. WARNING: There are a variety of third-party programs that promise to increase your computer's performance. You should exercise caution when installing third-party software and only use reputable software provided by an official source. Add RAM to your computer If you exhausted all tips in the previous sections and your memory usage is still close to the maximum, maybe it's time for you to add more memory to your computer. Adding RAM will provide a huge performance boost. Upgrade your computer If you exhausted all tips in the previous sections and you are still experiencing high system resource usage, it may be time to upgrade your computer. As technology progresses, software is becoming more advanced and requires more powerful computers to run effectively.",
  "products": [
    "firefox"
  ],
  "topics": [
    "crashing-and-slow-performance",
    "performance-and-connectivity"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 15774,
    "text_bytes": 8363,
    "word_count": 1360,
    "downloaded_at": "2025-08-26T09:03:55.201728"
  }
}