{
  "slug": "firefox-wont-start-find-solutions",
  "title": "Firefox won't start - find solutions",
  "summary": "This article explains what to do if the Firefox window does not open or you get an error message when you try to start Firefox.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-wont-start-find-solutions",
  "html": "<p>This article describes what to do if Firefox does not open when you click the Firefox icon.\n</p>\n<ul><li> If Firefox hangs or stops responding as soon as you open it, see <a href=\"/en-US/kb/firefox-hangs-or-not-responding\">Firefox hangs or is not responding - How to fix</a>.\n</li><li> If you get a message that you can dismiss (such as <em>\"TypeError: Components.classes['@ … ;1'] is undefined\"</em>, <em>\"onload error TypeError: …\"</em>, <em>\"Exc in ev handl: …\"</em>) but you can open Firefox, see <a href=\"/en-US/kb/troubleshoot-extensions-themes-to-fix-problems\">Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems</a>.\n</li><li> If Firefox starts but won't load any websites, see <a href=\"/en-US/kb/websites-dont-load-troubleshoot-and-fix-errors\">Websites don't load - troubleshoot and fix error messages</a>.\n</li></ul>\n<div class=\"note\"><strong>Note:</strong> The <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">Refresh Firefox feature</a> can fix many issues by restoring Firefox to its default state while saving your essential information. Consider using it before going through a lengthy troubleshooting process.\n The Firefox <a href=\"/en-US/kb/diagnose-firefox-issues-using-troubleshoot-mode#w_troubleshoot-mode-window\">Troubleshoot Mode window</a> includes a Refresh Firefox option. You can start Firefox in Troubleshoot Mode by <span class=\"for\" data-for=\"win\">holding down the <span class=\"key\">shift</span> key while starting Firefox.</span><span class=\"for\" data-for=\"mac\">holding down the <span class=\"key\">option</span> key while starting Firefox.</span><span class=\"for\" data-for=\"linux\">quitting Firefox and then going to your <strong>Terminal</strong> and running: <code>firefox -safe-mode</code><br>You may need to specify the Firefox installation path (e.g. <span class=\"filepath\">/usr/lib/firefox</span>)</span></div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_specific-error-messages\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Specific error messages</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_mozilla-crash-reporter\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Mozilla Crash Reporter</span></a></li><li class=\"toclevel-2\"><a href=\"#w_firefox-is-already-running-but-is-not-responding\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Firefox is already running but is not responding</span></a></li><li class=\"toclevel-2\"><a href=\"#w_your-firefox-profile-cannot-be-loaded-it-may-be-missing-or-inaccessible\"><span class=\"tocnumber\">1.3</span> <span class=\"toctext\">Your Firefox profile cannot be loaded. It may be missing or inaccessible</span></a></li><li class=\"toclevel-2\"><a href=\"#w_failed-to-read-the-configuration-file\"><span class=\"tocnumber\">1.4</span> <span class=\"toctext\">Failed to read the configuration file</span></a></li><li class=\"toclevel-2\"><a href=\"#w_xulrunner-error\"><span class=\"tocnumber\">1.5</span> <span class=\"toctext\">XULRunner - Error</span></a></li><li class=\"toclevel-2\"><a href=\"#w_there-was-an-error-launching-the-application\"><span class=\"tocnumber\">1.6</span> <span class=\"toctext\">There was an error launching the application</span></a></li><li class=\"toclevel-2\"><a href=\"#w_error-opening-file-for-writing\"><span class=\"tocnumber\">1.7</span> <span class=\"toctext\">Error opening file for writing…</span></a></li><li class=\"toclevel-2\"><a href=\"#w_other-error-messages\"><span class=\"tocnumber\">1.8</span> <span class=\"toctext\">Other error messages</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_no-error-message\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">No error message</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_firefox-will-not-start-due-to-malware\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Firefox will not start due to malware</span></a></li><li class=\"toclevel-2\"><a href=\"#w_firefox-will-not-start-due-to-security-software\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">Firefox will not start due to security software</span></a></li><li class=\"toclevel-2\"><a href=\"#w_firefox-will-not-start-after-installing-add-ons\"><span class=\"tocnumber\">2.3</span> <span class=\"toctext\">Firefox will not start after installing add-ons</span></a></li><li class=\"toclevel-2\"><a href=\"#w_firefox-previously-worked\"><span class=\"tocnumber\">2.4</span> <span class=\"toctext\">Firefox previously worked</span></a></li><li class=\"toclevel-2\"><a href=\"#w_firefox-will-not-start-because-of-missing-libraries\"><span class=\"tocnumber\">2.5</span> <span class=\"toctext\">Firefox will not start because of missing libraries</span></a></li></ul></li></ul></div>\n<h1 id=\"w_specific-error-messages\">Specific error messages</h1>\n<h2 id=\"w_mozilla-crash-reporter\">Mozilla Crash Reporter</h2>\n<p>If Firefox closes or quits unexpectedly as soon as you open it and the <a href=\"/en-US/kb/mozillacrashreporter\">Mozilla Crash Reporter</a> appears, see <a href=\"/en-US/kb/firefox-keeps-crashing-startup\">Firefox keeps crashing at startup</a> for solutions.\n</p>\n<h2 id=\"w_firefox-is-already-running-but-is-not-responding\">Firefox is already running but is not responding</h2>\n<p>See <a href=\"/en-US/kb/firefox-already-running-not-responding\">\"Firefox is already running but is not responding\" error - How to fix</a> for solutions.\n</p>\n<h2 id=\"w_your-firefox-profile-cannot-be-loaded-it-may-be-missing-or-inaccessible\">Your Firefox profile cannot be loaded. It may be missing or inaccessible</h2>\n<p>See <a href=\"/en-US/kb/how-run-firefox-when-profile-missing-inaccessible\">How to run Firefox when your profile is missing or inaccessible</a> for solutions.\n</p><div class=\"for\" data-for=\"win\">\n<h2 id=\"w_failed-to-read-the-configuration-file\">Failed to read the configuration file</h2>\n<p>This error is caused by a problem with Firefox program files. The solution is to remove the Firefox program and then reinstall Firefox. (This will not remove your passwords, bookmarks or other user data and settings which are stored in a separate <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profiles</a> folder.)\n</p>\n<ol><li><a href=\"/en-US/kb/uninstall-firefox-from-your-computer\">Uninstall Firefox</a>.\n</li><li> Delete the Firefox installation directory, normally found in one of these locations by default:\n<ul><li>C:\\Program Files\\Mozilla Firefox\n</li><li>C:\\Program Files (x86)\\Mozilla Firefox\n</li></ul>\n</li><li> Use another browser to download the Firefox installer from the <a href=\"https://www.mozilla.org/firefox/windows/?utm_medium=referral&amp;utm_source=support.mozilla.org\">Firefox download page</a> and install it. See <a href=\"/en-US/kb/how-install-firefox-windows\">How to install Firefox on Windows</a> for details.\n</li></ol>\n</div>\n<h2 id=\"w_xulrunner-error\">XULRunner - Error</h2>\n<p>If you see the message, <em>\"XULRunner - Error: Platform version &lt;x.x.x.x&gt; is not compatible with minVersion &lt;x.x.x.x&gt;\"\"</em> (\"&lt;x.x.x.x&gt;\" depends on version number) after a Firefox update, use another browser to download the Firefox installer from the <a href=\"https://www.mozilla.org/firefox/new/?utm_medium=referral&amp;utm_source=support.mozilla.org\">Firefox download page</a>, save it to the desktop or other location, <a href=\"/en-US/kb/uninstall-firefox-from-your-computer\">remove the Firefox program from your computer</a> and then <span class=\"for\" data-for=\"win\"><a href=\"/en-US/kb/how-install-firefox-windows\">reinstall Firefox</a></span><span class=\"for\" data-for=\"mac\"><a href=\"/en-US/kb/how-download-and-install-firefox-mac\">reinstall Firefox</a></span><span class=\"for\" data-for=\"linux\"><a href=\"/en-US/kb/install-firefox-linux\">reinstall Firefox</a></span> (see the instructions <a href=\"/en-US/kb/troubleshoot-and-diagnose-firefox-problems#w_4-reinstall-firefox\">here</a> for details).<span class=\"for\" data-for=\"win\"> If Firefox still does not start, see the <a href=\"#w_firefox-will-not-start-due-to-security-software\">Firefox will not start due to security software</a> section below.</span>\n</p><div class=\"for\" data-for=\"linux\">\n<h2 id=\"w_there-was-an-error-launching-the-application\">There was an error launching the application</h2>\n<p>This error indicates that either Firefox is not installed or your shortcut to it is incorrect. Make sure that Firefox is installed at the location specified by the shortcut. If it isn't, <a href=\"/en-US/kb/install-firefox-linux\">install Firefox</a> if necessary, then modify the shortcut to point to the correct location.\n</p></div><div class=\"for\" data-for=\"win\">\n<h2 id=\"w_error-opening-file-for-writing\">Error opening file for writing…</h2>\n<p>If you receive the above error when launching Firefox on a Windows system, you may be required by Firefox to log in as an administrator. You can either reboot the computer or, if you have an administrator account, you can execute the program as an administrator.\n</p>\n<ol><li> Find the <span class=\"filepath\">firefox.exe</span> program file in the Firefox application folder on your system.\n</li><li> Right-click the icon.\n</li><li> Select <span class=\"menu\">Run As Administrator…</span>. Select <strong>The following user:</strong>. From the Username drop-down, select <strong>Administrator</strong> or another user that has administrator privileges. Enter the password required to log in to this account. Click <span class=\"button\">OK</span>.\n</li><li> The Firefox application is started using the administrator Windows account. The user that was used to log in to Windows at startup is still the active one.\n</li></ol>\n</div>\n<h2 id=\"w_other-error-messages\">Other error messages</h2>\n<p>If you get another error message (e.g. <em>\"XML Parsing Error: undefined entity Location\"</em>, <em>\"Secure Connection Failed … uses an invalid security certificate\"</em>), see <a href=\"/en-US/kb/troubleshoot-extensions-themes-to-fix-problems\">Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems</a>.\n</p>\n<h1 id=\"w_no-error-message\">No error message</h1>\n<p>If you click the Firefox icon but no Firefox window opens and no error message is shown, a simple first step is to restart your computer and then try again. If Firefox still does not start, see the following sections.\n</p>\n<h2 id=\"w_firefox-will-not-start-due-to-malware\">Firefox will not start due to malware</h2>\n<p>See <a href=\"/en-US/kb/troubleshoot-firefox-issues-caused-malware\">Troubleshoot Firefox issues caused by malware</a>. \n</p><div class=\"for\" data-for=\"win\">\n<h2 id=\"w_firefox-will-not-start-due-to-security-software\">Firefox will not start due to security software</h2>\n<p>\n</p>\n<ul><li> Outdated versions of Comodo Firewall or Comodo Antivirus security software (or a leftover file after Comodo was uninstalled) can cause Firefox not to start with no error message. Update Comodo to the latest version, if you have it installed. If Comodo software is not installed, check if there's a file called <span class=\"filepath\">IseGuard64.dll</span> or <span class=\"filepath\">IseGuard32.dll</span> in your <span class=\"filepath\">C:\\Windows\\system32\\</span> folder or your system drive and, if so, manually delete the file.\n</li><li> If you use certain versions of ZoneAlarm or other Internet security software that includes a \"Virtual Browsing\" feature, it can prevent Firefox from starting. Check virtualization settings and clear the virtual cache, if your Internet security software includes this feature, or visit the software provider's support site for more help.\n</li><li> Firefox may fail to start for some Windows users after updating, if AVG or AVAST antivirus is installed. For details, see <a href=\"https://techdows.com/2019/07/firefox-reportedly-freezing-on-startup-with-avast-or-avg-installed.html\">this Techdows article</a>. \n</li></ul>\n</div>\n<h2 id=\"w_firefox-will-not-start-after-installing-add-ons\">Firefox will not start after installing add-ons</h2>\n<p>If Firefox previously worked but stopped after you installed extensions or themes, see <a href=\"/en-US/kb/troubleshoot-extensions-themes-to-fix-problems\">Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems</a>.\n</p>\n<h2 id=\"w_firefox-previously-worked\">Firefox previously worked</h2>\n<p>If Firefox previously worked but suddenly doesn't start, it may be due to some corrupt data in your settings. Uninstalling and reinstalling Firefox would not fix this problem because your settings are not removed on uninstall.\n</p><p>To test to see if this is the problem, use the <a href=\"/en-US/kb/profile-manager-create-remove-switch-firefox-profiles\">Profile Manager</a> to create a new profile. If the problem goes away, you can then <a href=\"/en-US/kb/restore-bookmarks-passwords-and-data-from-an-old-firefox-profile\">move your bookmarks and other important settings into the new profile</a>.\n</p><div class=\"for\" data-for=\"linux\">\n<h2 id=\"w_firefox-will-not-start-because-of-missing-libraries\">Firefox will not start because of missing libraries</h2>\n<p>If you installed Firefox outside of your package manager, make sure that your system has the libraries listed in the <a href=\"http://www.mozilla.org/firefox/system-requirements.html\">system requirements</a>.\n</p></div><p><br>\n\n<br> <br>\n<em><strong>Based on information from <a href=\"http://kb.mozillazine.org/Browser_will_not_start_up\">Browser will not start up (mozillaZine KB)</a></strong></em>\n</p>",
  "text": "This article describes what to do if Firefox does not open when you click the Firefox icon. If Firefox hangs or stops responding as soon as you open it, see Firefox hangs or is not responding - How to fix . If you get a message that you can dismiss (such as \"TypeError: Components.classes['@ … ;1'] is undefined\" , \"onload error TypeError: …\" , \"Exc in ev handl: …\" ) but you can open Firefox, see Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems . If Firefox starts but won't load any websites, see Websites don't load - troubleshoot and fix error messages . Note: The Refresh Firefox feature can fix many issues by restoring Firefox to its default state while saving your essential information. Consider using it before going through a lengthy troubleshooting process. The Firefox Troubleshoot Mode window includes a Refresh Firefox option. You can start Firefox in Troubleshoot Mode by holding down the shift key while starting Firefox. holding down the option key while starting Firefox. quitting Firefox and then going to your Terminal and running: firefox -safe-mode You may need to specify the Firefox installation path (e.g. /usr/lib/firefox ) Table of Contents 1 Specific error messages 1.1 Mozilla Crash Reporter 1.2 Firefox is already running but is not responding 1.3 Your Firefox profile cannot be loaded. It may be missing or inaccessible 1.4 Failed to read the configuration file 1.5 XULRunner - Error 1.6 There was an error launching the application 1.7 Error opening file for writing… 1.8 Other error messages 2 No error message 2.1 Firefox will not start due to malware 2.2 Firefox will not start due to security software 2.3 Firefox will not start after installing add-ons 2.4 Firefox previously worked 2.5 Firefox will not start because of missing libraries Specific error messages Mozilla Crash Reporter If Firefox closes or quits unexpectedly as soon as you open it and the Mozilla Crash Reporter appears, see Firefox keeps crashing at startup for solutions. Firefox is already running but is not responding See \"Firefox is already running but is not responding\" error - How to fix for solutions. Your Firefox profile cannot be loaded. It may be missing or inaccessible See How to run Firefox when your profile is missing or inaccessible for solutions. Failed to read the configuration file This error is caused by a problem with Firefox program files. The solution is to remove the Firefox program and then reinstall Firefox. (This will not remove your passwords, bookmarks or other user data and settings which are stored in a separate profiles folder.) Uninstall Firefox . Delete the Firefox installation directory, normally found in one of these locations by default: C:\\Program Files\\Mozilla Firefox C:\\Program Files (x86)\\Mozilla Firefox Use another browser to download the Firefox installer from the Firefox download page and install it. See How to install Firefox on Windows for details. XULRunner - Error If you see the message, \"XULRunner - Error: Platform version <x.x.x.x> is not compatible with minVersion <x.x.x.x>\"\" (\"<x.x.x.x>\" depends on version number) after a Firefox update, use another browser to download the Firefox installer from the Firefox download page , save it to the desktop or other location, remove the Firefox program from your computer and then reinstall Firefox reinstall Firefox reinstall Firefox (see the instructions here for details). If Firefox still does not start, see the Firefox will not start due to security software section below. There was an error launching the application This error indicates that either Firefox is not installed or your shortcut to it is incorrect. Make sure that Firefox is installed at the location specified by the shortcut. If it isn't, install Firefox if necessary, then modify the shortcut to point to the correct location. Error opening file for writing… If you receive the above error when launching Firefox on a Windows system, you may be required by Firefox to log in as an administrator. You can either reboot the computer or, if you have an administrator account, you can execute the program as an administrator. Find the firefox.exe program file in the Firefox application folder on your system. Right-click the icon. Select Run As Administrator… . Select The following user: . From the Username drop-down, select Administrator or another user that has administrator privileges. Enter the password required to log in to this account. Click OK . The Firefox application is started using the administrator Windows account. The user that was used to log in to Windows at startup is still the active one. Other error messages If you get another error message (e.g. \"XML Parsing Error: undefined entity Location\" , \"Secure Connection Failed … uses an invalid security certificate\" ), see Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems . No error message If you click the Firefox icon but no Firefox window opens and no error message is shown, a simple first step is to restart your computer and then try again. If Firefox still does not start, see the following sections. Firefox will not start due to malware See Troubleshoot Firefox issues caused by malware . Firefox will not start due to security software Outdated versions of Comodo Firewall or Comodo Antivirus security software (or a leftover file after Comodo was uninstalled) can cause Firefox not to start with no error message. Update Comodo to the latest version, if you have it installed. If Comodo software is not installed, check if there's a file called IseGuard64.dll or IseGuard32.dll in your C:\\Windows\\system32\\ folder or your system drive and, if so, manually delete the file. If you use certain versions of ZoneAlarm or other Internet security software that includes a \"Virtual Browsing\" feature, it can prevent Firefox from starting. Check virtualization settings and clear the virtual cache, if your Internet security software includes this feature, or visit the software provider's support site for more help. Firefox may fail to start for some Windows users after updating, if AVG or AVAST antivirus is installed. For details, see this Techdows article . Firefox will not start after installing add-ons If Firefox previously worked but stopped after you installed extensions or themes, see Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems . Firefox previously worked If Firefox previously worked but suddenly doesn't start, it may be due to some corrupt data in your settings. Uninstalling and reinstalling Firefox would not fix this problem because your settings are not removed on uninstall. To test to see if this is the problem, use the Profile Manager to create a new profile. If the problem goes away, you can then move your bookmarks and other important settings into the new profile . Firefox will not start because of missing libraries If you installed Firefox outside of your package manager, make sure that your system has the libraries listed in the system requirements . Based on information from Browser will not start up (mozillaZine KB)",
  "products": [
    "firefox"
  ],
  "topics": [
    "crashing-and-slow-performance"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 13437,
    "text_bytes": 7176,
    "word_count": 1158,
    "downloaded_at": "2025-08-26T09:04:39.291018"
  }
}