{
  "slug": "firefox-doesnt-save-web-form-entries",
  "title": "Firefox doesn't save web form entries",
  "summary": "Firefox's autocomplete feature lets you save and reuse text field entries in web forms.  If you're no longer able to auto-fill your forms, follow these steps.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-doesnt-save-web-form-entries",
  "html": "<p>Firefox can remember what you've entered in forms on web pages, also known as text fields. After you've entered something into a form on a web page (such as a search box), the next time you visit that page, your previous entry should be available to re-use. If you find that you can't re-use your form entries, follow the instructions in this article.\n</p>\n<ul><li> For more information on the form autocompletion feature, see the <a href=\"/en-US/kb/control-whether-firefox-automatically-fills-forms\">Control whether Firefox automatically fills in forms</a> article.\n</li></ul>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_autocomplete-does-not-work-on-certain-forms\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Autocomplete does not work on certain forms</span></a></li><li class=\"toclevel-1\"><a href=\"#w_autocomplete-doesnt-work-on-any-forms\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Autocomplete doesn't work on any forms</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_check-firefox-settings\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Check Firefox settings</span></a></li><li class=\"toclevel-2\"><a href=\"#w_check-for-conflicting-extensions\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">Check for conflicting extensions</span></a></li><li class=\"toclevel-2\"><a href=\"#w_check-other-programs-settings\"><span class=\"tocnumber\">2.3</span> <span class=\"toctext\">Check other programs' settings</span></a></li></ul></li></ul></div>\n<h1 id=\"w_autocomplete-does-not-work-on-certain-forms\">Autocomplete does not work on certain forms</h1>\n<p>If you find that Firefox will save form entries for forms on only some websites, but not on others, the site might be telling Firefox to not save form history. This is especially common on email and banking websites.\n</p>\n<h1 id=\"w_autocomplete-doesnt-work-on-any-forms\">Autocomplete doesn't work on any forms</h1>\n<p>If you find that Firefox will not save any text you enter into forms, follow the instructions below.\n</p>\n<h2 id=\"w_check-firefox-settings\">Check Firefox settings</h2>\n<p>Make sure that Firefox is set to remember form entries and that saved form entries are not being automatically cleared:\n</p>\n<ol><li> <span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li> Select the <span class=\"menu\">Privacy &amp; Security</span> panel and go to the <strong>History</strong> section.\n</li><li> In the drop-down menu next to <strong>Firefox will </strong> choose <span class=\"menu\">Use custom settings for history</span>.\n</li><li> Make sure that <strong>Remember search and form history</strong> is selected.\n<ul><li> Enabling form autocomplete also makes Firefox store search history for the Search bar. \n</li></ul>\n</li><li> Find <strong>Clear history when Firefox closes</strong>. If it is selected:\n<ol><li> Click on the <span class=\"button\">Settings...</span> button.\n</li><li> Make sure that <strong>Form &amp; Search History</strong> is <strong>not</strong> selected.\n</li><li> Click <span class=\"button\">OK</span>.\n</li></ol>\n</li><li> Close the <span class=\"menu\">Settings</span> page. Any changes you've made will automatically be saved.\n\n</li></ol>\n<p>If either of those options were not set properly, setting them as above should enable form autocomplete.\n</p>\n<h2 id=\"w_check-for-conflicting-extensions\">Check for conflicting extensions</h2>\n<p>If you find that Firefox's settings were correct, but autocomplete still doesn't work on any forms, a Firefox extension may be causing the problem. See <a href=\"/en-US/kb/troubleshoot-extensions-themes-to-fix-problems\">Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems</a> for how to troubleshoot extension issues.\n</p><p>If a conflicting extension was present, form autocomplete should work again after disabling it and starting Firefox again.\n</p>\n<h2 id=\"w_check-other-programs-settings\">Check other programs' settings</h2>\n<p>Some Internet security software (including antivirus, antispyware, firewall, and privacy programs) will clear Firefox's form history. Check the settings for these programs if you have one or more of them.\n</p>",
  "text": "Firefox can remember what you've entered in forms on web pages, also known as text fields. After you've entered something into a form on a web page (such as a search box), the next time you visit that page, your previous entry should be available to re-use. If you find that you can't re-use your form entries, follow the instructions in this article. For more information on the form autocompletion feature, see the Control whether Firefox automatically fills in forms article. Table of Contents 1 Autocomplete does not work on certain forms 2 Autocomplete doesn't work on any forms 2.1 Check Firefox settings 2.2 Check for conflicting extensions 2.3 Check other programs' settings Autocomplete does not work on certain forms If you find that Firefox will save form entries for forms on only some websites, but not on others, the site might be telling Firefox to not save form history. This is especially common on email and banking websites. Autocomplete doesn't work on any forms If you find that Firefox will not save any text you enter into forms, follow the instructions below. Check Firefox settings Make sure that Firefox is set to remember form entries and that saved form entries are not being automatically cleared: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select the Privacy & Security panel and go to the History section. In the drop-down menu next to Firefox will choose Use custom settings for history . Make sure that Remember search and form history is selected. Enabling form autocomplete also makes Firefox store search history for the Search bar. Find Clear history when Firefox closes . If it is selected: Click on the Settings... button. Make sure that Form & Search History is not selected. Click OK . Close the Settings page. Any changes you've made will automatically be saved. If either of those options were not set properly, setting them as above should enable form autocomplete. Check for conflicting extensions If you find that Firefox's settings were correct, but autocomplete still doesn't work on any forms, a Firefox extension may be causing the problem. See Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems for how to troubleshoot extension issues. If a conflicting extension was present, form autocomplete should work again after disabling it and starting Firefox again. Check other programs' settings Some Internet security software (including antivirus, antispyware, firewall, and privacy programs) will clear Firefox's form history. Check the settings for these programs if you have one or more of them.",
  "products": [
    "firefox"
  ],
  "topics": [
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4800,
    "text_bytes": 2725,
    "word_count": 445,
    "downloaded_at": "2025-08-26T09:04:33.668752"
  }
}