{
  "slug": "firefox-helper-tool-macos",
  "title": "Troubleshoot Firefox updates and the Helper tool",
  "summary": "Learn what to do if you get a \"Firefox is trying to install a new helper tool\" message while updating Firefox on macOS.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-helper-tool-macos",
  "html": "<div class=\"note\"><strong>Note:</strong> This article applies to Firefox on macOS.</div>\n<p>Sometimes Mac users get a <em>Firefox is trying to install a new helper tool</em> message while updating Firefox. This guide will explain why this happens and how you should proceed with it.\n</p>\n<dl><dt><img alt=\"firefoxhelpertool\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-06-06-12-33-03-99ba8a.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_common-scenarios\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Common scenarios</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_it-admins-deploying-firefox-with-the-pkg-installer\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">IT admins deploying Firefox with the .pkg installer</span></a></li><li class=\"toclevel-2\"><a href=\"#w_multiple-admin-users-on-the-same-device\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Multiple admin users on the same device</span></a></li><li class=\"toclevel-2\"><a href=\"#w_non-admin-users-updating-firefox\"><span class=\"tocnumber\">1.3</span> <span class=\"toctext\">Non-Admin users updating Firefox</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_possible-issues-and-solutions\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Possible issues and solutions</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_firefox-prompts-for-the-helper-tool-on-every-update\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Firefox prompts for the Helper Tool on every update</span></a></li><li class=\"toclevel-2\"><a href=\"#w_firefox-requests-the-installation-of-the-helper-tool-on-every-launch\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">Firefox requests the installation of the Helper Tool on every launch</span></a></li><li class=\"toclevel-2\"><a href=\"#w_updates-are-failing-even-after-entering-admin-credentials\"><span class=\"tocnumber\">2.3</span> <span class=\"toctext\">Updates are failing even after entering admin credentials</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_future-changes-to-the-helper-tool\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Future changes to the Helper tool</span></a></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<h1 id=\"w_common-scenarios\">Common scenarios</h1>\n<p>The <strong>Helper tool</strong> plays an essential role in ensuring successful Firefox updates, particularly in cases where system permissions or ownership settings may prevent them entirely. However, you might see unusual prompts when updating Firefox: the Helper tool will require you to use your credentials to complete its installation process. You may encounter the Helper tool in the following situations.\n</p>\n<h2 id=\"w_it-admins-deploying-firefox-with-the-pkg-installer\">IT admins deploying Firefox with the .pkg installer</h2>\n<ul><li>As an IT admin, you can <a href=\"/en-US/kb/deploying-firefox-macos-using-pkg-and-jamf\">deploy Firefox through the .pkg installer</a>.\n</li><li>In this case, the updater will require the Helper tool to correct the permissions on the application bundle when Firefox updates for the first time, which may lead to the tool asking for credentials.\n</li></ul>\n<h2 id=\"w_multiple-admin-users-on-the-same-device\">Multiple admin users on the same device</h2>\n<ul><li>If Firefox was originally installed by one admin and updated by another, the updater may require elevated privileges.\n</li><li>In this case, the Helper tool is used once to validate the Firefox app bundle ownership, which in turn allows subsequent updates to be installed by any admin user.\n</li></ul>\n<h2 id=\"w_non-admin-users-updating-firefox\">Non-Admin users updating Firefox</h2>\n<ul><li>Standard users do not have permission to modify Firefox's core files.\n</li><li>In this case, the Helper tool will appear on every Firefox update attempt until admin credentials are provided to complete the update.\n</li></ul>\n<h1 id=\"w_possible-issues-and-solutions\">Possible issues and solutions</h1>\n<h2 id=\"w_firefox-prompts-for-the-helper-tool-on-every-update\">Firefox prompts for the Helper Tool on every update</h2>\n<p><strong>Possible Cause:</strong>\n</p>\n<ul><li>You switched to a standard user account. Since non-admin users cannot modify the <em>Firefox.app</em> bundle, you must authorize the helper tool with admin credentials each time Firefox updates.\n</li></ul>\n<p><strong>Solution:</strong>\n</p>\n<ul><li>Enter valid admin credentials when the Helper asks you to.\n</li></ul>\n<h2 id=\"w_firefox-requests-the-installation-of-the-helper-tool-on-every-launch\">Firefox requests the installation of the Helper Tool on every launch</h2>\n<p><strong>Possible Cause:</strong>\n</p>\n<ul><li>The user never grants admin permissions, and the updates cannot take place as a result, which prompts the Helper tool to appear on every Firefox launch.\n</li></ul>\n<p><strong>Solution:</strong>\n</p>\n<ul><li>Try reinstalling Firefox, which will restore the default permissions.\n</li><li>Make sure you have admin rights when reinstalling.\n</li></ul>\n<h2 id=\"w_updates-are-failing-even-after-entering-admin-credentials\">Updates are failing even after entering admin credentials</h2>\n<p><strong>Possible Cause:</strong>\n</p>\n<ul><li>The <em>Firefox.app</em> bundle may have corrupted or restricted permissions that prevent updates.\n</li></ul>\n<p><strong>Solution:</strong>\n</p>\n<ul><li>Reinstalling Firefox will fix the corrupted permissions, and it will allow you to update the browser properly.\n<dl><dt><div class=\"note\"><strong>Note</strong>: Reinstalling Firefox is often the simplest solution. Uninstall the broken Firefox first (this will not remove your user <em>profile</em> data and settings, which are stored in a different location).</div>\n</dt></dl>\n</li></ul>\n<h1 id=\"w_future-changes-to-the-helper-tool\">Future changes to the Helper tool</h1>\n<p>We're currently working on a solution to minimize the number of times that a regular user has to provide admin credentials to install Firefox updates.\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/uninstall-firefox-from-your-computer\">Uninstall Firefox from your computer</a>\n</li><li><a href=\"/en-US/kb/how-download-and-install-firefox-mac\">How to download and install Firefox on Mac</a>\n</li><li><a href=\"/en-US/kb/deploying-firefox-macos-using-pkg-and-jamf\">Deploy Firefox on macOS using PKG and Jamf</a>\n</li></ul>",
  "text": "Note: This article applies to Firefox on macOS. Sometimes Mac users get a Firefox is trying to install a new helper tool message while updating Firefox. This guide will explain why this happens and how you should proceed with it. Table of Contents 1 Common scenarios 1.1 IT admins deploying Firefox with the .pkg installer 1.2 Multiple admin users on the same device 1.3 Non-Admin users updating Firefox 2 Possible issues and solutions 2.1 Firefox prompts for the Helper Tool on every update 2.2 Firefox requests the installation of the Helper Tool on every launch 2.3 Updates are failing even after entering admin credentials 3 Future changes to the Helper tool 4 Related articles Common scenarios The Helper tool plays an essential role in ensuring successful Firefox updates, particularly in cases where system permissions or ownership settings may prevent them entirely. However, you might see unusual prompts when updating Firefox: the Helper tool will require you to use your credentials to complete its installation process. You may encounter the Helper tool in the following situations. IT admins deploying Firefox with the .pkg installer As an IT admin, you can deploy Firefox through the .pkg installer . In this case, the updater will require the Helper tool to correct the permissions on the application bundle when Firefox updates for the first time, which may lead to the tool asking for credentials. Multiple admin users on the same device If Firefox was originally installed by one admin and updated by another, the updater may require elevated privileges. In this case, the Helper tool is used once to validate the Firefox app bundle ownership, which in turn allows subsequent updates to be installed by any admin user. Non-Admin users updating Firefox Standard users do not have permission to modify Firefox's core files. In this case, the Helper tool will appear on every Firefox update attempt until admin credentials are provided to complete the update. Possible issues and solutions Firefox prompts for the Helper Tool on every update Possible Cause: You switched to a standard user account. Since non-admin users cannot modify the Firefox.app bundle, you must authorize the helper tool with admin credentials each time Firefox updates. Solution: Enter valid admin credentials when the Helper asks you to. Firefox requests the installation of the Helper Tool on every launch Possible Cause: The user never grants admin permissions, and the updates cannot take place as a result, which prompts the Helper tool to appear on every Firefox launch. Solution: Try reinstalling Firefox, which will restore the default permissions. Make sure you have admin rights when reinstalling. Updates are failing even after entering admin credentials Possible Cause: The Firefox.app bundle may have corrupted or restricted permissions that prevent updates. Solution: Reinstalling Firefox will fix the corrupted permissions, and it will allow you to update the browser properly. Note : Reinstalling Firefox is often the simplest solution. Uninstall the broken Firefox first (this will not remove your user profile data and settings, which are stored in a different location). Future changes to the Helper tool We're currently working on a solution to minimize the number of times that a regular user has to provide admin credentials to install Firefox updates. Related articles Uninstall Firefox from your computer How to download and install Firefox on Mac Deploy Firefox on macOS using PKG and Jamf",
  "products": [
    "firefox"
  ],
  "topics": [
    "install",
    "installation-and-updates",
    "update"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6711,
    "text_bytes": 3503,
    "word_count": 557,
    "downloaded_at": "2025-08-26T11:02:40.567332"
  }
}