{
  "slug": "firefox-repeatedly-opens-empty-tabs-or-windows",
  "title": "Firefox repeatedly opens empty tabs or windows after you click on a link",
  "summary": "Firefox may repeatedly open empty tabs or windows after you click on a link, forcing you to close Firefox. Learn how to fix this problem.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-repeatedly-opens-empty-tabs-or-windows",
  "html": "<p>Firefox may repeatedly open new, empty tabs or windows after you click on a link, forcing you to close Firefox. The same untitled tabs or blank windows may open the next time you start Firefox if the previous session is restored. This article describes what to do if you are experiencing this problem.\n</p>\n<div class=\"note\"><strong>Note:</strong> This usually happens because you chose to use Firefox as the application to always use for opening a particular type of file. </div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_start-a-new-firefox-session\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Start a new Firefox session</span></a></li><li class=\"toclevel-1\"><a href=\"#w_change-the-action-for-a-content-type\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Change the action for a content type</span></a></li><li class=\"toclevel-1\"><a href=\"#w_reset-actions-for-all-content-types\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Reset actions for all content types</span></a></li><li class=\"toclevel-1\"><a href=\"#w_check-for-malware\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Check for malware</span></a></li></ul></div>\n<p>The <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">Refresh Firefox feature</a> can fix many issues by restoring Firefox to its default state while saving your essential information. Consider using it before going through a lengthy troubleshooting process.\n\n</p>\n<h1 id=\"w_start-a-new-firefox-session\">Start a new Firefox session</h1>\n<p>You may be forced to close Firefox if it is repeatedly opening multiple tabs or windows. Firefox includes a <a href=\"/en-US/kb/restore-previous-session\">Session Restore</a> feature that can restore your windows and tabs from the previous session after a crash or unexpected close. \n</p><p>The same multiple tabs or windows may start opening when you next start Firefox, forcing you to close Firefox again. If you see a Restore Session \"<em>Sorry. We're having trouble getting your pages back.</em>\") page when you restart Firefox, click the <span class=\"button\">Start New Session</span> button to start a new session and then follow the instructions given below to fix the problem.\n</p>\n<h1 id=\"w_change-the-action-for-a-content-type\">Change the action for a content type</h1>\n<p>You may be able to fix the problem by finding the content type that is set to use Firefox and then changing the action, using these steps:  \n</p>\n<ol><li> <span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li> In the <span class=\"menu\">General</span> panel, go to the <em>Files and Applications</em> section and review the Content Type entries under <strong>Applications</strong>.\n</li><li> If you know which item in the Content Type column is causing the problem, select it. Otherwise, in the Search box, type <em>Use Firefox</em>. The list will display only items that are set to \"Use Firefox\".\n<dl><dt> <img alt=\"Fx61ApplicationsUseFirefox\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2018-10-24-13-42-46-7cac94.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> Select each problematic content type and choose a new action from the drop-down menu in the Action column. If you're not sure which action to pick, choose <span class=\"menu\">Always ask</span>.\n</li><li> Close the <span class=\"menu\">Settings</span> page. Any changes you've made will automatically be saved.\n\n</li></ol>\n<p>\n</p>\n<div class=\"note\"><strong>Note</strong>: A problematic <em>Portable Document Format (PDF)</em> content type should be set to <span class=\"menu\">Open in Firefox</span> if you wish to <a href=\"/en-US/kb/view-pdf-files-firefox-or-choose-another-viewer\">view PDF files in Firefox</a><span class=\"for\" data-for=\"win\">, even when Firefox is the default program to open PDF files on Windows</span>.</div>\n<p>For more information about content types, see <a href=\"/en-US/kb/change-firefox-behavior-when-open-file\">Manage file types and download actions in Firefox</a>.\n</p>\n<h1 id=\"w_reset-actions-for-all-content-types\">Reset actions for all content types</h1>\n<p>If the preceding steps didn't fix the problem, or if you can't find the problematic item in the Applications list, you will have to reset the default actions for all content types and remove customized settings, by refreshing Firefox. To learn more, see <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">Refresh Firefox - reset add-ons and settings</a>.\n</p><div class=\"for\" data-for=\"win\">\n<h1 id=\"w_check-for-malware\">Check for malware</h1>\n<p>If the problem is still not solved, or if Firefox is opening multiple tabs or windows with unwanted content, consider that your system may be infected by <a href=\"http://en.wikipedia.org/wiki/Malware\">malware</a>. For more information, see <a href=\"/en-US/kb/troubleshoot-firefox-issues-caused-malware\">Troubleshoot Firefox issues caused by malware</a>.\n</p></div>",
  "text": "Firefox may repeatedly open new, empty tabs or windows after you click on a link, forcing you to close Firefox. The same untitled tabs or blank windows may open the next time you start Firefox if the previous session is restored. This article describes what to do if you are experiencing this problem. Note: This usually happens because you chose to use Firefox as the application to always use for opening a particular type of file. Table of Contents 1 Start a new Firefox session 2 Change the action for a content type 3 Reset actions for all content types 4 Check for malware The Refresh Firefox feature can fix many issues by restoring Firefox to its default state while saving your essential information. Consider using it before going through a lengthy troubleshooting process. Start a new Firefox session You may be forced to close Firefox if it is repeatedly opening multiple tabs or windows. Firefox includes a Session Restore feature that can restore your windows and tabs from the previous session after a crash or unexpected close. The same multiple tabs or windows may start opening when you next start Firefox, forcing you to close Firefox again. If you see a Restore Session \" Sorry. We're having trouble getting your pages back. \") page when you restart Firefox, click the Start New Session button to start a new session and then follow the instructions given below to fix the problem. Change the action for a content type You may be able to fix the problem by finding the content type that is set to use Firefox and then changing the action, using these steps: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the General panel, go to the Files and Applications section and review the Content Type entries under Applications . If you know which item in the Content Type column is causing the problem, select it. Otherwise, in the Search box, type Use Firefox . The list will display only items that are set to \"Use Firefox\". Select each problematic content type and choose a new action from the drop-down menu in the Action column. If you're not sure which action to pick, choose Always ask . Close the Settings page. Any changes you've made will automatically be saved. Note : A problematic Portable Document Format (PDF) content type should be set to Open in Firefox if you wish to view PDF files in Firefox , even when Firefox is the default program to open PDF files on Windows . For more information about content types, see Manage file types and download actions in Firefox . Reset actions for all content types If the preceding steps didn't fix the problem, or if you can't find the problematic item in the Applications list, you will have to reset the default actions for all content types and remove customized settings, by refreshing Firefox. To learn more, see Refresh Firefox - reset add-ons and settings . Check for malware If the problem is still not solved, or if Firefox is opening multiple tabs or windows with unwanted content, consider that your system may be infected by malware . For more information, see Troubleshoot Firefox issues caused by malware .",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse",
    "links",
    "performance-and-connectivity"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5707,
    "text_bytes": 3220,
    "word_count": 563,
    "downloaded_at": "2025-08-26T11:03:19.295731"
  }
}