{
  "slug": "firefox-users-windows-7-8-and-81-moving-extended-support",
  "title": "Firefox users on Windows 7, 8 and 8.1 moving to Extended Support Release",
  "summary": "Firefox version 115 ESR will be the last supported release for Windows 7, 8 and 8.1.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-users-windows-7-8-and-81-moving-extended-support",
  "html": "<p><a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 115 is the last supported Firefox version for users of Windows 7, Windows 8 and Windows 8.1. If you have been using Firefox on these versions of Windows, you will be moved to the Firefox <a href=\"https://www.mozilla.org/firefox/enterprise\">Extended Support Release</a> (ESR) channel by an application update.  \n</p><p>If you want to install Firefox on Windows 7, Windows 8 or Windows 8.1 and you visit the Firefox download page at <a href=\"https://www.mozilla.org/firefox/windows/\">https://www.mozilla.org/firefox/windows/</a> your Windows version will be detected and you will be prompted to download the latest  Firefox 115 ESR version for your 32-bit or 64-bit Windows system. \n</p><p><img alt=\"DownloadFirefoxESR-64bit-win7\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-10-03-12-36-27-7c26b3.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"800\">\n</p><p>Mozilla will provide security updates for Firefox 115 ESR until at least 115.27.0esr in August 2025, when the position will be re-evaluated. \n</p>\n<h1 id=\"w_why-has-firefox-ended-support-for-windows-7-8-and-8-1-users\">Why has Firefox ended support for Windows 7, 8 and 8.1 users?</h1>\n<p>Microsoft ended official support for Windows 7, 8 and 8.1 in January of 2023. Unsupported operating systems receive no security updates and have known exploits. With no official support from Microsoft, maintaining Firefox for obsolete operating systems becomes costly for Mozilla and dangerous for users.\n</p>\n<h1 id=\"w_will-switching-to-a-different-browser-keep-me-protected\">Will switching to a different browser keep me protected?</h1>\n<p>No. Most browsers, including Google Chrome and Microsoft Edge, have already ended support for Windows 7, 8 and 8.1. \n</p>\n<h1 id=\"w_can-i-still-browse-safely-with-firefox-windows-7-8-and-8-1\">Can I still browse safely with Firefox Windows 7, 8 and 8.1?</h1>\n<p>Mozilla is providing critical security updates through the <a href=\"https://www.mozilla.org/firefox/enterprise\">Firefox ESR</a> channel up until the end of ESR version 115, August 2025. After this, no security updates are provided and you are strongly encouraged to move to a supported version of Microsoft Windows.\n</p>\n<h1 id=\"w_how-can-i-get-the-newest-features-of-firefox\">How can I get the newest features of Firefox?</h1>\n<p>If you want to keep your Firefox up to date, with all the latest features and updates, you need to upgrade your operating system to Windows 10 or higher. In some cases, Microsoft may require newer hardware in order to support the newer operating system. After upgrading, you can easily reinstall Firefox and <a href=\"/en-US/kb/switching-devices\">keep all of your settings</a>.\n</p>",
  "text": "Firefox version 115 is the last supported Firefox version for users of Windows 7, Windows 8 and Windows 8.1. If you have been using Firefox on these versions of Windows, you will be moved to the Firefox Extended Support Release (ESR) channel by an application update. If you want to install Firefox on Windows 7, Windows 8 or Windows 8.1 and you visit the Firefox download page at https://www.mozilla.org/firefox/windows/ your Windows version will be detected and you will be prompted to download the latest Firefox 115 ESR version for your 32-bit or 64-bit Windows system. Mozilla will provide security updates for Firefox 115 ESR until at least 115.27.0esr in August 2025, when the position will be re-evaluated. Why has Firefox ended support for Windows 7, 8 and 8.1 users? Microsoft ended official support for Windows 7, 8 and 8.1 in January of 2023. Unsupported operating systems receive no security updates and have known exploits. With no official support from Microsoft, maintaining Firefox for obsolete operating systems becomes costly for Mozilla and dangerous for users. Will switching to a different browser keep me protected? No. Most browsers, including Google Chrome and Microsoft Edge, have already ended support for Windows 7, 8 and 8.1. Can I still browse safely with Firefox Windows 7, 8 and 8.1? Mozilla is providing critical security updates through the Firefox ESR channel up until the end of ESR version 115, August 2025. After this, no security updates are provided and you are strongly encouraged to move to a supported version of Microsoft Windows. How can I get the newest features of Firefox? If you want to keep your Firefox up to date, with all the latest features and updates, you need to upgrade your operating system to Windows 10 or higher. In some cases, Microsoft may require newer hardware in order to support the newer operating system. After upgrading, you can easily reinstall Firefox and keep all of your settings .",
  "products": [
    "firefox"
  ],
  "topics": [
    "installation-and-updates"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2901,
    "text_bytes": 1956,
    "word_count": 324,
    "downloaded_at": "2025-08-26T10:56:09.824185"
  }
}