{
  "slug": "firefox-support-windows-10-end-support",
  "title": "What Windows 10 end of support means for Firefox users",
  "summary": "Learn how Firefox will continue to support Windows 10 even after Microsoft ends updates and what steps Mozilla recommends.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-support-windows-10-end-support",
  "html": "<p>Windows 10 will reach EOS (end of support) on October 14, 2025. After that date, Microsoft will no longer release free security updates or bug fixes for the operating system. \n</p>\n<div class=\"warning\"><strong>Important:</strong> You can get a free one-year Windows 10 security update extension if you back up system settings to OneDrive via Windows Backup. You must have a Microsoft account. For more details, see Microsoft’s <a href=\"https://www.microsoft.com/windows/end-of-support\">End of Support page for Windows 10</a>.</div>\n<p>If you're a Firefox user on Windows 10, you may wonder what this means for your browser experience. You shouldn’t worry: <strong>Firefox will continue to support Windows 10 for the foreseeable future</strong>.\n</p>\n<h1 id=\"w_will-firefox-continue-to-support-windows-10\">Will Firefox continue to support Windows 10?</h1>\n<p><strong>Yes.</strong>\n</p><p>Firefox on the <strong>Release channel</strong> will continue to support Windows 10 users, even after Microsoft ends updates for this operating system. Mozilla has not announced any end-of-support date for Windows 10, but if one will be set, it’s <strong>still several years away</strong>.\n</p><p>If you’re using Firefox Release, no action is needed. The Firefox browser will keep receiving updates, security patches, and performance improvements, and you should be able to run it without any crashes or issues.\n</p>\n<h1 id=\"w_do-i-need-to-use-firefox-esr-to-stay-supported\">Do I need to use Firefox ESR to stay supported?</h1>\n<p><strong>No.</strong>\n</p><p>While Windows 7 and 8 users can only use Firefox ESR 115, <strong>Windows 10 users do not need to switch to ESR</strong>.\n</p><p>However, <strong>Firefox Extended Support Release (ESR) version 140 does support Windows 10</strong>, and next year's <strong>ESR 152</strong> will also include support for Windows 10.\n</p><p>Firefox ESR receives monthly security updates, but it's enhanced with new features only once per year. As a result, you will have a stable browsing experience without any unexpected new features disrupting it.\n</p><p>So the choice is yours: you’re welcome to use Firefox ESR on Windows 10, and you’ll have support for it in the years to come. \n</p>\n<h1 id=\"w_mozilla-recommends-you-should-prepare-for-the-future\">Mozilla recommends you should prepare for the future</h1>\n<p>While Firefox will be supported on Windows 10 long after the operating system’s end of support, Mozilla encourages users to take additional steps to stay secure:\n</p>\n<ul><li><strong>Upgrade to Windows 11</strong> if your computer is eligible.\n</li><li>If you want to stay on Windows 10, consider <strong>Microsoft’s Extended Security Updates (ESU)</strong> to receive critical patches. <strong>Simply turning Windows Backup on will get you one year of free security updates for Windows 10</strong>. Learn more on Microsoft’s <a href=\"https://support.microsoft.com/windows/windows-10-consumer-extended-security-updates-esu-program-33e17de9-36b3-43bb-874d-6c53d2e4bf42\">ESU Program page</a>.\n</li><li>Follow the steps listed under <a href=\"#w_plan-for-a-new-windows-11-pc\">Plan for a new Windows PC</a> so you are ready in case you need to get a new device unexpectedly.\n</li></ul>\n<h1 id=\"w_what-happens-if-i-upgrade-to-windows-11\">What happens if I upgrade to Windows 11?</h1>\n<p>If you upgrade from Windows 10 to Windows 11 <strong>on the same computer</strong>, Firefox will continue to work normally.\n</p><p>Your tabs, bookmarks, history, passwords, and settings will remain intact, just like during a regular Windows update.\n</p>\n<div class=\"note\"><strong>Note:</strong> Microsoft will notify you if your device is eligible for Windows 11.</div>\n<h1 id=\"w_plan-for-a-new-windows-11-pc\">Plan for a new Windows 11 PC</h1>\n<p>If you plan to buy a new Windows 11 computer, you can take steps now to make it easier to move Firefox and your data, while still using your Windows 10 device:\n</p>\n<ul><li><strong>Enable Windows Backup:</strong> This helps with reinstalling your apps (including Firefox) on your new PC.\n</li><li><strong>Create a Mozilla account:</strong> A Mozilla account lets you sync your bookmarks, history, passwords, add-ons, and settings across multiple devices. After signing in on your new computer, all your Firefox data will be restored automatically. <a href=\"/en-US/kb/how-do-i-set-sync-my-computer\">Learn more about setting up sync on Firefox</a>.\n<ul><li>You can also use the <a href=\"/en-US/kb/switching-devices\">Mozilla Account backup assistant</a> to manually sync your data and email yourself a link to download Firefox.\n</li></ul>\n</li></ul>\n<p>\n</p>\n<div class=\"note\"><strong>Note</strong>: Mozilla recommends that you turn on Windows Backup and use sync on Firefox even if you don’t get a Windows 11 PC. This way, you’ll be protected against loss of data in case of device failure, and it will ensure that you continue to get Windows 10 security updates. </div>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/switch-to-firefox-extended-support-release-esr\">Switch to Firefox Extended Support Release (ESR) for personal use</a>\n</li><li><a href=\"/en-US/kb/update-firefox-latest-release\">Update Firefox to the latest release</a>\n</li><li><a href=\"/en-US/kb/how-install-firefox-windows\">How to install Firefox on Windows</a>\n</li></ul>",
  "text": "Windows 10 will reach EOS (end of support) on October 14, 2025. After that date, Microsoft will no longer release free security updates or bug fixes for the operating system. Important: You can get a free one-year Windows 10 security update extension if you back up system settings to OneDrive via Windows Backup. You must have a Microsoft account. For more details, see Microsoft’s End of Support page for Windows 10 . If you're a Firefox user on Windows 10, you may wonder what this means for your browser experience. You shouldn’t worry: Firefox will continue to support Windows 10 for the foreseeable future . Will Firefox continue to support Windows 10? Yes. Firefox on the Release channel will continue to support Windows 10 users, even after Microsoft ends updates for this operating system. Mozilla has not announced any end-of-support date for Windows 10, but if one will be set, it’s still several years away . If you’re using Firefox Release, no action is needed. The Firefox browser will keep receiving updates, security patches, and performance improvements, and you should be able to run it without any crashes or issues. Do I need to use Firefox ESR to stay supported? No. While Windows 7 and 8 users can only use Firefox ESR 115, Windows 10 users do not need to switch to ESR . However, Firefox Extended Support Release (ESR) version 140 does support Windows 10 , and next year's ESR 152 will also include support for Windows 10. Firefox ESR receives monthly security updates, but it's enhanced with new features only once per year. As a result, you will have a stable browsing experience without any unexpected new features disrupting it. So the choice is yours: you’re welcome to use Firefox ESR on Windows 10, and you’ll have support for it in the years to come. Mozilla recommends you should prepare for the future While Firefox will be supported on Windows 10 long after the operating system’s end of support, Mozilla encourages users to take additional steps to stay secure: Upgrade to Windows 11 if your computer is eligible. If you want to stay on Windows 10, consider Microsoft’s Extended Security Updates (ESU) to receive critical patches. Simply turning Windows Backup on will get you one year of free security updates for Windows 10 . Learn more on Microsoft’s ESU Program page . Follow the steps listed under Plan for a new Windows PC so you are ready in case you need to get a new device unexpectedly. What happens if I upgrade to Windows 11? If you upgrade from Windows 10 to Windows 11 on the same computer , Firefox will continue to work normally. Your tabs, bookmarks, history, passwords, and settings will remain intact, just like during a regular Windows update. Note: Microsoft will notify you if your device is eligible for Windows 11. Plan for a new Windows 11 PC If you plan to buy a new Windows 11 computer, you can take steps now to make it easier to move Firefox and your data, while still using your Windows 10 device: Enable Windows Backup: This helps with reinstalling your apps (including Firefox) on your new PC. Create a Mozilla account: A Mozilla account lets you sync your bookmarks, history, passwords, add-ons, and settings across multiple devices. After signing in on your new computer, all your Firefox data will be restored automatically. Learn more about setting up sync on Firefox . You can also use the Mozilla Account backup assistant to manually sync your data and email yourself a link to download Firefox. Note : Mozilla recommends that you turn on Windows Backup and use sync on Firefox even if you don’t get a Windows 11 PC. This way, you’ll be protected against loss of data in case of device failure, and it will ensure that you continue to get Windows 10 security updates. Related articles Switch to Firefox Extended Support Release (ESR) for personal use Update Firefox to the latest release How to install Firefox on Windows",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse",
    "installation-and-updates"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5341,
    "text_bytes": 3894,
    "word_count": 672,
    "downloaded_at": "2025-08-26T11:02:56.663904"
  }
}