{
  "slug": "firefox-terms-of-use-faq",
  "title": "Firefox Terms of Use FAQ",
  "summary": "Frequently asked questions about Firefox Terms of Use.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-terms-of-use-faq",
  "html": "<p>\nThis article answers some frequently asked questions about the <a href=\"https://www.mozilla.org/about/legal/terms/firefox/\">Firefox Terms of Use</a>.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_firefox-is-open-source-software-why-does-it-need-a-terms-of-use-why-now\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Firefox is open-source software. Why does it need a Terms of Use? Why now?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_if-i-accept-the-terms-of-use-what-changes-for-me\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">If I accept the Terms of Use, what changes for me?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-data-does-mozilla-collect-and-why\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">What data does Mozilla collect and why?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_does-the-terms-of-use-grant-mozilla-any-license-to-use-my-data-beyond-whats-already-specified-in-the-privacy-notice\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Does the Terms of Use grant Mozilla any license to use my data beyond what’s already specified in the Privacy Notice?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_does-mozilla-track-my-browsing-history\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Does Mozilla track my browsing history?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-can-i-control-how-firefox-uses-my-data\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">How can I control how Firefox uses my data?</span></a></li></ul></div>\n<h1 id=\"w_firefox-is-open-source-software-why-does-it-need-a-terms-of-use-why-now\">Firefox is open-source software. Why does it need a Terms of Use? Why now?</h1>\n<p>Firefox has always been — and still is — open-source, with its code governed by the Mozilla Public License.\n</p><p>Most modern software or services also have Terms of Use. We used to rely on a shorter notice (formerly located at <em>about:rights</em>), but we’re formalizing it now because:\n</p>\n<ul><li>The content wasn’t comprehensive enough for a modern browser like Firefox.\n</li><li>Today’s laws expect software providers to spell out a lot more details — even the seemingly obvious ones.\n</li><li>Writing down our commitments to users is more transparent than leaving them unsaid.\n</li></ul>\n<p>Nothing about how Firefox works changes.\n</p>\n<h1 id=\"w_if-i-accept-the-terms-of-use-what-changes-for-me\">If I accept the Terms of Use, what changes for me?</h1>\n<p>Nothing changes. The <a href=\"https://www.mozilla.org/about/legal/terms/firefox/\">Terms of Use</a> simply describe the expectations between Mozilla and our users in clearer language so it’s easy to access and understand. \n</p><p>You still own your data. Firefox still works the way it did before. What you do online remains none of our business.\n</p>\n<h1 id=\"w_what-data-does-mozilla-collect-and-why\">What data does Mozilla collect and why?</h1>\n<p>As part of our <a href=\"https://www.mozilla.org/about/webvision/full/#privacy\">vision for privacy</a>, we hold Firefox to an unusually high standard with respect to handling user data. Put simply, we design Firefox so that even Mozilla does not learn what you do online.\n</p><p>You don’t have to take our word for this — Firefox is developed in the open, so you can <a href=\"https://firefox-source-docs.mozilla.org/contributing/data-collection.html\">read the rules</a> that our engineers follow when working on Firefox, and check the source code to see that we’re following them.\n</p><p>Whatever data that Firefox sends to Mozilla is outlined in our <a href=\"https://www.mozilla.org/privacy/firefox/\">Privacy Notice</a>, which also describes how it’s used and why. As always, you have control over your data and can configure any features that use data in Firefox settings.\n</p>\n<h1 id=\"w_does-the-terms-of-use-grant-mozilla-any-license-to-use-my-data-beyond-whats-already-specified-in-the-privacy-notice\">Does the Terms of Use grant Mozilla any license to use my data beyond what’s already specified in the Privacy Notice?</h1>\n<p>No. The <a href=\"https://www.mozilla.org/about/legal/terms/firefox/\">Terms of Use</a> doesn’t give Mozilla any new rights to your data. \n</p><p>Previously, we had included some routine licensing language in our Terms of Use that many found confusing. We listened to your feedback, took a second look, and determined the <a href=\"https://www.mozilla.org/privacy/firefox/\">Privacy Notice</a> sufficiently covers the limited permissions we need to operate Firefox on your behalf — so that language has been removed.\n</p><p>Your data is yours and you have full control over how it’s used.\n</p>\n<h1 id=\"w_does-mozilla-track-my-browsing-history\">Does Mozilla track my browsing history?</h1>\n<p>No, your browsing history is personal and Firefox is designed to keep that information private.\n</p><p>Unlike many other browsers where sensitive user data is routinely collected and stored, Firefox is built on the <a href=\"https://firefox-source-docs.mozilla.org/contributing/data-collection.html#browsing-data\">principle</a> that not even Mozilla should know which websites you visit or what you do there.\n</p><p>For example, when you sync your history or bookmarks, Firefox has to send data to Mozilla servers so you can seamlessly access them across devices. However, we use end-to-end encryption before it leaves your device so even we can’t see what sites you’re visiting.\n</p>\n<h1 id=\"w_how-can-i-control-how-firefox-uses-my-data\">How can I control how Firefox uses my data?</h1>\n<p>Firefox is built on the <a href=\"https://www.mozilla.org/privacy/principles/\">principle</a> that users should be in control of their data. It’s designed with best-in-class privacy and security protections by default.\n</p><p>For step-by-step instructions on how to manage your data preferences, see:\n</p>\n<ul><li><a href=\"/en-US/kb/manage-firefox-data-collection-privacy-settings\">Manage data collection and privacy settings on Firefox for desktop</a>\n</li><li><a href=\"/en-US/kb/mobile-manage-firefox-data-collection-and-privacy\">Manage data collection and privacy settings on Firefox for mobile</a> \n</li></ul>\n<p>Detailed information about how your data is used and why can be found in our <a href=\"https://www.mozilla.org/privacy/firefox/\">Privacy Notice</a>.\n</p>",
  "text": "This article answers some frequently asked questions about the Firefox Terms of Use . Table of Contents 1 Firefox is open-source software. Why does it need a Terms of Use? Why now? 2 If I accept the Terms of Use, what changes for me? 3 What data does Mozilla collect and why? 4 Does the Terms of Use grant Mozilla any license to use my data beyond what’s already specified in the Privacy Notice? 5 Does Mozilla track my browsing history? 6 How can I control how Firefox uses my data? Firefox is open-source software. Why does it need a Terms of Use? Why now? Firefox has always been — and still is — open-source, with its code governed by the Mozilla Public License. Most modern software or services also have Terms of Use. We used to rely on a shorter notice (formerly located at about:rights ), but we’re formalizing it now because: The content wasn’t comprehensive enough for a modern browser like Firefox. Today’s laws expect software providers to spell out a lot more details — even the seemingly obvious ones. Writing down our commitments to users is more transparent than leaving them unsaid. Nothing about how Firefox works changes. If I accept the Terms of Use, what changes for me? Nothing changes. The Terms of Use simply describe the expectations between Mozilla and our users in clearer language so it’s easy to access and understand. You still own your data. Firefox still works the way it did before. What you do online remains none of our business. What data does Mozilla collect and why? As part of our vision for privacy , we hold Firefox to an unusually high standard with respect to handling user data. Put simply, we design Firefox so that even Mozilla does not learn what you do online. You don’t have to take our word for this — Firefox is developed in the open, so you can read the rules that our engineers follow when working on Firefox, and check the source code to see that we’re following them. Whatever data that Firefox sends to Mozilla is outlined in our Privacy Notice , which also describes how it’s used and why. As always, you have control over your data and can configure any features that use data in Firefox settings. Does the Terms of Use grant Mozilla any license to use my data beyond what’s already specified in the Privacy Notice? No. The Terms of Use doesn’t give Mozilla any new rights to your data. Previously, we had included some routine licensing language in our Terms of Use that many found confusing. We listened to your feedback, took a second look, and determined the Privacy Notice sufficiently covers the limited permissions we need to operate Firefox on your behalf — so that language has been removed. Your data is yours and you have full control over how it’s used. Does Mozilla track my browsing history? No, your browsing history is personal and Firefox is designed to keep that information private. Unlike many other browsers where sensitive user data is routinely collected and stored, Firefox is built on the principle that not even Mozilla should know which websites you visit or what you do there. For example, when you sync your history or bookmarks, Firefox has to send data to Mozilla servers so you can seamlessly access them across devices. However, we use end-to-end encryption before it leaves your device so even we can’t see what sites you’re visiting. How can I control how Firefox uses my data? Firefox is built on the principle that users should be in control of their data. It’s designed with best-in-class privacy and security protections by default. For step-by-step instructions on how to manage your data preferences, see: Manage data collection and privacy settings on Firefox for desktop Manage data collection and privacy settings on Firefox for mobile Detailed information about how your data is used and why can be found in our Privacy Notice .",
  "products": [
    "firefox",
    "mobile",
    "ios"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6335,
    "text_bytes": 3831,
    "word_count": 667,
    "downloaded_at": "2025-08-26T11:02:43.764561"
  }
}