{
  "slug": "firefox-desktop-launcher",
  "title": "How the Firefox desktop launcher works",
  "summary": "Understand how the Firefox desktop launcher helps restore Firefox after restoring with One Drive.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-desktop-launcher",
  "html": "<p>When you migrate your desktop shortcuts through OneDrive to a new or updated device, your regular Firefox shortcut automatically becomes a \"smart shortcut\" application, known as the <a href=\"https://firefox-source-docs.mozilla.org/browser/desktop-launcher/index.html\">Firefox desktop launcher</a>.\n</p><p>This smart shortcut app checks if Firefox is already installed on your device. If Firefox is already installed, it will just launch the browser for you. If Firefox isn't present when you click the smart shortcut, it asks to install Firefox for you. This ensures that Firefox remains conveniently accessible right from your desktop, even on a brand-new or freshly upgraded device.\n</p><p>We introduced this feature starting with <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 143 installations and updates, to make sure you always have a visible, convenient entry point to Firefox when setting up your new device. It eliminates the hassle of manually installing Firefox if it isn't yet installed, ensuring that your favorite browser is ready to go with a single click.\n</p><p>This means less setup and more browsing, saving you time and effort during the transition to your new device. The Firefox desktop launcher specifically benefits users migrating to new devices on Windows who sync desktop items through OneDrive.\n</p>\n<div class=\"warning\"><strong>Important note:</strong> Although this smart shortcut automatically installs Firefox, you’ll still need to ensure you’ve backed up your personal Firefox data (such as bookmarks, passwords, and settings) separately. The Firefox desktop launcher does not automatically restore your personal Firefox profile or data. To restore your data from your last sync backup, simply <a href=\"/en-US/kb/sync-firefox-desktop\">sign into the browser</a> with your Mozilla account. You can also restore from a <a href=\"/en-US/kb/back-and-restore-information-firefox-profiles#w_restore-a-profile-backup\">profile backup</a>.</div>\n<h2 id=\"w_how-to-run-firefox-desktop-launcher\">How to run Firefox desktop launcher</h2>\n<p>When migrating your desktop items via OneDrive onto your new or updated device, use the following steps:\n</p>\n<ol><li> <strong>Click the Firefox shortcut</strong>\n<dl><dt>Firefox replaces the standard desktop shortcut with a smart shortcut that automatically checks your device’s Firefox installation status. You’ll notice that the typical “arrow” on the icon is no longer present. To begin, double-check the smart shortcut.\n</dt><dt><img alt=\"Firefox shortcut change\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-08-19-13-48-02-75e1a5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> \n</dt></dl>\n</li><li> <strong>Run a new installation, if needed</strong>\n<dl><dt>If Firefox isn't installed on the new or upgraded device yet, clicking the smart shortcut will initiate the installation automatically without you needing to manually download and run the installer. Wait for the installation to complete.\n</dt><dt><img alt=\"Firefox installation\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-08-19-13-48-52-be969f.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> \n</dt></dl>\n</li><li> <strong>Quickly access Firefox</strong>\n<dl><dt>After installation completes, Firefox browser window open after automatic installation via desktop launcher.\n</dt><dt><img alt=\"Welcome to Firefox\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-08-19-13-50-51-60c88d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> \n</dt></dl>\n</li></ol>\n<p><br>\n</p>\n<h2 id=\"w_related-articles\">Related articles</h2>\n<ul><li> <a href=\"/en-US/kb/firefox-support-windows-10-end-support\">What Windows 10 end of support means for Firefox users</a>\n</li><li> <a href=\"/en-US/kb/back-and-restore-information-firefox-profiles\">Back up and restore information in Firefox profiles</a>\n</li><li> <a href=\"/en-US/kb/sync-firefox-desktop\">How to perform Sync on Firefox desktop</a>\n</li><li> <a href=\"/en-US/kb/switching-devices\">Back up and transfer your Firefox data to a new device</a>\n</li></ul>",
  "text": "When you migrate your desktop shortcuts through OneDrive to a new or updated device, your regular Firefox shortcut automatically becomes a \"smart shortcut\" application, known as the Firefox desktop launcher . This smart shortcut app checks if Firefox is already installed on your device. If Firefox is already installed, it will just launch the browser for you. If Firefox isn't present when you click the smart shortcut, it asks to install Firefox for you. This ensures that Firefox remains conveniently accessible right from your desktop, even on a brand-new or freshly upgraded device. We introduced this feature starting with Firefox version 143 installations and updates, to make sure you always have a visible, convenient entry point to Firefox when setting up your new device. It eliminates the hassle of manually installing Firefox if it isn't yet installed, ensuring that your favorite browser is ready to go with a single click. This means less setup and more browsing, saving you time and effort during the transition to your new device. The Firefox desktop launcher specifically benefits users migrating to new devices on Windows who sync desktop items through OneDrive. Important note: Although this smart shortcut automatically installs Firefox, you’ll still need to ensure you’ve backed up your personal Firefox data (such as bookmarks, passwords, and settings) separately. The Firefox desktop launcher does not automatically restore your personal Firefox profile or data. To restore your data from your last sync backup, simply sign into the browser with your Mozilla account. You can also restore from a profile backup . How to run Firefox desktop launcher When migrating your desktop items via OneDrive onto your new or updated device, use the following steps: Click the Firefox shortcut Firefox replaces the standard desktop shortcut with a smart shortcut that automatically checks your device’s Firefox installation status. You’ll notice that the typical “arrow” on the icon is no longer present. To begin, double-check the smart shortcut. Run a new installation, if needed If Firefox isn't installed on the new or upgraded device yet, clicking the smart shortcut will initiate the installation automatically without you needing to manually download and run the installer. Wait for the installation to complete. Quickly access Firefox After installation completes, Firefox browser window open after automatic installation via desktop launcher. Related articles What Windows 10 end of support means for Firefox users Back up and restore information in Firefox profiles How to perform Sync on Firefox desktop Back up and transfer your Firefox data to a new device",
  "products": [
    "firefox"
  ],
  "topics": [
    "installation-and-updates"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4527,
    "text_bytes": 2681,
    "word_count": 417,
    "downloaded_at": "2025-08-26T11:03:03.110755"
  }
}