{
  "slug": "firefox-keeps-crashing-startup",
  "title": "Firefox keeps crashing at startup",
  "summary": "If Firefox keeps crashing when you try to start it and other solutions don't work, a clean reinstall can often fix the problem.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-keeps-crashing-startup",
  "html": "<p>A <em>crash</em> is what happens when Firefox closes or quits unexpectedly and the <a href=\"/en-US/kb/mozillacrashreporter\">Mozilla Crash Reporter</a> appears. If Firefox keeps crashing when you open it, this article will show you how to get it working again.\n</p>\n<ul><li> If Firefox starts without crashing but then crashes later on, see the <a href=\"/en-US/kb/troubleshoot-firefox-crashes-closing-or-quitting\">Troubleshoot Firefox crashes (closing or quitting unexpectedly)</a> article.\n</li><li> If Firefox won't start at all, see the <a href=\"/en-US/kb/firefox-wont-start-find-solutions\">Firefox won't start - find solutions</a> article for solutions.\n</li></ul>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_see-if-you-can-start-in-firefox-troubleshoot-mode\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">See if you can start in Firefox Troubleshoot Mode</span></a></li><li class=\"toclevel-1\"><a href=\"#w_try-a-clean-installation\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Try a clean installation</span></a></li><li class=\"toclevel-1\"><a href=\"#w_uninstall-software-known-to-cause-crashes\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Uninstall software known to cause crashes</span></a></li><li class=\"toclevel-1\"><a href=\"#w_get-help-fixing-the-problem\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Get help fixing the problem</span></a></li></ul></div>\n<h1 id=\"w_see-if-you-can-start-in-firefox-troubleshoot-mode\">See if you can start in Firefox Troubleshoot Mode</h1>\n<p>As a first step, you should see if Firefox starts in <a href=\"/en-US/kb/diagnose-firefox-issues-using-troubleshoot-mode\">Firefox Troubleshoot Mode</a>. This special startup mode temporarily turns off hardware acceleration among other settings and disables installed extensions that may prevent Firefox from starting.\n</p>\n<ul><li>If you can start in Firefox Troubleshoot Mode, see the article <a href=\"/en-US/kb/troubleshoot-extensions-themes-to-fix-problems\">Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems</a> for solutions.\n</li><li>If Firefox won't start in Troubleshoot Mode, you can <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">Refresh Firefox</a> or you can use the <a href=\"/en-US/kb/profile-manager-create-remove-switch-firefox-profiles\">Profile Manager</a> to create a new Firefox profile, to see if that fixes the problem. Alternatively, you can first try a clean installation (see below).\n</li></ul>\n<h1 id=\"w_try-a-clean-installation\">Try a clean installation</h1>\n<p>If crashes are preventing you from starting Firefox, even in Firefox Troubleshoot Mode, a clean installation of the latest version of Firefox may fix the problem.\n</p>\n<div class=\"note\"><strong>Will I lose my bookmarks, passwords, and add-ons?</strong> A clean installation will not delete your bookmarks, saved passwords, add-ons, or other personal information. This information is stored separately in your <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile</a> folder.</div>\n<p>Here's how to do a clean installation of Firefox:\n</p><div class=\"for\" data-for=\"win\">\n<ol><li>Uninstall Firefox. See <a href=\"/en-US/kb/uninstall-firefox-from-your-computer\">Uninstall Firefox from your computer</a> for details.\n</li><li>To remove leftover program files that may not have been removed by the uninstall process, manually delete the Firefox installation folder, normally located in one of these folders by default:\n<ul><li>C:\\Program Files\\Mozilla Firefox\n</li><li>C:\\Program Files (x86)\\Mozilla Firefox\n</li></ul>\n</li><li><a href=\"https://www.mozilla.org/firefox/new/\">\n<img alt=\"download firefox win 32x32\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2014-12-23-05-25-41-0a158e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\"></a>\n<a href=\"https://www.mozilla.org/firefox/new/\">Download a fresh copy of Firefox</a>.\n</li><li>Double-click on the downloaded file and follow the prompts to continue the installation process.\n</li></ol>\n<p>For more information on how to install Firefox, see <a href=\"/en-US/kb/how-install-firefox-windows\">How to install Firefox on Windows</a>.\n</p></div><div class=\"for\" data-for=\"mac\">\n<ol><li>Delete Firefox from the <em>Applications</em> folder.\n</li><li><a href=\"https://www.mozilla.org/firefox/new/\">\n<img alt=\"mac download 32x32\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2014-12-23-05-23-48-f2a821.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\"></a>\n<a href=\"https://www.mozilla.org/firefox/new/\">Download a fresh copy of Firefox</a>.\n</li><li>Open the downloaded file and drag the Firefox icon to the <em>Applications</em> folder when prompted.\n</li></ol>\n<p>For more information on installing Firefox, see <a href=\"/en-US/kb/how-download-and-install-firefox-mac\">How to download and install Firefox on Mac</a>.\n</p></div><div class=\"for\" data-for=\"linux\">\n<ol><li> Use your distributor's package management system to uninstall Firefox (please refer to their documentation). If that doesn't work, delete the <em>firefox</em> folder from your <em>Home</em> folder.\n<ul><li> Often the Firefox folder is within a hidden <em>.mozilla</em> folder. See also <a href=\"http://kb.mozillazine.org/Show_hidden_files_and_folders#Linux\">http://kb.mozillazine.org/Show_hidden_files_and_folders#Linux</a>\n</li></ul>\n</li><li> Install Firefox through your package management system or follow these steps to manually install Firefox:\n<ul><li> <a href=\"https://www.mozilla.org/firefox/new/\">\n<img alt=\"download linux 32x32\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2014-12-23-05-25-14-7b24b1.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\"></a>\n<a href=\"https://www.mozilla.org/firefox/new/\">Download a fresh copy of Firefox</a>.\n</li><li> Extract the file to your <em>Home</em> folder.\n</li><li> For more detailed instructions also see <a href=\"/en-US/kb/install-firefox-linux\">Install Firefox on Linux</a>.\n</li></ul>\n</li></ol>\n</div>\n<h1 id=\"w_uninstall-software-known-to-cause-crashes\">Uninstall software known to cause crashes</h1>\n<p>Some programs are known to cause crashes in Firefox and other browsers. Check your computer and remove any malware or software that might be causing problems:\n</p>\n<ul><li>Check the <a href=\"https://www.mozilla.org/en-US/firefox/releases/\">release notes</a> to see if there are any known issues for your version of Firefox. Check your computer's instructions on how to uninstall software that's causing problems.\n</li><li>Scan your computer for malware. Check the support site of your antivirus program for help with scanning and removing malware. For more information, see <a href=\"/en-US/kb/troubleshoot-firefox-issues-caused-malware\">Troubleshoot Firefox issues caused by malware</a>.\n</li></ul>\n<h1 id=\"w_get-help-fixing-the-problem\">Get help fixing the problem</h1>\n<p>If you need more help, you can ask a question in the support forum. If possible, please include a crash Report ID when you post your question. See <a href=\"/en-US/kb/troubleshoot-firefox-crashes-closing-or-quitting#w_get-help-fixing-this-crash\">Get help fixing this crash</a> for details.\n</p>",
  "text": "A crash is what happens when Firefox closes or quits unexpectedly and the Mozilla Crash Reporter appears. If Firefox keeps crashing when you open it, this article will show you how to get it working again. If Firefox starts without crashing but then crashes later on, see the Troubleshoot Firefox crashes (closing or quitting unexpectedly) article. If Firefox won't start at all, see the Firefox won't start - find solutions article for solutions. Table of Contents 1 See if you can start in Firefox Troubleshoot Mode 2 Try a clean installation 3 Uninstall software known to cause crashes 4 Get help fixing the problem See if you can start in Firefox Troubleshoot Mode As a first step, you should see if Firefox starts in Firefox Troubleshoot Mode . This special startup mode temporarily turns off hardware acceleration among other settings and disables installed extensions that may prevent Firefox from starting. If you can start in Firefox Troubleshoot Mode, see the article Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems for solutions. If Firefox won't start in Troubleshoot Mode, you can Refresh Firefox or you can use the Profile Manager to create a new Firefox profile, to see if that fixes the problem. Alternatively, you can first try a clean installation (see below). Try a clean installation If crashes are preventing you from starting Firefox, even in Firefox Troubleshoot Mode, a clean installation of the latest version of Firefox may fix the problem. Will I lose my bookmarks, passwords, and add-ons? A clean installation will not delete your bookmarks, saved passwords, add-ons, or other personal information. This information is stored separately in your profile folder. Here's how to do a clean installation of Firefox: Uninstall Firefox. See Uninstall Firefox from your computer for details. To remove leftover program files that may not have been removed by the uninstall process, manually delete the Firefox installation folder, normally located in one of these folders by default: C:\\Program Files\\Mozilla Firefox C:\\Program Files (x86)\\Mozilla Firefox Download a fresh copy of Firefox . Double-click on the downloaded file and follow the prompts to continue the installation process. For more information on how to install Firefox, see How to install Firefox on Windows . Delete Firefox from the Applications folder. Download a fresh copy of Firefox . Open the downloaded file and drag the Firefox icon to the Applications folder when prompted. For more information on installing Firefox, see How to download and install Firefox on Mac . Use your distributor's package management system to uninstall Firefox (please refer to their documentation). If that doesn't work, delete the firefox folder from your Home folder. Often the Firefox folder is within a hidden .mozilla folder. See also http://kb.mozillazine.org/Show_hidden_files_and_folders#Linux Install Firefox through your package management system or follow these steps to manually install Firefox: Download a fresh copy of Firefox . Extract the file to your Home folder. For more detailed instructions also see Install Firefox on Linux . Uninstall software known to cause crashes Some programs are known to cause crashes in Firefox and other browsers. Check your computer and remove any malware or software that might be causing problems: Check the release notes to see if there are any known issues for your version of Firefox. Check your computer's instructions on how to uninstall software that's causing problems. Scan your computer for malware. Check the support site of your antivirus program for help with scanning and removing malware. For more information, see Troubleshoot Firefox issues caused by malware . Get help fixing the problem If you need more help, you can ask a question in the support forum. If possible, please include a crash Report ID when you post your question. See Get help fixing this crash for details.",
  "products": [
    "firefox"
  ],
  "topics": [
    "crashing-and-slow-performance",
    "performance-and-connectivity"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 7601,
    "text_bytes": 3964,
    "word_count": 626,
    "downloaded_at": "2025-08-26T11:03:39.408058"
  }
}