{
  "slug": "firefox-contrast-control",
  "title": "Make reading easier with Firefox's contrast control settings",
  "summary": "Customize Firefox’s colors to fit your browsing experience needs",
  "url": "https://support.mozilla.org/en-US/kb/firefox-contrast-control",
  "html": "<p>You can now set up Firefox to use the same colors across websites, thanks to the new Contrast Control settings. This article will show you how to access the new settings and why using them could greatly improve your browsing experience.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_contrast-control\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Contrast Control</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_automatic-use-system-settings\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Automatic (use system settings)</span></a></li><li class=\"toclevel-2\"><a href=\"#w_off\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Off</span></a></li><li class=\"toclevel-2\"><a href=\"#w_custom\"><span class=\"tocnumber\">1.3</span> <span class=\"toctext\">Custom</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_customize-high-contrast-mode\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Customize High Contrast Mode</span></a></li><li class=\"toclevel-1\"><a href=\"#w_why-should-i-use-it\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Why should I use it?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<h1 id=\"w_contrast-control\">Contrast Control</h1>\n<p>Firefox lets you choose how high contrast mode works in your browser. When you enable high contrast mode, all website text is rendered with a single color on top of a solid background color, making all web content easier to read.\n</p>\n<h2 id=\"w_automatic-use-system-settings\">Automatic (use system settings)</h2>\n<p>As its name suggests, choosing this option will make Firefox use the same high contrast settings and colors as your operating system.\n</p>\n<h2 id=\"w_off\">Off</h2>\n<p>Choosing this option will disable any high contrast settings you have configured in your operating system. Firefox will display web content as originally intended.\n</p>\n<h2 id=\"w_custom\">Custom</h2>\n<p>Choosing this option forces on high contrast mode and allows you to choose the colors for text and links.\n</p>\n<h1 id=\"w_customize-high-contrast-mode\">Customize High Contrast Mode</h1>\n<ol><li> Click the menu button <img alt=\"firefoxmenu\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-05-08-12-39-28-7c5104.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.\n</li><li> In the <span class=\"menu\">General</span> panel, go down to <em>Contrast Control</em>.\n</li><li> Choose one of the available options.\n</li></ol>\n<p><img alt=\"contrast\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-05-08-12-42-15-ac231a.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</p>\n<div class=\"note\"><strong>Note:</strong> The new Contrast Control settings are only available to users using <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 138 and up. If you don’t see the section, <a href=\"/en-US/kb/update-firefox-latest-release\">make sure to update Firefox</a>.</div>\n<h1 id=\"w_why-should-i-use-it\">Why should I use it?</h1>\n<ul><li><strong>Accessibility:</strong> If you’re a person with visual impairments, the new contrast control will make it easier to customize the colors, intensity and contrast of the text and background.\n</li><li><strong>A better browsing experience:</strong> Enabling the contrast control settings will let you customize the browsing experience to fit your needs. Some websites use color schemes that are hard to read or uncomfortable. With contrast control, you can override those styles to match your preferences.\n</li></ul>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/personalize-firefox-colorways\">Personalize Firefox with colorways</a>\n</li><li><a href=\"/en-US/kb/change-fonts-and-colors-websites-use\">Change the fonts and colors websites use</a>\n</li><li><a href=\"/en-US/kb/customize-firefox-controls-buttons-and-toolbars\">Customize Firefox controls, buttons and toolbars</a>\n</li></ul>",
  "text": "You can now set up Firefox to use the same colors across websites, thanks to the new Contrast Control settings. This article will show you how to access the new settings and why using them could greatly improve your browsing experience. Table of Contents 1 Contrast Control 1.1 Automatic (use system settings) 1.2 Off 1.3 Custom 2 Customize High Contrast Mode 3 Why should I use it? 4 Related articles Contrast Control Firefox lets you choose how high contrast mode works in your browser. When you enable high contrast mode, all website text is rendered with a single color on top of a solid background color, making all web content easier to read. Automatic (use system settings) As its name suggests, choosing this option will make Firefox use the same high contrast settings and colors as your operating system. Off Choosing this option will disable any high contrast settings you have configured in your operating system. Firefox will display web content as originally intended. Custom Choosing this option forces on high contrast mode and allows you to choose the colors for text and links. Customize High Contrast Mode Click the menu button and select Settings . In the General panel, go down to Contrast Control . Choose one of the available options. Note: The new Contrast Control settings are only available to users using Firefox version 138 and up. If you don’t see the section, make sure to update Firefox . Why should I use it? Accessibility: If you’re a person with visual impairments, the new contrast control will make it easier to customize the colors, intensity and contrast of the text and background. A better browsing experience: Enabling the contrast control settings will let you customize the browsing experience to fit your needs. Some websites use color schemes that are hard to read or uncomfortable. With contrast control, you can override those styles to match your preferences. Related articles Personalize Firefox with colorways Change the fonts and colors websites use Customize Firefox controls, buttons and toolbars",
  "products": [
    "firefox"
  ],
  "topics": [
    "accessibility"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4370,
    "text_bytes": 2049,
    "word_count": 337,
    "downloaded_at": "2025-08-26T11:02:27.742805"
  }
}