{
  "slug": "fix-printing-problems-firefox",
  "title": "Fix printing problems in Firefox",
  "summary": "Learn how to troubleshoot and fix printing problems in Firefox.",
  "url": "https://support.mozilla.org/en-US/kb/fix-printing-problems-firefox",
  "html": "<p>This article describes how to troubleshoot printing problems in Firefox. For general information about printing in Firefox, see <a href=\"/en-US/kb/how-print-web-pages-firefox\">How to print web pages in Firefox</a>.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_check-firefox-permissions-in-ubuntu-software\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Check Firefox permissions in Ubuntu Software</span></a></li><li class=\"toclevel-1\"><a href=\"#w_check-other-browsers-and-printers\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Check other browsers and printers</span></a></li><li class=\"toclevel-1\"><a href=\"#w_reset-firefox-printer-settings\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Reset Firefox printer settings</span></a></li></ul></div>\n<p>\n</p><div class=\"for\" data-for=\"linux\">\n<h2 id=\"w_check-firefox-permissions-in-ubuntu-software\">Check Firefox permissions in Ubuntu Software</h2>\n<p>You can see what permissions Firefox has in Ubuntu Software:\n</p>\n<ol><li> Open <strong>Ubuntu Software</strong>.\n</li><li> Switch to <strong>Installed</strong> at the top.\n</li><li> Find <strong>Firefox</strong> and click it.\n</li><li> Click <strong>Permissions</strong>.\n</li><li> If <em>Print documents</em> shows <strong>(disconnected)</strong> switch to <strong>snapd:cups-control</strong>.\n</li><li> Close and reopen Firefox, and check if printers are showing.\n</li></ol>\n<p>If you don't have an item called <strong>Ubuntu Software</strong> on your system, the same functionality can be obtained using the <strong>Snap Store</strong> application. If you don't already have it, you can install it from a command line interface by entering the command: <code>sudo snap install snap-store</code>\n</p></div>\n<h2 id=\"w_check-other-browsers-and-printers\">Check other browsers and printers</h2>\n<p>You can see whether your problem is with Firefox, your printer or the website you're visiting:\n</p>\n<ul><li> Check to see whether the page prints correctly in another browser (such as <span class=\"for\" data-for=\"win\">Internet Explorer or Microsoft Edge</span><span class=\"for\" data-for=\"mac\">Safari</span><span class=\"for\" data-for=\"linux\">Epiphany</span>).\n</li></ul>\n<p>If the page prints incorrectly in another browser also, then:\n</p>\n<ul><li> There might be a problem with your printer – If you have another printer, try printing the page with that printer. If the second printer prints the page properly, update your printer driver from your printer manufacturer's website.\n</li><li> There might be a problem with the page – Contact the website administrator.\n</li></ul>\n<p>If the page prints correctly in another browser, follow the instructions below.\n</p>\n<h2 id=\"w_reset-firefox-printer-settings\">Reset Firefox printer settings</h2>\n<ol><li> Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"menu\">Help</span> and select <span class=\"menu\">More Troubleshooting Information</span>.\n<ul><li> The <a href=\"/en-US/kb/use-troubleshooting-information-page-fix-firefox\">Troubleshooting Information page</a> with the address <em>about:support</em> will open in a new tab.\n</li></ul>\n</li><li> Go down to the <em>Printing</em> section and click <span class=\"button\">Clear saved print settings</span>.\n</li></ol>\n<p>This will remove all modified print settings in Firefox.\n</p>",
  "text": "This article describes how to troubleshoot printing problems in Firefox. For general information about printing in Firefox, see How to print web pages in Firefox . Table of Contents 1 Check Firefox permissions in Ubuntu Software 2 Check other browsers and printers 3 Reset Firefox printer settings Check Firefox permissions in Ubuntu Software You can see what permissions Firefox has in Ubuntu Software: Open Ubuntu Software . Switch to Installed at the top. Find Firefox and click it. Click Permissions . If Print documents shows (disconnected) switch to snapd:cups-control . Close and reopen Firefox, and check if printers are showing. If you don't have an item called Ubuntu Software on your system, the same functionality can be obtained using the Snap Store application. If you don't already have it, you can install it from a command line interface by entering the command: sudo snap install snap-store Check other browsers and printers You can see whether your problem is with Firefox, your printer or the website you're visiting: Check to see whether the page prints correctly in another browser (such as Internet Explorer or Microsoft Edge Safari Epiphany ). If the page prints incorrectly in another browser also, then: There might be a problem with your printer – If you have another printer, try printing the page with that printer. If the second printer prints the page properly, update your printer driver from your printer manufacturer's website. There might be a problem with the page – Contact the website administrator. If the page prints correctly in another browser, follow the instructions below. Reset Firefox printer settings Click the menu button , click Help and select More Troubleshooting Information . The Troubleshooting Information page with the address about:support will open in a new tab. Go down to the Printing section and click Clear saved print settings . This will remove all modified print settings in Firefox.",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse",
    "images-and-documents"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3637,
    "text_bytes": 1949,
    "word_count": 314,
    "downloaded_at": "2025-08-26T11:03:25.970216"
  }
}