{
  "slug": "frequently-asked-questions",
  "title": "Frequently Asked Questions",
  "summary": "Learn basic tips and guidelines for using Firefox and find answers to some frequently asked questions.",
  "url": "https://support.mozilla.org/en-US/kb/frequently-asked-questions",
  "html": "<p>\nHere is a collection of the links to the most useful pages explaining how to use some of the basic features and fix any problems you may encounter while using Firefox.\n</p><p>To learn more, click the link that best matches the information you're looking for:\n</p>\n<ul><li><a href=\"/en-US/kb/how-to-set-the-home-page\">How to set the home page</a>, which includes the following:\n<ul><li>Set or change your home page\n</li><li>Restore the default home page\n</li><li>Having problems?\n</li></ul>\n</li></ul>\n<ul><li><a href=\"/en-US/kb/private-browsing-use-firefox-without-history\">Private Browsing - Use Firefox without saving history</a>, which includes the following:\n<ul><li>How do I open a new Private Window?\n</li><li>How do I turn on Private Browsing?\n</li><li>How do I turn off Private Browsing?\n</li><li>What does Private Browsing not save?\n</li><li>Other ways to control what information Firefox saves\n</li></ul>\n</li></ul>\n<ul><li><a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">Refresh Firefox - reset add-ons and settings</a>, which includes the following:\n<ul><li>Reset Firefox to its default state\n</li><li>What does the Refresh feature do?\n</li></ul>\n</li></ul>\n<ul><li><a href=\"/en-US/kb/diagnose-firefox-issues-using-troubleshoot-mode\">Diagnose Firefox issues using Troubleshoot Mode</a>, which includes the following:\n<ul><li>How to start Firefox in Troubleshoot Mode\n</li><li>Troubleshoot Mode window\n</li><li>Troubleshooting problems in Troubleshoot Mode\n</li><li>Exiting Troubleshoot Mode\n</li><li>Make permanent changes to Firefox in the Troubleshoot Mode window\n</li></ul>\n</li></ul>\n<ul><li><a href=\"/en-US/kb/firefox-hangs-or-not-responding\">Firefox hangs or is not responding - How to fix</a>, which includes the following:\n<ul><li>Firefox hangs at random times\n</li><li>Firefox hangs after using it for a long time\n</li><li>Update Firefox\n</li><li>Firefox hangs while loading the first window\n</li><li>Speed up Session Restore\n</li><li>Firefox hangs when downloading files or saving images\n</li><li>Firefox hangs when you quit it\n</li></ul>\n</li></ul>\n<ul><li><a href=\"/en-US/kb/troubleshoot-firefox-crashes-closing-or-quitting\">Troubleshoot Firefox crashes (closing or quitting unexpectedly)</a>, which includes the following:\n<ul><li>Update your software\n</li><li>Check for viruses or spyware\n</li><li>Check to see if the crash happens in <span class=\"for\" data-for=\"not fx88\">safe mode</span><span class=\"for\" data-for=\"fx88\">Troubleshoot Mode</span>\n</li><li>Check your hardware\n</li><li>Get help fixing this crash\n</li></ul>\n</li></ul>",
  "text": "Here is a collection of the links to the most useful pages explaining how to use some of the basic features and fix any problems you may encounter while using Firefox. To learn more, click the link that best matches the information you're looking for: How to set the home page , which includes the following: Set or change your home page Restore the default home page Having problems? Private Browsing - Use Firefox without saving history , which includes the following: How do I open a new Private Window? How do I turn on Private Browsing? How do I turn off Private Browsing? What does Private Browsing not save? Other ways to control what information Firefox saves Refresh Firefox - reset add-ons and settings , which includes the following: Reset Firefox to its default state What does the Refresh feature do? Diagnose Firefox issues using Troubleshoot Mode , which includes the following: How to start Firefox in Troubleshoot Mode Troubleshoot Mode window Troubleshooting problems in Troubleshoot Mode Exiting Troubleshoot Mode Make permanent changes to Firefox in the Troubleshoot Mode window Firefox hangs or is not responding - How to fix , which includes the following: Firefox hangs at random times Firefox hangs after using it for a long time Update Firefox Firefox hangs while loading the first window Speed up Session Restore Firefox hangs when downloading files or saving images Firefox hangs when you quit it Troubleshoot Firefox crashes (closing or quitting unexpectedly) , which includes the following: Update your software Check for viruses or spyware Check to see if the crash happens in safe mode Troubleshoot Mode Check your hardware Get help fixing this crash",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2579,
    "text_bytes": 1681,
    "word_count": 277,
    "downloaded_at": "2025-08-26T10:36:13.550803"
  }
}