{
  "slug": "get-your-local-weather-forecast-firefox-address-bar",
  "title": "Get your local weather forecast from the Firefox address bar",
  "summary": "Get real-time weather updates conveniently displayed within the Firefox address bar.",
  "url": "https://support.mozilla.org/en-US/kb/get-your-local-weather-forecast-firefox-address-bar",
  "html": "<p>Get real-time weather updates conveniently displayed within the Firefox <a href=\"/en-US/kb/search-firefox-address-bar\">address bar</a>. This feature can help you stay up-to-date on the latest weather conditions without visiting a particular website or app. Simply type <strong>weather</strong> in the address bar, and you'll see weather suggestions for your location.\n<img alt=\"Accuweather\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-04-30-07-58-22-230866.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</p>\n<div class=\"note\"><strong>Note:</strong> Weather updates are at the moment only available to users in the following countries:\n<ul><li>The United States\n</li><li>The United Kingdom\n</li><li>France\n</li><li>Germany\n</li><li>Poland\n</li><li>Italy\n</li></ul>\n</div>\n<h1 id=\"w_what-weather-information-is-available\">What weather information is available?</h1>\n<ul><li><strong>City name:</strong> The city's name for which weather information is being shown.\n</li><li><strong>Expected weather:</strong> This shows the expected current weather conditions and weather forecast for the day, including temperature, precipitation and icon.\n</li><li><strong>Weather suggestions provider:</strong> A link to AccuWeather, a website that provides detailed weather information. Clicking the suggestion will take you to the provider’s website.\n</li><li><strong>Menu:</strong> Click the button on the right to provide feedback.\n</li></ul>\n<h1 id=\"w_common-questions\">Common questions</h1>\n<h2 id=\"w_where-are-these-weather-suggestions-from\">Where are these weather suggestions from?</h2>\n<p>The weather suggestions in the Firefox address bar are sourced from <a href=\"https://www.accuweather.com/\">AccuWeather</a>.\n</p>\n<h2 id=\"w_how-is-my-location-determined\">How is my location determined?</h2>\n<p>To see weather suggestions for your location in the address bar, Firefox uses your IP address to determine your approximate location. This information is then used to provide relevant weather suggestions for your area sourced from <a href=\"https://www.accuweather.com/\">AccuWeather</a>. You can learn more about this in <a href=\"/en-US/kb/how-it-works-firefox-weather\">How it works - Firefox Weather</a>.\n</p>\n<h2 id=\"w_do-you-share-my-ip-address\">Do you share my IP address?</h2>\n<p>Firefox doesn’t share your IP address or any personally identifiable information outside Mozilla servers.\n</p>\n<h2 id=\"w_can-i-search-for-weather-information-for-other-locations-from-the-address-bar\">Can I search for weather information for other locations from the address bar?</h2>\n<p>Yes, you will be able to search for weather information for other locations in the following countries:\n</p>\n<ul><li>The United States\n</li></ul>\n<p>If you’d like to search for weather in alternate cities, only the city query will be sent to our servers to get the weather data. Ex.: if you type <strong>boston weather</strong>, we’ll only send <strong>Boston</strong> to get the weather for Boston to display to you.\n</p>\n<h2 id=\"w_why-do-i-see-sponsored-next-to-accuweather-what-does-this-mean\">Why do I see “Sponsored” next to AccuWeather – what does this mean?</h2>\n<p>Firefox may receive revenue if you visit the AccuWeather website to see a more detailed weather forecast.\n</p>\n<h2 id=\"w_i-see-weather-information-for-the-wrong-location-in-the-address-bar-what-can-i-do\">I see weather information for the wrong location in the address bar – what can I do?</h2>\n<p>If you are experiencing issues with Firefox's weather suggestions or have any feedback to share, let us know. We are constantly working to improve our features, and your input can help us make Firefox even better. To submit feedback:\n</p>\n<ol><li>Find the button on the right side next to the weather suggestion in the address bar.\n</li><li>Select the option that best describes your feedback:\n<ul><li>Report inaccurate location\n</li><li>Shows less frequently\n</li><li>Don’t show this\n</li></ul>\n</li></ol>\n<div class=\"note\"><strong>Note:</strong> Clicking <strong>Don’t show this</strong> will turn off weather suggestions in the address bar.</div>\n<h1 id=\"w_learn-more\">Learn more</h1>\n<ul><li><a href=\"/en-US/kb/firefox-suggest\">How to customize Firefox Suggest settings</a>\n</li><li><a href=\"/en-US/kb/firefox-suggest-faq\">Firefox Suggest FAQ</a>\n</li></ul>",
  "text": "Get real-time weather updates conveniently displayed within the Firefox address bar . This feature can help you stay up-to-date on the latest weather conditions without visiting a particular website or app. Simply type weather in the address bar, and you'll see weather suggestions for your location. Note: Weather updates are at the moment only available to users in the following countries: The United States The United Kingdom France Germany Poland Italy What weather information is available? City name: The city's name for which weather information is being shown. Expected weather: This shows the expected current weather conditions and weather forecast for the day, including temperature, precipitation and icon. Weather suggestions provider: A link to AccuWeather, a website that provides detailed weather information. Clicking the suggestion will take you to the provider’s website. Menu: Click the button on the right to provide feedback. Common questions Where are these weather suggestions from? The weather suggestions in the Firefox address bar are sourced from AccuWeather . How is my location determined? To see weather suggestions for your location in the address bar, Firefox uses your IP address to determine your approximate location. This information is then used to provide relevant weather suggestions for your area sourced from AccuWeather . You can learn more about this in How it works - Firefox Weather . Do you share my IP address? Firefox doesn’t share your IP address or any personally identifiable information outside Mozilla servers. Can I search for weather information for other locations from the address bar? Yes, you will be able to search for weather information for other locations in the following countries: The United States If you’d like to search for weather in alternate cities, only the city query will be sent to our servers to get the weather data. Ex.: if you type boston weather , we’ll only send Boston to get the weather for Boston to display to you. Why do I see “Sponsored” next to AccuWeather – what does this mean? Firefox may receive revenue if you visit the AccuWeather website to see a more detailed weather forecast. I see weather information for the wrong location in the address bar – what can I do? If you are experiencing issues with Firefox's weather suggestions or have any feedback to share, let us know. We are constantly working to improve our features, and your input can help us make Firefox even better. To submit feedback: Find the button on the right side next to the weather suggestion in the address bar. Select the option that best describes your feedback: Report inaccurate location Shows less frequently Don’t show this Note: Clicking Don’t show this will turn off weather suggestions in the address bar. Learn more How to customize Firefox Suggest settings Firefox Suggest FAQ",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4460,
    "text_bytes": 2856,
    "word_count": 463,
    "downloaded_at": "2025-08-26T10:56:14.267734"
  }
}