{
  "slug": "how-do-i-tell-if-my-connection-is-secure",
  "title": "How do I tell if my connection to a website is secure?",
  "summary": "Firefox uses a padlock icon next to a website's URL to let you know your connection is encrypted. Click on the icon for more information.",
  "url": "https://support.mozilla.org/en-US/kb/how-do-i-tell-if-my-connection-is-secure",
  "html": "<p>When you visit a website, the Site Identity button (a padlock) appears in the address bar to the left of the web address. You can quickly find out if the connection to the website you are viewing is encrypted, and in some cases who owns the website. This should help you avoid malicious websites that are trying to obtain your personal information.\n</p><p><span class=\"for\" data-for=\"not fx138\"><img alt=\"Fx89AddressBarPadlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-29-55-5507f4.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"fx138\"><img alt=\"Fx138AddressBarPadlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-05-19-15-16-20-bc8e53.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</p><p>When viewing a secure website, the Site Identity button will be a padlock <img alt=\"Fx89Padlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-33-33-7bdc86.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">. In a few cases, however, you may see a padlock with a warning triangle <img alt=\"Fx89Padlock-Triangle\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-55-22-88c82d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> or a padlock with a red strike over it <img alt=\"Fx89Padlock-RedLine\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-53-30-fe088c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">.\n</p>\n<div class=\"note\">Clicking the padlock to the left of the address bar brings up the <a href=\"/en-US/kb/site-information-panel\">Site Information panel</a>, which allows you to view more detailed information about the security status of the connection.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_padlock\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Padlock</span></a></li><li class=\"toclevel-1\"><a href=\"#w_padlock-with-a-warning-triangle\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Padlock with a warning triangle</span></a></li><li class=\"toclevel-1\"><a href=\"#w_padlock-with-a-red-strike-over-it\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Padlock with a red strike over it</span></a></li></ul></div>\n<div class=\"warning\"><strong>Warning:</strong> You should never send any sensitive information (such as bank information, credit card data or social security numbers) to a website if the address bar shows a padlock with a warning triangle or red strike over it. In such cases, you may not be communicating with the intended website and your data isn't safe against eavesdropping!</div>\n<h1 id=\"w_padlock\">Padlock</h1>\n<p>A padlock <img alt=\"Fx89Padlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-33-33-7bdc86.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> with no warning triangle or red strike over it indicates that:\n</p>\n<ul><li>You’re definitely connected to the website whose address is shown in the address bar and the connection hasn’t been intercepted.\n</li><li>The connection between Firefox and the website is encrypted to prevent eavesdropping.\n</li></ul>\n<p>Click the padlock to find out if the website is using an <a href=\"https://wikipedia.org/wiki/Extended_Validation_Certificate\">Extended Validation (EV) certificate</a>. An EV certificate is a special type of site certificate that requires a significantly more rigorous identity verification process than other types of certificates.\n</p><p>For sites using EV certificates, the legal company or organization name and location of the website owner displays when you click the padlock.\n</p>\n<h1 id=\"w_padlock-with-a-warning-triangle\">Padlock with a warning triangle</h1>\n<p>A padlock with a warning triangle <img alt=\"Fx89Padlock-Triangle\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-55-22-88c82d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> indicates that the connection between Firefox and the website is only partially encrypted and doesn't prevent eavesdropping. By default, Firefox does not block insecure passive content such as images; you will simply see a warning that the page isn't fully secure. For more information, see <a href=\"/en-US/kb/mixed-content-blocking-firefox\">Mixed content blocking in Firefox</a>.\n</p>\n<div class=\"note\">Do not send any sensitive information to sites where the Site Identity button is a padlock with a warning triangle.</div>\n<p>A padlock with a warning triangle also appears for <a href=\"/en-US/kb/what-does-your-connection-is-not-secure-mean\">website certificate warnings</a>, such as for sites with self-signed certificates or certificates that aren’t issued by a trusted authority. This is a problem the site developer needs to resolve.\n</p>\n<h1 id=\"w_padlock-with-a-red-strike-over-it\">Padlock with a red strike over it</h1>\n<p>A padlock with a red strike over it <img alt=\"Fx89Padlock-RedLine\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-53-30-fe088c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> indicates that the connection between Firefox and the website is either delivered using an insecure protocol (HTTP) or that it is only partially encrypted because you've manually deactivated <a href=\"/en-US/kb/mixed-content-blocking-firefox\">mixed content blocking</a>. The site doesn't prevent against eavesdropping or <a href=\"http://en.wikipedia.org/wiki/Man-in-the-middle_attack\">man-in-the-middle attacks</a>.\n</p>\n<div class=\"note\">Do not send any sensitive information to sites where the Site Identity button is a padlock with a red strike over it.</div>",
  "text": "When you visit a website, the Site Identity button (a padlock) appears in the address bar to the left of the web address. You can quickly find out if the connection to the website you are viewing is encrypted, and in some cases who owns the website. This should help you avoid malicious websites that are trying to obtain your personal information. When viewing a secure website, the Site Identity button will be a padlock . In a few cases, however, you may see a padlock with a warning triangle or a padlock with a red strike over it . Clicking the padlock to the left of the address bar brings up the Site Information panel , which allows you to view more detailed information about the security status of the connection. Table of Contents 1 Padlock 2 Padlock with a warning triangle 3 Padlock with a red strike over it Warning: You should never send any sensitive information (such as bank information, credit card data or social security numbers) to a website if the address bar shows a padlock with a warning triangle or red strike over it. In such cases, you may not be communicating with the intended website and your data isn't safe against eavesdropping! Padlock A padlock with no warning triangle or red strike over it indicates that: You’re definitely connected to the website whose address is shown in the address bar and the connection hasn’t been intercepted. The connection between Firefox and the website is encrypted to prevent eavesdropping. Click the padlock to find out if the website is using an Extended Validation (EV) certificate . An EV certificate is a special type of site certificate that requires a significantly more rigorous identity verification process than other types of certificates. For sites using EV certificates, the legal company or organization name and location of the website owner displays when you click the padlock. Padlock with a warning triangle A padlock with a warning triangle indicates that the connection between Firefox and the website is only partially encrypted and doesn't prevent eavesdropping. By default, Firefox does not block insecure passive content such as images; you will simply see a warning that the page isn't fully secure. For more information, see Mixed content blocking in Firefox . Do not send any sensitive information to sites where the Site Identity button is a padlock with a warning triangle. A padlock with a warning triangle also appears for website certificate warnings , such as for sites with self-signed certificates or certificates that aren’t issued by a trusted authority. This is a problem the site developer needs to resolve. Padlock with a red strike over it A padlock with a red strike over it indicates that the connection between Firefox and the website is either delivered using an insecure protocol (HTTP) or that it is only partially encrypted because you've manually deactivated mixed content blocking . The site doesn't prevent against eavesdropping or man-in-the-middle attacks . Do not send any sensitive information to sites where the Site Identity button is a padlock with a red strike over it.",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6749,
    "text_bytes": 3097,
    "word_count": 518,
    "downloaded_at": "2025-08-26T09:04:13.083631"
  }
}