{
  "slug": "how-run-firefox-when-profile-missing-inaccessible",
  "title": "How to run Firefox when your profile is missing or inaccessible",
  "summary": "How to fix the error ''Your Firefox profile cannot be loaded. It may be missing or inaccessible''  so that you can start and run Firefox.",
  "url": "https://support.mozilla.org/en-US/kb/how-run-firefox-when-profile-missing-inaccessible",
  "html": "<p>If you see a \"Profile Missing\" error message that says, <em>Your Firefox profile cannot be loaded. It may be missing or inaccessible</em> it  usually means that Firefox can't find or access the profile folder. This article explains what to do if you see this error.\n</p>\n<dl><dt><img alt=\"FXprofile-cannot-be-loaded\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2014-11-09-15-46-58-4ec2f0.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div class=\"for\" data-for=\"win7,win8\"><p> \n</p>\n<div class=\"note\"><strong>Note:</strong> If you see a \"Profile Missing\" error after clicking the \"Close Firefox\" button in the \"Firefox is already running but is not responding\" error dialog, click <span class=\"button\">OK</span> in the \"Profile Missing\" window and wait a few seconds before trying to start Firefox.  Alternatively, either restart the computer or use the Windows Task Manager to end all Firefox processes, then try starting Firefox. For more information, see the article <a href=\"/en-US/kb/firefox-already-running-not-responding\">\"Firefox is already running but is not responding\" error - How to fix</a>.</div>\n</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_if-you-moved-renamed-or-deleted-your-firefox-profile-folder\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">If you moved, renamed, or deleted your Firefox profile folder</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_profile-was-moved-or-renamed\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Profile was moved or renamed</span></a></li><li class=\"toclevel-2\"><a href=\"#w_profile-was-deleted\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Profile was deleted</span></a></li></ul></li></ul></div>\n<h1 id=\"w_if-you-moved-renamed-or-deleted-your-firefox-profile-folder\">If you moved, renamed, or deleted your Firefox profile folder</h1>\n<p>Firefox stores your user data and settings in a special <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile</a> folder and pulls information from this folder every time you start Firefox.  The default profile folder location is under the <span class=\"for\" data-for=\"win\"><span class=\"filepath\">%APPDATA%\\Mozilla\\Firefox\\Profiles</span> </span><span class=\"for\" data-for=\"linux\"><span class=\"filepath\">~/.mozilla/firefox</span></span><span class=\"for\" data-for=\"mac\"> <span class=\"filepath\">~/Library/Application Support/Firefox/Profiles</span></span> folder, which you can find using <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data#w_finding-your-profile-without-opening-firefox\">these instructions</a>. \n</p>\n<h2 id=\"w_profile-was-moved-or-renamed\">Profile was moved or renamed</h2>\n<p>If you know where your profile is, try one of the following methods to help Firefox find it.\n</p>\n<ul><li>Move the profile folder back to its original location. \n</li><li>Restore the profile's original name if you've changed it.\n</li><li><a href=\"/en-US/kb/profile-manager-create-remove-switch-firefox-profiles\">Create a new profile using the Profile Manager</a> using the instructions to start the Profile Manager when Firefox is closed. Give it a descriptive name, click on the <span class=\"button\">Choose Folder</span> button, and then select the profile folder you moved or renamed, before you finish the <em>Create a new profile</em> wizard.\n</li></ul>\n<h2 id=\"w_profile-was-deleted\">Profile was deleted</h2>\n<p>If you deleted or lost your profile folder and have no way of restoring it, use one of these methods to create a new Firefox profile:\n</p>\n<div class=\"note\">Your new profile will not contain settings or user data from your deleted or lost profile.</div>\n<ul><li> <strong>Method 1: Use the Profile Manager wizard</strong> \n</li></ul>\n<p>Follow the steps in the <a href=\"/en-US/kb/profile-manager-create-remove-switch-firefox-profiles\">Profile Manager - Create, remove or switch Firefox profiles</a> article to create a new profile.\n</p>\n<ul><li> <strong>Method 2: Manually delete the <em>profiles.ini</em> file</strong> \n</li></ul>\n<p>If you have problems accessing the Profile Manager, you can create a new default Firefox profile by deleting the <span class=\"filepath\">profiles.ini</span> file, using these steps:\n</p><div class=\"for\" data-for=\"win\"><div class=\"for\" data-for=\"winxp\">\n<ol><li> Click on the Windows <span class=\"button\">Start</span> button and click on <span class=\"menu\">Run...</span>\n</li><li> Type <strong>%appdata%</strong> in the Run box and click OK. The hidden <span class=\"filepath\">Application Data</span> folder will open. \n</li><li> Double-click the <span class=\"filepath\">Mozilla</span> folder.\n</li><li> Double-click the <span class=\"filepath\">Firefox</span> folder.\n</li><li> Delete (or rename, for example, to profiles.iniOLD) the <span class=\"filepath\">profiles.ini</span> file.\n</li></ol>\n</div><div class=\"for\" data-for=\"win7\">\n<ol><li> Click the Windows Start button or press the Windows key <span class=\"key\"><img alt=\"Windows Key\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2011-09-20-08-33-13-ff63c4.jpg\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span> to open the Start Menu. \n</li><li> Type <strong>%appdata%</strong> in the search box and press the <span class=\"key\">Enter</span> key. The hidden <span class=\"filepath\">AppData\\Roaming</span> folder will open. \n</li><li> Double-click the <span class=\"filepath\">Mozilla</span> folder.\n</li><li> Double-click the <span class=\"filepath\">Firefox</span> folder.\n</li><li> Delete (or rename, for example, to profiles.iniOLD) the <span class=\"filepath\">profiles.ini</span> file.\n</li></ol>\n</div><div class=\"for\" data-for=\"win8\">\n<ol><li> From the Windows Start Screen, click the <strong>Desktop</strong> tile. The Desktop view will open.\n</li><li> From the Desktop, hover in the lower right-hand corner to access the Charms.\n</li><li> Select the <span class=\"menu\">Search</span> charm. The Search sidebar will open.\n</li><li> Type <strong>%appdata%</strong> in the search box and press the <span class=\"key\">Enter</span> key. The hidden <span class=\"filepath\">AppData\\Roaming</span> folder will open.\n</li><li> Double-click the <span class=\"filepath\">Mozilla</span> folder.\n</li><li> Double-click the <span class=\"filepath\">Firefox</span> folder.\n</li><li> Delete (or rename, for example, to profiles.iniOLD) the <span class=\"filepath\">profiles.ini</span>  file.\n</li></ol>\n</div><div class=\"for\" data-for=\"win10,win11\">\n<ol><li> Click on the Windows Start button or press the Windows key <span class=\"key\"><img alt=\"Windows Key\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2011-09-20-08-33-13-ff63c4.jpg\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span> to open the Start Menu.\n</li><li> Type <strong>%appdata%</strong> (as you type, a Windows search will start) and press the <span class=\"key\">Enter</span> key. The hidden <span class=\"filepath\">AppData\\Roaming</span> folder will open.\n</li><li> Double-click the <span class=\"filepath\">Mozilla</span> folder.\n</li><li> Double-click the <span class=\"filepath\">Firefox</span> folder.\n</li><li> Delete (or rename, for example, to profiles.iniOLD) the <span class=\"filepath\">profiles.ini</span>  file.\n</li></ol>\n</div>\n<div class=\"note\"><strong>Note:</strong> By default, Windows does not show the .ini file extension. The file should have an icon similar to a document with a gear on it, and a file type similar to  \"Configuration settings\" or \"Application settings\". You should not delete the Profiles folder, which should have a file folder icon and a file type of \"File folder\".</div>\n<div class=\"note\"><strong>Note:</strong> Instead of deleting the profiles.ini file, you can delete (or rename) the folder that contains it. For example, right-click the Firefox folder and rename it FirefoxOLD.</div>\n<p>When you start Firefox, a new profile will be created.\n</p></div><div class=\"for\" data-for=\"linux\">\n<ol><li> <strong>(Ubuntu)</strong> Click the <span class=\"menu\">Places</span> menu on the top right of the screen and select <span class=\"menu\">Home Folder</span>. A File Browser window will appear.\n</li><li> Click the <span class=\"menu\">View</span> menu and select <span class=\"menu\">Show Hidden Files</span> if it isn't already checked.\n</li><li> Double click the folder marked <span class=\"filepath\">.mozilla</span>.\n</li><li> Double click the folder marked <span class=\"filepath\">firefox</span>. \n</li><li> Delete (or rename, for example, to profiles.iniOLD) the <span class=\"filepath\">profiles.ini</span> file.\n</li></ol>\n<div class=\"note\"><strong>Note:</strong> Instead of deleting the profiles.ini file, you can delete (or rename) the folder that contains it. For example, rename the firefox folder to firefoxOLD.</div>\n<p>When you start Firefox, a new profile will be created.\n</p></div><div class=\"for\" data-for=\"mac\">\n<ol><li> Navigate to your user  <em>~/Library</em> folder:\n<ul><li> <strong>(OS X 10.6)</strong> Click the <strong>Finder</strong> icon in the dock. Your home folder will be selected, (usually the name of your Mac user account). In the right side of the window, click the Library folder to open it. \n</li><li> <strong>(OS X 10.7 and above)</strong> Click the <strong>Finder</strong> icon in the dock. On the menu bar, click the <span class=\"menu\">Go</span> menu, hold down the <span class=\"key\">option</span> or <span class=\"key\">alt</span> key and select <span class=\"menu\">Library</span>. A window will open containing your Library folder. \n</li></ul>\n</li><li> Click on the <span class=\"filepath\">Application Support</span> folder, then go to the <span class=\"filepath\">Firefox</span> folder.\n</li><li> Delete (or rename, for example, to profiles.iniOLD) the <span class=\"filepath\">profiles.ini</span> file.\n</li></ol>\n<div class=\"note\"><strong>Note:</strong> Instead of deleting the profiles.ini file, you can delete (or rename) the folder that contains it. For example, rename the Firefox folder to FirefoxOLD.</div>\n<p>When you start Firefox, a new profile will be created.\n</p></div><p>\n</p><p><br> <br>\n<em><strong>Based on information from <a href=\"http://kb.mozillazine.org/Profile_cannot_be_loaded\">Profile cannot be loaded (mozillaZine KB)</a></strong></em>\n</p>",
  "text": "If you see a \"Profile Missing\" error message that says, Your Firefox profile cannot be loaded. It may be missing or inaccessible it usually means that Firefox can't find or access the profile folder. This article explains what to do if you see this error. Note: If you see a \"Profile Missing\" error after clicking the \"Close Firefox\" button in the \"Firefox is already running but is not responding\" error dialog, click OK in the \"Profile Missing\" window and wait a few seconds before trying to start Firefox. Alternatively, either restart the computer or use the Windows Task Manager to end all Firefox processes, then try starting Firefox. For more information, see the article \"Firefox is already running but is not responding\" error - How to fix . Table of Contents 1 If you moved, renamed, or deleted your Firefox profile folder 1.1 Profile was moved or renamed 1.2 Profile was deleted If you moved, renamed, or deleted your Firefox profile folder Firefox stores your user data and settings in a special profile folder and pulls information from this folder every time you start Firefox. The default profile folder location is under the %APPDATA%\\Mozilla\\Firefox\\Profiles ~/.mozilla/firefox ~/Library/Application Support/Firefox/Profiles folder, which you can find using these instructions . Profile was moved or renamed If you know where your profile is, try one of the following methods to help Firefox find it. Move the profile folder back to its original location. Restore the profile's original name if you've changed it. Create a new profile using the Profile Manager using the instructions to start the Profile Manager when Firefox is closed. Give it a descriptive name, click on the Choose Folder button, and then select the profile folder you moved or renamed, before you finish the Create a new profile wizard. Profile was deleted If you deleted or lost your profile folder and have no way of restoring it, use one of these methods to create a new Firefox profile: Your new profile will not contain settings or user data from your deleted or lost profile. Method 1: Use the Profile Manager wizard Follow the steps in the Profile Manager - Create, remove or switch Firefox profiles article to create a new profile. Method 2: Manually delete the profiles.ini file If you have problems accessing the Profile Manager, you can create a new default Firefox profile by deleting the profiles.ini file, using these steps: Click on the Windows Start button and click on Run... Type %appdata% in the Run box and click OK. The hidden Application Data folder will open. Double-click the Mozilla folder. Double-click the Firefox folder. Delete (or rename, for example, to profiles.iniOLD) the profiles.ini file. Click the Windows Start button or press the Windows key to open the Start Menu. Type %appdata% in the search box and press the Enter key. The hidden AppData\\Roaming folder will open. Double-click the Mozilla folder. Double-click the Firefox folder. Delete (or rename, for example, to profiles.iniOLD) the profiles.ini file. From the Windows Start Screen, click the Desktop tile. The Desktop view will open. From the Desktop, hover in the lower right-hand corner to access the Charms. Select the Search charm. The Search sidebar will open. Type %appdata% in the search box and press the Enter key. The hidden AppData\\Roaming folder will open. Double-click the Mozilla folder. Double-click the Firefox folder. Delete (or rename, for example, to profiles.iniOLD) the profiles.ini file. Click on the Windows Start button or press the Windows key to open the Start Menu. Type %appdata% (as you type, a Windows search will start) and press the Enter key. The hidden AppData\\Roaming folder will open. Double-click the Mozilla folder. Double-click the Firefox folder. Delete (or rename, for example, to profiles.iniOLD) the profiles.ini file. Note: By default, Windows does not show the .ini file extension. The file should have an icon similar to a document with a gear on it, and a file type similar to \"Configuration settings\" or \"Application settings\". You should not delete the Profiles folder, which should have a file folder icon and a file type of \"File folder\". Note: Instead of deleting the profiles.ini file, you can delete (or rename) the folder that contains it. For example, right-click the Firefox folder and rename it FirefoxOLD. When you start Firefox, a new profile will be created. (Ubuntu) Click the Places menu on the top right of the screen and select Home Folder . A File Browser window will appear. Click the View menu and select Show Hidden Files if it isn't already checked. Double click the folder marked .mozilla . Double click the folder marked firefox . Delete (or rename, for example, to profiles.iniOLD) the profiles.ini file. Note: Instead of deleting the profiles.ini file, you can delete (or rename) the folder that contains it. For example, rename the firefox folder to firefoxOLD. When you start Firefox, a new profile will be created. Navigate to your user ~/Library folder: (OS X 10.6) Click the Finder icon in the dock. Your home folder will be selected, (usually the name of your Mac user account). In the right side of the window, click the Library folder to open it. (OS X 10.7 and above) Click the Finder icon in the dock. On the menu bar, click the Go menu, hold down the option or alt key and select Library . A window will open containing your Library folder. Click on the Application Support folder, then go to the Firefox folder. Delete (or rename, for example, to profiles.iniOLD) the profiles.ini file. Note: Instead of deleting the profiles.ini file, you can delete (or rename) the folder that contains it. For example, rename the Firefox folder to FirefoxOLD. When you start Firefox, a new profile will be created. Based on information from Profile cannot be loaded (mozillaZine KB)",
  "products": [
    "firefox"
  ],
  "topics": [
    "accounts",
    "performance-and-connectivity",
    "profiles"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 10632,
    "text_bytes": 5839,
    "word_count": 961,
    "downloaded_at": "2025-08-26T11:04:02.083465"
  }
}