{
  "slug": "how-reset-your-password-without-account-recovery-keys-access-data",
  "title": "How to reset your password without Account Recovery Keys and regain access to your data",
  "summary": "You can reset your Mozilla account password and restore the data stored on your computer, even if you don't have recovery keys. Learn how.",
  "url": "https://support.mozilla.org/en-US/kb/how-reset-your-password-without-account-recovery-keys-access-data",
  "html": "<p>\n</p>\n<div class=\"warning\"><strong>This article may include outdated content. Please see <a href=\"/en-US/kb/how-change-or-reset-your-mozilla-account-password\">How to change or reset your Mozilla account password</a> for current information and instructions.</strong></div>\n<p>Recovery keys, if enabled, are unique codes generated by Firefox that help you regain access to your account and encrypted data when you forget your password or lose access to your device. Firefox stores a local profile with your data on your computer, which protects it during a password reset. With the local copy of your data, you can easily reset your password and restore your data, even if you don't have recovery keys. This article explains the steps you need to follow.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-is-the-difference-between-locally-stored-data-and-synced-data\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What is the difference between locally stored data and synced data?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_locally-stored-data\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Locally stored data</span></a></li><li class=\"toclevel-2\"><a href=\"#w_synced-data\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Synced data</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_how-to-reset-your-password-without-recovery-keys\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How to reset your password without recovery keys</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_to-reset-your-password\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">To reset your password</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_related-content\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Related content</span></a></li></ul></div>\n<h1 id=\"w_what-is-the-difference-between-locally-stored-data-and-synced-data\">What is the difference between locally stored data and synced data?</h1>\n<h2 id=\"w_locally-stored-data\">Locally stored data</h2>\n<p>A local <a href=\"/en-US/kb/profile-manager-create-remove-switch-firefox-profiles\">profile</a> is like a personal storage space on your computer where Firefox saves your information. This includes browsing history, cookies, passwords, credit card details, settings, bookmarks, add-ons and open tabs. Regardless of having a Mozilla account or enabling Sync, as long as you're using the same computer/device and haven't wiped or formatted it, this data will be available to you.\n</p>\n<h2 id=\"w_synced-data\">Synced data</h2>\n<p>When you sync your data with your Mozilla account, your data gets uploaded to Sync servers, based on your settings. This stored data is encrypted for security reasons and can be used to sync and populate other connected devices, allowing you to have the same information on both your mobile and desktop devices.\n</p>\n<h1 id=\"w_how-to-reset-your-password-without-recovery-keys\">How to reset your password without recovery keys</h1>\n<div class=\"warning\">\n<p><strong>Warning:</strong> To perform this password recovery without recovery keys, it is important to reset the Mozilla account from the same device where you last logged in to your Mozilla account and backed up your data. This allows Firefox to retrieve your data from your local profile on that device, which is necessary for the recovery process.\n</p><p>If you're resetting from a new device, you'll need access to the device where you logged in and synced your data the last time.\n</p>\n</div>\n<h2 id=\"w_to-reset-your-password\">To reset your password</h2>\n<ol><li>Click the menu <img alt=\"PhotonMenuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2017-09-28-11-58-03-e6a66b.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and click <span class=\"button\">Sign In</span> next to <em>Sync and save data</em>.\n</li><li>On the <em>Sign in</em> page, click <strong>Forgot password?</strong> link. Firefox will send you a reset email.\n</li><li>Follow the instructions in your reset email to change your password.\n</li><li>After signing in with your new password, remember to update your password on each of your synced devices.\n</li></ol>\n<p>Alternatively, you can click the <strong>Forgot password?</strong> link on any Mozilla account sign-in page and follow the prompts to reset your password. This will reset your Mozilla account.\n</p>\n<h1 id=\"w_related-content\">Related content</h1>\n<ul><li><a href=\"/en-US/kb/ive-lost-my-firefox-sync-account-information\">I've lost my Firefox Sync account information - What to do</a>\n</li></ul>",
  "text": "This article may include outdated content. Please see How to change or reset your Mozilla account password for current information and instructions. Recovery keys, if enabled, are unique codes generated by Firefox that help you regain access to your account and encrypted data when you forget your password or lose access to your device. Firefox stores a local profile with your data on your computer, which protects it during a password reset. With the local copy of your data, you can easily reset your password and restore your data, even if you don't have recovery keys. This article explains the steps you need to follow. Table of Contents 1 What is the difference between locally stored data and synced data? 1.1 Locally stored data 1.2 Synced data 2 How to reset your password without recovery keys 2.1 To reset your password 3 Related content What is the difference between locally stored data and synced data? Locally stored data A local profile is like a personal storage space on your computer where Firefox saves your information. This includes browsing history, cookies, passwords, credit card details, settings, bookmarks, add-ons and open tabs. Regardless of having a Mozilla account or enabling Sync, as long as you're using the same computer/device and haven't wiped or formatted it, this data will be available to you. Synced data When you sync your data with your Mozilla account, your data gets uploaded to Sync servers, based on your settings. This stored data is encrypted for security reasons and can be used to sync and populate other connected devices, allowing you to have the same information on both your mobile and desktop devices. How to reset your password without recovery keys Warning: To perform this password recovery without recovery keys, it is important to reset the Mozilla account from the same device where you last logged in to your Mozilla account and backed up your data. This allows Firefox to retrieve your data from your local profile on that device, which is necessary for the recovery process. If you're resetting from a new device, you'll need access to the device where you logged in and synced your data the last time. To reset your password Click the menu and click Sign In next to Sync and save data . On the Sign in page, click Forgot password? link. Firefox will send you a reset email. Follow the instructions in your reset email to change your password. After signing in with your new password, remember to update your password on each of your synced devices. Alternatively, you can click the Forgot password? link on any Mozilla account sign-in page and follow the prompts to reset your password. This will reset your Mozilla account. Related content I've lost my Firefox Sync account information - What to do",
  "products": [
    "firefox",
    "mozilla-account"
  ],
  "topics": [
    "passwords-and-sign-in",
    "reset-passwords"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4733,
    "text_bytes": 2768,
    "word_count": 467,
    "downloaded_at": "2025-08-26T10:56:12.043675"
  }
}