{
  "slug": "how-review-checker-preserves-user-privacy",
  "title": "How Review Checker preserves user privacy",
  "summary": "Learn how Review Checker uses OHTTP to securely send product info to Fakespot, ensuring no personal data or browsing details are shared.",
  "url": "https://support.mozilla.org/en-US/kb/how-review-checker-preserves-user-privacy",
  "html": "<div class=\"warning\"><strong>Important Update:</strong> The Review Checker feature is shutting down and will no longer be available after June 10, 2025.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_when-does-review-checker-send-information-to-fakespot\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">When does Review Checker send information to Fakespot?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-does-ohttp-provide-privacy-guarantees\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How does OHTTP provide privacy guarantees?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-about-the-recommended-product-in-review-checker\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">What about the “Recommended Product” in Review Checker?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-about-firefoxs-telemetry-in-review-checker\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">What about Firefox’s Telemetry in Review Checker?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-about-private-browsing\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">What about private browsing?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<h1 id=\"w_when-does-review-checker-send-information-to-fakespot\">When does Review Checker send information to Fakespot?</h1>\n<p>If you opt in to using Fakespot when the feature is offered, Review Checker will ask Fakespot for information about products you view. It determines this only from the URL and the product identifier there; it doesn’t look at page contents. It does so using <a href=\"https://blog.mozilla.org/en/products/firefox/partnership-ohttp-prio/\">Oblivious HTTP (OHTTP)</a>. Your identity, IP address or any other information besides the product identifier and website domain, is not included in or revealed by this request, to either Fakespot or Mozilla.\n</p>\n<h1 id=\"w_how-does-ohttp-provide-privacy-guarantees\">How does OHTTP provide privacy guarantees?</h1>\n<p>OHTTP encrypts the information it sends (website and product ID) and receives (the Fakespot product analysis), and sends it through a proxy, operated by a third party. The third party can see your IP address, but none of the information inside the encrypted request. Mozilla and Fakespot receive the contents of the request from the proxy and can decrypt it, but cannot see the IP address or any other information about who made the request.\n</p>\n<h1 id=\"w_what-about-the-recommended-product-in-review-checker\">What about the “Recommended Product” in Review Checker?</h1>\n<p>Deciding which recommended product is shown is based on the same information as the analysis Review Checker provides (the product you’re looking at and the website where it is sold, such as Amazon, Best Buy or Walmart). This information is also sent through OHTTP. The request does not contain any other information, so it is not tied to you or your IP address.\n</p><p>Review Checker also informs Fakespot if it decides to show you the recommended product that Fakespot provided, whether it was visible to you for some time, and if you clicked on the recommended product. When it does so, the only information sent is an identifier of the recommended product – no information related to you, your IP address or other personal data is included. All these requests are anonymized using OHTTP as well.\n</p>\n<h1 id=\"w_what-about-firefoxs-telemetry-in-review-checker\">What about Firefox’s Telemetry in Review Checker?</h1>\n<p>Firefox’s own use of telemetry is subject to the usual <a href=\"/en-US/kb/technical-and-interaction-data\">user controls</a>. Review Checker uses telemetry to help Mozilla understand if Review Checker is useful to you. None of Review Checker’s telemetry usage includes product identifiers, URLs or domain names, so Mozilla does not know what products you look at.\n</p>\n<h1 id=\"w_what-about-private-browsing\">What about private browsing?</h1>\n<p>Review Checker is not available in <a href=\"/en-US/kb/private-browsing-use-firefox-without-history\">private browsing</a>.\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/review-checker-review-quality\">Shop online with more confidence using Firefox Review Checker</a> \n</li><li><a href=\"/en-US/kb/firefox-suggest-fakespot\">Fakespot results in Firefox Suggest</a>\n</li></ul>",
  "text": "Important Update: The Review Checker feature is shutting down and will no longer be available after June 10, 2025. Table of Contents 1 When does Review Checker send information to Fakespot? 2 How does OHTTP provide privacy guarantees? 3 What about the “Recommended Product” in Review Checker? 4 What about Firefox’s Telemetry in Review Checker? 5 What about private browsing? 6 Related articles When does Review Checker send information to Fakespot? If you opt in to using Fakespot when the feature is offered, Review Checker will ask Fakespot for information about products you view. It determines this only from the URL and the product identifier there; it doesn’t look at page contents. It does so using Oblivious HTTP (OHTTP) . Your identity, IP address or any other information besides the product identifier and website domain, is not included in or revealed by this request, to either Fakespot or Mozilla. How does OHTTP provide privacy guarantees? OHTTP encrypts the information it sends (website and product ID) and receives (the Fakespot product analysis), and sends it through a proxy, operated by a third party. The third party can see your IP address, but none of the information inside the encrypted request. Mozilla and Fakespot receive the contents of the request from the proxy and can decrypt it, but cannot see the IP address or any other information about who made the request. What about the “Recommended Product” in Review Checker? Deciding which recommended product is shown is based on the same information as the analysis Review Checker provides (the product you’re looking at and the website where it is sold, such as Amazon, Best Buy or Walmart). This information is also sent through OHTTP. The request does not contain any other information, so it is not tied to you or your IP address. Review Checker also informs Fakespot if it decides to show you the recommended product that Fakespot provided, whether it was visible to you for some time, and if you clicked on the recommended product. When it does so, the only information sent is an identifier of the recommended product – no information related to you, your IP address or other personal data is included. All these requests are anonymized using OHTTP as well. What about Firefox’s Telemetry in Review Checker? Firefox’s own use of telemetry is subject to the usual user controls . Review Checker uses telemetry to help Mozilla understand if Review Checker is useful to you. None of Review Checker’s telemetry usage includes product identifiers, URLs or domain names, so Mozilla does not know what products you look at. What about private browsing? Review Checker is not available in private browsing . Related articles Shop online with more confidence using Firefox Review Checker Fakespot results in Firefox Suggest",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse",
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4471,
    "text_bytes": 2802,
    "word_count": 461,
    "downloaded_at": "2025-08-26T10:57:11.281653"
  }
}