{
  "slug": "how-do-i-know-status-my-sync",
  "title": "How do I know the status of my sync?",
  "summary": "The Mozilla account toolbar icon tells you when you are signed in and syncing Firefox data. You can personalize it with your own avatar.",
  "url": "https://support.mozilla.org/en-US/kb/how-do-i-know-status-my-sync",
  "html": "<div class=\"for\" data-for=\"not fx79\">\n<div class=\"warning\">\n<p><strong>Action required: Update Firefox to maintain account sync post-March 31, 2024.</strong>\n</p><p>If you are running <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">a version of Firefox</a> <strong>equal to or older than Firefox 78</strong> (general release or <a href=\"/en-US/kb/firefox-esr-release-cycle\">ESR</a>) and you have a <a href=\"/en-US/kb/firefox-accounts-managing-account-data\">Mozilla account</a>, you <strong>must</strong> follow these steps to ensure continued operation of your account in Firefox:\n</p>\n<ol><li>Make sure you remember your password for your account on Firefox. If you do not have your password, you can use your <a href=\"/en-US/kb/reset-your-firefox-account-password-recovery-keys\">account recovery keys</a> to change your password. If you do not already have account recovery keys, you will need to <a href=\"/en-US/kb/how-reset-your-password-without-account-recovery-keys-access-data\">reset your password without recovery keys</a>.\n</li><li><a href=\"/en-US/kb/back-and-restore-information-firefox-profiles\">Backup your profile folder</a>, just in case anything goes wrong.\n</li><li><a href=\"/en-US/kb/update-firefox-latest-release\">Update</a> your Firefox browser.\n<dl><dt>If you get an error when trying to update, you can reinstall <a href=\"https://www.mozilla.org/firefox/new\">Firefox</a>.\n</dt></dl>\n</li><li>Sign back in to your account in the newly-updated Firefox.\n</li></ol>\n</div>\n</div><p>The Mozilla account toolbar menu icon lets you know when you are signed in and syncing Firefox data across devices.\n</p>\n<div class=\"note\"><strong>Note:</strong> The icon you see when signed in <img alt=\"FxA Icon signed in\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2020-01-06-08-46-22-286b44.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> can be personalized with your own avatar.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_how-do-i-know-my-firefox-sync-status\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">How do I know my Firefox Sync status?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_waiting-for-email-verification\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Waiting for email verification</span></a></li><li class=\"toclevel-2\"><a href=\"#w_signed-out-not-syncing\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Signed out (not syncing)</span></a></li><li class=\"toclevel-2\"><a href=\"#w_signed-in\"><span class=\"tocnumber\">1.3</span> <span class=\"toctext\">Signed in</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-personalize-the-toolbar-icon-with-profile-image\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How do I personalize the toolbar icon with profile image?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_why-am-i-signed-in-to-my-mozilla-account-in-private-browsing\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Why am I signed in to my Mozilla account in Private Browsing?</span></a></li></ul></div>\n<h1 id=\"w_how-do-i-know-my-firefox-sync-status\">How do I know my Firefox Sync status?</h1>\n<p>The toolbar menu lets you know your Mozilla account and Sync status:\n</p>\n<h2 id=\"w_waiting-for-email-verification\">Waiting for email verification</h2>\n<p><img alt=\"Fxa89waiting for email\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-18-16-08-35-4ffa2e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> \n</p><p>If a blue dot appears in your account icon, a verification email has been sent but you haven't verified your account yet.\n</p>\n<h2 id=\"w_signed-out-not-syncing\">Signed out (not syncing)</h2>\n<p>If the account icon is missing, you are not signed in to your Mozilla account and your information is not syncing. To sign in to Sync, click the menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button and click <span class=\"button\">Sign In</span> next to <span class=\"menu\">Sync and save data</span>.\n</p>\n<div class=\"note\">\n<p><strong>Tip:</strong> you can also sign in from the Sync panel in Firefox settings:\n<span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n Select <span class=\"menu\">Sync</span> on the left and click <span class=\"menu\">Sign in to sync…</span>\n</p>\n</div>\n<h2 id=\"w_signed-in\">Signed in</h2>\n<p>If the first letter of your username appears in the icon, or, if you see your personalized toolbar icon, you are signed in to your Mozilla account. Click the account icon to learn your Sync status. When Sync is enabled, you will see a <span class=\"menu\">Sync now</span> menu item; Firefox will start syncing when you click it.\n</p><p>If Firefox is not currently syncing your information, <a href=\"/en-US/kb/disable-firefox-sync\">Sync is disabled</a> and you will see a <span class=\"menu\">Turn On Syncing…</span> menu item; click it to open the Sync settings panel, where you can turn on syncing and <a href=\"/en-US/kb/how-do-i-choose-what-information-sync-firefox\">choose what to sync</a>. \n</p>\n<h1 id=\"w_how-do-i-personalize-the-toolbar-icon-with-profile-image\">How do I personalize the toolbar icon with profile image?</h1>\n<ol><li>Click the menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button, then click your Mozilla account profile name.\n<dl><dt>(You will need to sign in to your Mozilla account, if you are signed out.)\n</dt></dl>\n</li><li>Click <span class=\"menu\">Manage Account</span>.\n</li><li>In the Mozilla account page that opens, click the <span class=\"button\">Add…</span> button next to <em>Picture</em>.\n</li></ol>\n<h1 id=\"w_why-am-i-signed-in-to-my-mozilla-account-in-private-browsing\">Why am I signed in to my Mozilla account in Private Browsing?</h1>\n<p>If you open a private window while signed in to your Mozilla account, you will stay signed in on the private window so you can continue managing bookmarks, access your synced passwords and save new passwords while in <a href=\"/en-US/kb/private-browsing-use-firefox-without-history\">Private Browsing</a>.\n</p><p>Since your history is not recorded in Private Browsing, your Mozilla account will not pick up or sync your browsing history.\n</p>",
  "text": "Action required: Update Firefox to maintain account sync post-March 31, 2024. If you are running a version of Firefox equal to or older than Firefox 78 (general release or ESR ) and you have a Mozilla account , you must follow these steps to ensure continued operation of your account in Firefox: Make sure you remember your password for your account on Firefox. If you do not have your password, you can use your account recovery keys to change your password. If you do not already have account recovery keys, you will need to reset your password without recovery keys . Backup your profile folder , just in case anything goes wrong. Update your Firefox browser. If you get an error when trying to update, you can reinstall Firefox . Sign back in to your account in the newly-updated Firefox. The Mozilla account toolbar menu icon lets you know when you are signed in and syncing Firefox data across devices. Note: The icon you see when signed in can be personalized with your own avatar. Table of Contents 1 How do I know my Firefox Sync status? 1.1 Waiting for email verification 1.2 Signed out (not syncing) 1.3 Signed in 2 How do I personalize the toolbar icon with profile image? 3 Why am I signed in to my Mozilla account in Private Browsing? How do I know my Firefox Sync status? The toolbar menu lets you know your Mozilla account and Sync status: Waiting for email verification If a blue dot appears in your account icon, a verification email has been sent but you haven't verified your account yet. Signed out (not syncing) If the account icon is missing, you are not signed in to your Mozilla account and your information is not syncing. To sign in to Sync, click the menu button and click Sign In next to Sync and save data . Tip: you can also sign in from the Sync panel in Firefox settings: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select Sync on the left and click Sign in to sync… Signed in If the first letter of your username appears in the icon, or, if you see your personalized toolbar icon, you are signed in to your Mozilla account. Click the account icon to learn your Sync status. When Sync is enabled, you will see a Sync now menu item; Firefox will start syncing when you click it. If Firefox is not currently syncing your information, Sync is disabled and you will see a Turn On Syncing… menu item; click it to open the Sync settings panel, where you can turn on syncing and choose what to sync . How do I personalize the toolbar icon with profile image? Click the menu button, then click your Mozilla account profile name. (You will need to sign in to your Mozilla account, if you are signed out.) Click Manage Account . In the Mozilla account page that opens, click the Add… button next to Picture . Why am I signed in to my Mozilla account in Private Browsing? If you open a private window while signed in to your Mozilla account, you will stay signed in on the private window so you can continue managing bookmarks, access your synced passwords and save new passwords while in Private Browsing . Since your history is not recorded in Private Browsing, your Mozilla account will not pick up or sync your browsing history.",
  "products": [
    "firefox",
    "mozilla-account"
  ],
  "topics": [
    "privacy-and-security",
    "sync-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 7534,
    "text_bytes": 3286,
    "word_count": 599,
    "downloaded_at": "2025-08-26T10:47:24.817264"
  }
}