{
  "slug": "how-generate-secure-password-firefox",
  "title": "Generate a secure password in Firefox",
  "summary": "Learn how Firefox can create a secure password for you when creating a new online account.",
  "url": "https://support.mozilla.org/en-US/kb/how-generate-secure-password-firefox",
  "html": "<p>When creating a new account on a website, it can be difficult to think of a unique and secure password. When signing up for a new account on a website, Firefox can generate a secure password for you.\n</p>\n<h1 id=\"w_generate-a-new-password\">Generate a new password</h1>\n<p>Firefox can automatically generate random, secure passwords for you when you're creating an account:\n</p>\n<ol><li>Click the password field on a website. The secure password option will automatically display.\n</li><li>Click <strong>Use a Securely Generated Password</strong> to fill in the field. Firefox will also save your new login for that site.\n<dl><dt><img alt=\"Use a securely generated password\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-12-27-10-39-53-fafe2d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"350\"> \n</dt></dl>\n<ul><li>If the generated password does not meet the website requirements, clicking on the password field will reveal (unmask) the password, so you can edit it to meet the requirements.\n</li></ul>\n</li></ol>\n<p>To view and edit your passwords, see <a href=\"/en-US/kb/manage-your-logins-firefox-password-manager\">Manage your logins with the Firefox Password Manager</a>.\n</p>\n<div class=\"note\"><strong>Tip:</strong> If coming up with your own password, remember not to reuse passwords between sites or have a password that is easy to guess. See <a href=\"/en-US/kb/password-strength\">Choose a strong password</a>.</div>",
  "text": "When creating a new account on a website, it can be difficult to think of a unique and secure password. When signing up for a new account on a website, Firefox can generate a secure password for you. Generate a new password Firefox can automatically generate random, secure passwords for you when you're creating an account: Click the password field on a website. The secure password option will automatically display. Click Use a Securely Generated Password to fill in the field. Firefox will also save your new login for that site. If the generated password does not meet the website requirements, clicking on the password field will reveal (unmask) the password, so you can edit it to meet the requirements. To view and edit your passwords, see Manage your logins with the Firefox Password Manager . Tip: If coming up with your own password, remember not to reuse passwords between sites or have a password that is easy to guess. See Choose a strong password .",
  "products": [
    "firefox",
    "mozilla-account"
  ],
  "topics": [
    "accounts"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 1584,
    "text_bytes": 963,
    "word_count": 166,
    "downloaded_at": "2025-08-26T10:53:03.638558"
  }
}