{
  "slug": "https-first",
  "title": "HTTPS-First upgrades to secure connections",
  "summary": "From version 136, Firefox implements HTTPS-First and always attempts to connect securely. If a secure connection fails it falls back to an insecure connection.",
  "url": "https://support.mozilla.org/en-US/kb/https-first",
  "html": "<div class=\"note\">This article describes the <em>HTTPS-First</em> feature, enabled by default in <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 136 and above.</div>\n<h1 id=\"w_https-first\">HTTPS-First</h1>\n<p>When browsing with HTTPS-First, Firefox will always try to connect to websites using a secure, encrypted HTTPS connection first. This ensures you have peace of mind that no one can snoop on the content of the pages you visit or hack into your website connection to steal your passwords, credit card information or other personal information. Most websites already support HTTPS; some support both HTTP and HTTPS. With HTTPS-First, Firefox will try to make sure you have the more secure connection, whenever it is available.\n</p>\n<h2 id=\"w_secure-site-not-available\">Secure site not available</h2>\n<p>Some websites only support HTTP and the connection cannot be upgraded. If an HTTPS version of a site is not available, the site will load but through the less secure HTTP protocol. In some cases, websites seem to support HTTPS but serve different content from the HTTP version or behave different in other ways. To avoid upgrade attempts users can enter an address in the address bar with an explicit <code>http://</code> scheme. Permanent exceptions added in the <a href=\"/en-US/kb/https-only-prefs#w_add-exceptions-for-http-websites-when-youre-in-https-only-mode\">HTTPS-Only Mode section</a> in Firefox settings will also prevent upgrades.\n</p>\n<h1 id=\"w_what-is-the-difference-between-http-and-https\">What is the difference between HTTP and HTTPS?</h1>\n<p><a href=\"https://wikipedia.org/wiki/Hypertext_Transfer_Protocol\">HTTP</a> stands for <em>Hypertext Transfer Protocol</em> and is the foundational protocol for the web and encodes basic interactions between browsers and web servers. The problem with the regular HTTP protocol is that the data transferring from server to browser is not encrypted, meaning data can be viewed, stolen, or altered. The <a href=\"https://wikipedia.org/wiki/HTTPS\">HTTPS</a> protocol fixes this by using an encrypted connection that protects sensitive information. It uses digital signatures with public certificate, to ensure that the encrypted connection is established to the right end-point.\n</p>\n<h1 id=\"w_related-content\">Related content</h1>\n<p>There are other technical reasons that may impact how Firefox is upgrading connections. To learn more, see <a href=\"/en-US/kb/https-upgrades\">Firefox connection upgrades - HTTP to HTTPS</a>.\n</p>",
  "text": "This article describes the HTTPS-First feature, enabled by default in Firefox version 136 and above. HTTPS-First When browsing with HTTPS-First, Firefox will always try to connect to websites using a secure, encrypted HTTPS connection first. This ensures you have peace of mind that no one can snoop on the content of the pages you visit or hack into your website connection to steal your passwords, credit card information or other personal information. Most websites already support HTTPS; some support both HTTP and HTTPS. With HTTPS-First, Firefox will try to make sure you have the more secure connection, whenever it is available. Secure site not available Some websites only support HTTP and the connection cannot be upgraded. If an HTTPS version of a site is not available, the site will load but through the less secure HTTP protocol. In some cases, websites seem to support HTTPS but serve different content from the HTTP version or behave different in other ways. To avoid upgrade attempts users can enter an address in the address bar with an explicit http:// scheme. Permanent exceptions added in the HTTPS-Only Mode section in Firefox settings will also prevent upgrades. What is the difference between HTTP and HTTPS? HTTP stands for Hypertext Transfer Protocol and is the foundational protocol for the web and encodes basic interactions between browsers and web servers. The problem with the regular HTTP protocol is that the data transferring from server to browser is not encrypted, meaning data can be viewed, stolen, or altered. The HTTPS protocol fixes this by using an encrypted connection that protects sensitive information. It uses digital signatures with public certificate, to ensure that the encrypted connection is established to the right end-point. Related content There are other technical reasons that may impact how Firefox is upgrading connections. To learn more, see Firefox connection upgrades - HTTP to HTTPS .",
  "products": [
    "firefox"
  ],
  "topics": [
    "connectivity",
    "encryption",
    "performance-and-connectivity",
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2523,
    "text_bytes": 1948,
    "word_count": 310,
    "downloaded_at": "2025-08-26T10:59:22.317033"
  }
}