{
  "slug": "identify-problems-third-party-modules-firefox-windows",
  "title": "Identify problems caused by third-party modules in Firefox for Windows",
  "summary": "Identify problems caused by third-party modules in Firefox for Windows.",
  "url": "https://support.mozilla.org/en-US/kb/identify-problems-third-party-modules-firefox-windows",
  "html": "<div class=\"for\" data-for=\"mac,linux\"><div class=\"for\" data-for=\"not win\"><div class=\"warning\">This article only applies to Firefox on Windows.</div></div></div>\n<p></p><p>Third-party applications (such as antivirus software, archiving software, and other tools) may load modules into Firefox. Sometimes, these applications load harmful modules that cause Firefox crashes, reduced performance, or compatibility issues. You may not notice that a malicious or unexpected module has been loaded and it may cause problems that appear to be Firefox issues.\n</p><p>The Firefox <em>about:third-party</em> page gives users information about third-party modules that have been injected into Firefox.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_accessing-the-aboutthird-party-page\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Accessing the about:third-party page</span></a></li><li class=\"toclevel-1\"><a href=\"#w_module-information\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Module information</span></a></li><li class=\"toclevel-1\"><a href=\"#w_block-modules-that-cause-firefox-to-crash\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Block modules that cause Firefox to crash</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_dont-see-the-block-icon\"><span class=\"tocnumber\">3.1</span> <span class=\"toctext\">Don't see the block icon?</span></a></li></ul></li></ul></div>\n<h1 id=\"w_accessing-the-aboutthird-party-page\">Accessing the about:third-party page</h1>\n<p>Type <strong>about:third-party</strong> in the address bar and press <span class=\"key\">Enter</span>. This will take you to the <em>Third-party module Information</em> page. This page shows users a list of modules that have been loaded into the browser, new modules loaded and modules that are slow to load.\n</p><p>If you see a <span class=\"button\">Reload with system info</span> button on top of the page, click on it to reload the page and see more useful information about any modules that are installed.\n</p><p><img alt=\"ReloadSystemInfo_button\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-07-13-07-19-04-06f6a3.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</p><p>The <span class=\"button\">Copy raw data to clipboard</span> button will copy a text version of all data shown in the list, in JSON format, to the clipboard. You can then paste the data to a text file to analyze or add it to a Mozilla Support question.  \n</p>\n<h1 id=\"w_module-information\">Module information</h1>\n<p>The <em>about:third-party</em> page shows the following information for each module:\n</p>\n<ul><li><strong>Module name</strong>.\n</li><li>Application name/publisher, if provided by the third-party vendor or developer.\n</li><li>File version.\n</li><li>Vendor info.\n</li><li>Number of occurrences.\n</li><li>Average blocking time, in milliseconds.\n</li><li>Optional module status icons and other information:\n<ul><li>An<strong> unsigned icon</strong> <img alt=\"Fx89Padlock-RedLine\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-53-30-fe088c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> (padlock with a red strike over it) will appear next to the name of the module, if the module has not been digitally signed.\n</li><li>A <strong>warning triangle</strong> <img alt=\"Warning_icon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-07-07-14-00-54-aa662a.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"35\"> will appear next to the name of a module, if it has been identified as causing a Firefox crash with the current Firefox profile.\n</li><li>Module type (“IME”, “Shell Extension”).\n</li></ul>\n</li><li>A folder button <img alt=\"folder\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-08-07-07-06-28-851148.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to show the module’s file in Windows Explorer.\n</li><li>A dropdown button <img alt=\"arrow-dropdown\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-08-07-07-13-13-402f96.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to expand <strong>detailed table of loading events</strong> which is collapsed by default:\n<ul><li>Target process (the Firefox process type, limited to “browser”, “tab”, or “RDD”).\n</li><li>Loading duration.\n</li><li>Background label if it was loaded in a background thread.\n</li><li>Status (Loaded or Blocked).\n</li></ul>\n</li></ul>\n<div class=\"for\" data-for=\"fx110\">\n<h1 id=\"w_block-modules-that-cause-firefox-to-crash\">Block modules that cause Firefox to crash</h1>\n<p>There are some third-party modules that may cause Firefox to crash. A warning triangle <img alt=\"Warning_icon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-07-07-14-00-54-aa662a.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"40\">  will be displayed next to its name if a module has been identified as causing a crash before. To check if a third-party module is causing a crash, try temporarily disabling it and see if the problem is fixed. \n</p><p>Follow these steps to manually block the module:\n</p>\n<ol><li>Type <strong>about:third-party</strong> in the address bar and press <span class=\"key\">Enter</span>.\n</li><li>Find the module that you think is causing the crash.\n</li><li>Click the block icon next to the module.\n<dl><dt><img alt=\"block_module_settings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-01-16-13-08-31-d4d0c7.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<p>A dialog box will appear, asking you to restart Firefox in order for the changes to take effect. If this fixes the issue, you can continue to use Firefox without uninstalling the third-party module.\n</p>\n<div class=\"note\"><strong>Note:</strong> Blocking the module will disable it permanently. To unblock the third-party module, click the icon next to the module again (the icon turns red when the module is blocked).</div>\n<h2 id=\"w_dont-see-the-block-icon\">Don't see the block icon?</h2>\n<p>If you are experiencing an issue where the block icon is not appearing next to a particular module, first check if the <span class=\"button\">Reload with system info</span> button is present. If it is, click it to see if that resolves the issue.\n</p><p>If the block icon still doesn't appear, the <a href=\"https://wiki.mozilla.org/Platform/Integration/InjectEject/Launcher_Process/\">Launcher Process</a>, a Firefox security-related feature, may not be active. To check this:\n</p>\n<ol><li>Type <strong>about:support</strong> in the address bar and press <span class=\"key\">Enter</span>. This will take you to the <a href=\"/en-US/kb/use-troubleshooting-information-page-fix-firefox\">Troubleshooting Information</a> page.\n</li><li>Look for the <strong>Launcher Process</strong> entry under the <strong>Application Basics</strong> section. If it shows as <em>Disabled</em>, you will need to re-enable the Launcher Process.\n</li></ol>\n<p>To re-enable the Launcher Process:\n</p>\n<ol><li>Type <strong>about:config</strong> in the <a href=\"/en-US/kb/search-firefox-address-bar\">address bar</a> and press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>.<br>A warning page may appear. Click <span class=\"button\">Accept the Risk and Continue</span> to go to the <em>about:config</em> page.\n\n</li><li>Find the <span class=\"pref\">browser.launcherProcess.enabled</span> preference. \n</li><li>Toggle it to <span class=\"pref\">false</span>, then toggle it back to <span class=\"pref\">true</span>.\n</li><li>Restart Firefox to have the Launcher Process take effect.\n</li></ol>\n</div>",
  "text": "This article only applies to Firefox on Windows. Third-party applications (such as antivirus software, archiving software, and other tools) may load modules into Firefox. Sometimes, these applications load harmful modules that cause Firefox crashes, reduced performance, or compatibility issues. You may not notice that a malicious or unexpected module has been loaded and it may cause problems that appear to be Firefox issues. The Firefox about:third-party page gives users information about third-party modules that have been injected into Firefox. Table of Contents 1 Accessing the about:third-party page 2 Module information 3 Block modules that cause Firefox to crash 3.1 Don't see the block icon? Accessing the about:third-party page Type about:third-party in the address bar and press Enter . This will take you to the Third-party module Information page. This page shows users a list of modules that have been loaded into the browser, new modules loaded and modules that are slow to load. If you see a Reload with system info button on top of the page, click on it to reload the page and see more useful information about any modules that are installed. The Copy raw data to clipboard button will copy a text version of all data shown in the list, in JSON format, to the clipboard. You can then paste the data to a text file to analyze or add it to a Mozilla Support question. Module information The about:third-party page shows the following information for each module: Module name . Application name/publisher, if provided by the third-party vendor or developer. File version. Vendor info. Number of occurrences. Average blocking time, in milliseconds. Optional module status icons and other information: An unsigned icon (padlock with a red strike over it) will appear next to the name of the module, if the module has not been digitally signed. A warning triangle will appear next to the name of a module, if it has been identified as causing a Firefox crash with the current Firefox profile. Module type (“IME”, “Shell Extension”). A folder button to show the module’s file in Windows Explorer. A dropdown button to expand detailed table of loading events which is collapsed by default: Target process (the Firefox process type, limited to “browser”, “tab”, or “RDD”). Loading duration. Background label if it was loaded in a background thread. Status (Loaded or Blocked). Block modules that cause Firefox to crash There are some third-party modules that may cause Firefox to crash. A warning triangle will be displayed next to its name if a module has been identified as causing a crash before. To check if a third-party module is causing a crash, try temporarily disabling it and see if the problem is fixed. Follow these steps to manually block the module: Type about:third-party in the address bar and press Enter . Find the module that you think is causing the crash. Click the block icon next to the module. A dialog box will appear, asking you to restart Firefox in order for the changes to take effect. If this fixes the issue, you can continue to use Firefox without uninstalling the third-party module. Note: Blocking the module will disable it permanently. To unblock the third-party module, click the icon next to the module again (the icon turns red when the module is blocked). Don't see the block icon? If you are experiencing an issue where the block icon is not appearing next to a particular module, first check if the Reload with system info button is present. If it is, click it to see if that resolves the issue. If the block icon still doesn't appear, the Launcher Process , a Firefox security-related feature, may not be active. To check this: Type about:support in the address bar and press Enter . This will take you to the Troubleshooting Information page. Look for the Launcher Process entry under the Application Basics section. If it shows as Disabled , you will need to re-enable the Launcher Process. To re-enable the Launcher Process: Type about:config in the address bar and press Enter Return . A warning page may appear. Click Accept the Risk and Continue to go to the about:config page. Find the browser.launcherProcess.enabled preference. Toggle it to false , then toggle it back to true . Restart Firefox to have the Launcher Process take effect.",
  "products": [
    "firefox"
  ],
  "topics": [
    "crashing-and-slow-performance",
    "performance-and-connectivity"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 8629,
    "text_bytes": 4299,
    "word_count": 717,
    "downloaded_at": "2025-08-26T10:54:22.518286"
  }
}