{
  "slug": "integrate-firefox-relay-firefox-password-manager",
  "title": "Integrate Firefox Relay into the Firefox Password Manager",
  "summary": "Learn how to integrate Firefox Relay into the Firefox Password Manager to create and manage email masks directly.",
  "url": "https://support.mozilla.org/en-US/kb/integrate-firefox-relay-firefox-password-manager",
  "html": "<p>Firefox Relay allows you to create email masks to protect your privacy while signing up for websites. You can now generate and manage these email masks directly from the Firefox <a href=\"/en-US/kb/password-manager-remember-delete-edit-logins\">Password Manager</a>. This article explains how to integrate Firefox Relay with Firefox Password Manager and manage your email masks seamlessly.\n</p>\n<h1 id=\"w_add-firefox-relay-to-firefox-password-manager\">Add Firefox Relay to Firefox Password Manager</h1>\n<ol><li>Sign in to your Mozilla account.\n</li><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Click <span class=\"menu\">Privacy &amp; Security</span> on the left panel.\n</li><li>Scroll down to the <em>Passwords</em> section and ensure the option for <strong>Suggest Firefox Relay email masks</strong> is enabled with a checkmark<img alt=\"blue checkmark\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-10-17-10-05-19-ff037d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">.\n<dl><dt><img alt=\"Suggest relay pass\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-10-17-10-07-08-f76304.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"550\"> \n</dt></dl>\n</li></ol>\n<div class=\"note\"><strong>Tip:</strong> You can manage your email masks and create more by visiting the <a href=\"https://relay.firefox.com/accounts/profile/\">Firefox Relay</a> dashboard.</div>\n<h1 id=\"w_common-questions\">Common questions</h1>\n<h2 id=\"w_why-is-firefox-relay-shown-in-my-password-manager\">Why is Firefox Relay shown in my Password Manager?</h2>\n<p>If you're using Firefox Relay, it’s now integrated into the Firefox Password Manager to help you easily use email masks while filling out forms.\n</p>\n<h2 id=\"w_how-many-email-masks-can-i-use\">How many email masks can I use?</h2>\n<p>With the free version of Firefox Relay, you can create up to 5 email masks. To unlock unlimited masks, consider upgrading to <a href=\"/en-US/kb/subscribe-firefox-relay-premium\">Firefox Relay Premium</a>.\n</p>\n<h2 id=\"w_can-i-remove-firefox-relay-from-the-password-manager\">Can I remove Firefox Relay from the Password Manager?</h2>\n<p>Yes, you can disable the Firefox Relay option in the Password Manager by going to <span class=\"menu\">Settings</span> and <span class=\"menu\">Privacy &amp; Security</span>, and unchecking the box next to <strong>Suggest Firefox Relay email masks</strong>.\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/relay-integration\">Add Firefox Relay to the Firefox password manager</a>\n</li><li><a href=\"/en-US/kb/create-email-mask-through-firefox-relay\">Create an email mask through Firefox Relay</a>\n</li><li><a href=\"/en-US/kb/firefox-relay-premium-faq\">Firefox Relay Premium FAQ</a>\n</li><li><a href=\"/en-US/kb/subscribe-firefox-relay-premium\">Subscribe to Firefox Relay Premium</a>\n</li></ul>",
  "text": "Firefox Relay allows you to create email masks to protect your privacy while signing up for websites. You can now generate and manage these email masks directly from the Firefox Password Manager . This article explains how to integrate Firefox Relay with Firefox Password Manager and manage your email masks seamlessly. Add Firefox Relay to Firefox Password Manager Sign in to your Mozilla account. In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Click Privacy & Security on the left panel. Scroll down to the Passwords section and ensure the option for Suggest Firefox Relay email masks is enabled with a checkmark . Tip: You can manage your email masks and create more by visiting the Firefox Relay dashboard. Common questions Why is Firefox Relay shown in my Password Manager? If you're using Firefox Relay, it’s now integrated into the Firefox Password Manager to help you easily use email masks while filling out forms. How many email masks can I use? With the free version of Firefox Relay, you can create up to 5 email masks. To unlock unlimited masks, consider upgrading to Firefox Relay Premium . Can I remove Firefox Relay from the Password Manager? Yes, you can disable the Firefox Relay option in the Password Manager by going to Settings and Privacy & Security , and unchecking the box next to Suggest Firefox Relay email masks . Related articles Add Firefox Relay to the Firefox password manager Create an email mask through Firefox Relay Firefox Relay Premium FAQ Subscribe to Firefox Relay Premium",
  "products": [
    "firefox",
    "relay"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "passwords-and-sign-in"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3754,
    "text_bytes": 1640,
    "word_count": 278,
    "downloaded_at": "2025-08-26T10:57:13.564420"
  }
}