{
  "slug": "introducing-total-cookie-protection-standard-mode",
  "title": "Introducing Total Cookie Protection in Standard Mode",
  "summary": "Firefox users now have access to Total Cookie Protection by default. Find all you need to know about it in this article.",
  "url": "https://support.mozilla.org/en-US/kb/introducing-total-cookie-protection-standard-mode",
  "html": "<p>Firefox users now have access to Total Cookie Protection by default. Total Cookie Protection is an advancement built into <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a> that works by maintaining a separate <em>cookie jar</em> for each website you visit.\n</p>\n<h1 id=\"w_how-does-total-cookie-protection-work\">How does Total Cookie Protection work?</h1>\n<p>Firefox is here to protect you from third-parties who are tracking cookies and information about your browsing activity, without your knowledge or consent. These companies try to build a profile based on details of your online spending, health and other personal information, and sell it without you knowing.  \n</p><p>Total Cookie Protection builds a fence around cookies, limiting them to the site you're on so third parties can't use those same <a href=\"https://www.digitalinformationworld.com/2020/06/you-better-get-used-to-the-name-tracking-beacons-instead-of-cookies.html\">tracking beacons</a> to follow you from one site to the next. For example, if you visit Facebook, Facebook won’t be able to view your activity on Etsy, One Medical or your cousin’s cooking blog later.\n</p><p>For more information, check out our <a href=\"https://blog.mozilla.org/en/products/firefox/firefox-rolls-out-total-cookie-protection-by-default-to-all-users-worldwide/\">blog post on Total Cookie Protection</a>. \n</p>\n<h1 id=\"w_what-should-i-expect\">What should I expect?</h1>\n<p>Total Cookie Protection will be turned on by default in standard browsing. There should be no noticeable effect on your browsing and sites should continue to work as before.\n</p>\n<h1 id=\"w_what-kind-of-data-do-we-collect\">What kind of data do we collect?</h1>\n<p>Firefox doesn’t collect any of your personal data, other than your setting preference.\n</p>\n<h1 id=\"w_what-do-i-do-if-a-site-seems-broken\">What do I do if a site seems broken?</h1>\n<p>If a site seems broken, disabling <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a> might fix the issue by allowing trackers on just that site. It allows trackers to load on that site only. Enhanced Tracking Protection will still prevent trackers on other sites. To disable it:\n</p>\n<ol><li>Visit the website.\n</li><li>At the left of the address bar, click the <img alt=\"Fx89ShieldIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-05-12-06-f2679d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"30\"> shield icon.\n</li><li>At the top of the panel, toggle off the Enhanced Tracking Protection switch <img alt=\"Fx91ETPbluetoggle\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-03-16-12-56-21-3859dc.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"40\">. This will disable Enhanced Tracking Protection for the site, causing the page to automatically reload and enable trackers.\n<dl><dt><span class=\"for\" data-for=\"not fx138\"><img alt=\"Protection panel\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-02-20-06-58-36-8c3fa8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"400\"></span><span class=\"for\" data-for=\"fx138\"><img alt=\"Fx138ProtectionPanelOff\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-05-13-03-19-08-3f5858.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</dt></dl>\n</li></ol>\n<p>Follow the same process to turn Enhanced Tracking Protection back on.\n</p><p>If the issue persists, consider reporting it by submitting a <em>Broken Site Report</em>. This allows the Webcompat team to examine the problem. For more information, see <a href=\"/en-US/kb/report-breakage-due-blocking\">How do I report a broken site in Firefox desktop?</a>\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li>To learn more about Enhanced Tracking Protection settings in Firefox, see <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection in Firefox for desktop</a>.\n</li><li>For information about Total Cookie Protection and site breakage, see <a href=\"/en-US/kb/total-cookie-protection-and-website-breakage-faq\">Total Cookie Protection and website breakage FAQ</a>.\n</li></ul>",
  "text": "Firefox users now have access to Total Cookie Protection by default. Total Cookie Protection is an advancement built into Enhanced Tracking Protection that works by maintaining a separate cookie jar for each website you visit. How does Total Cookie Protection work? Firefox is here to protect you from third-parties who are tracking cookies and information about your browsing activity, without your knowledge or consent. These companies try to build a profile based on details of your online spending, health and other personal information, and sell it without you knowing. Total Cookie Protection builds a fence around cookies, limiting them to the site you're on so third parties can't use those same tracking beacons to follow you from one site to the next. For example, if you visit Facebook, Facebook won’t be able to view your activity on Etsy, One Medical or your cousin’s cooking blog later. For more information, check out our blog post on Total Cookie Protection . What should I expect? Total Cookie Protection will be turned on by default in standard browsing. There should be no noticeable effect on your browsing and sites should continue to work as before. What kind of data do we collect? Firefox doesn’t collect any of your personal data, other than your setting preference. What do I do if a site seems broken? If a site seems broken, disabling Enhanced Tracking Protection might fix the issue by allowing trackers on just that site. It allows trackers to load on that site only. Enhanced Tracking Protection will still prevent trackers on other sites. To disable it: Visit the website. At the left of the address bar, click the shield icon. At the top of the panel, toggle off the Enhanced Tracking Protection switch . This will disable Enhanced Tracking Protection for the site, causing the page to automatically reload and enable trackers. Follow the same process to turn Enhanced Tracking Protection back on. If the issue persists, consider reporting it by submitting a Broken Site Report . This allows the Webcompat team to examine the problem. For more information, see How do I report a broken site in Firefox desktop? Related articles To learn more about Enhanced Tracking Protection settings in Firefox, see Enhanced Tracking Protection in Firefox for desktop . For information about Total Cookie Protection and site breakage, see Total Cookie Protection and website breakage FAQ .",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security",
    "tracking-protection"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4721,
    "text_bytes": 2408,
    "word_count": 396,
    "downloaded_at": "2025-08-26T10:54:56.037044"
  }
}