{
  "slug": "javascript-settings-for-interactive-web-pages",
  "title": "JavaScript settings and preferences for interactive web pages",
  "summary": "This article describes what JavaScript is and how to allow or block it on certain websites.",
  "url": "https://support.mozilla.org/en-US/kb/javascript-settings-for-interactive-web-pages",
  "html": "<p>This article describes what JavaScript® is and how to allow or block it on certain websites.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-is-javascript\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What is JavaScript?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_allow-and-block-javascript-on-certain-domains\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Allow and block JavaScript on certain domains</span></a></li><li class=\"toclevel-1\"><a href=\"#w_websites-ask-you-to-enable-javascript\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Websites ask you to enable JavaScript</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_for-advanced-users\"><span class=\"tocnumber\">3.1</span> <span class=\"toctext\">For advanced users</span></a></li></ul></li></ul></div>\n<h1 id=\"w_what-is-javascript\">What is JavaScript?</h1>\n<p><a href=\"http://wikipedia.org/wiki/JavaScript\">JavaScript</a> is a standard programming language that can be included in web pages to provide functionality such as menus, sounds, and other interactive features. By default, Firefox enables the use of JavaScript and requires no additional installation.\n</p>\n<h1 id=\"w_allow-and-block-javascript-on-certain-domains\">Allow and block JavaScript on certain domains</h1>\n<p>JavaScript can be used to do things that some people don't like. For better control, you can find and install <a href=\"https://addons.mozilla.org/en-US/search/?q=JavaScript\">JavaScript extensions</a> or <a href=\"https://addons.mozilla.org/firefox/search/?tag=privacy\">privacy extensions</a> that let you disable JavaScript, such as these add-ons: \n</p>\n<ul><li><a href=\"https://addons.mozilla.org/firefox/addon/noscript\">NoScript</a>: allows JavaScript and other content to run only on websites of your choice.\n</li><li> <a href=\"https://addons.mozilla.org/firefox/addon/ghostery\">Ghostery</a>: allows you to block scripts from companies that you don't trust.\n</li></ul>\n<div class=\"for\" data-for=\"win8\">\n<div class=\"note\"> Note: Some websites use JavaScript for functions such as \"on hover\" drop-down menus, which may not work in Firefox on touch-screen computers.  A solution is to disable the \"HID-compliant touch screen\" setting in Windows Device Manager (visit a Windows forum if you need more help); however, this solution will effectively change the touch screen into a plain screen while disabled.</div>\n</div>\n<h1 id=\"w_websites-ask-you-to-enable-javascript\">Websites ask you to enable JavaScript</h1>\n<p>Websites may tell you that JavaScript is required or ask you to make sure that JavaScript is enabled, even though you don't want JavaScript to be blocked. Turn off any settings to disable JavaScript in your installed extensions or try <a href=\"/en-US/kb/disable-or-remove-add-ons#w_disabling-extensions\">disabling your extensions</a> to see if you can find the problem. You should contact the developer or visit the website for the add-on, to get help with a specific extension.\n</p>\n<h2 id=\"w_for-advanced-users\">For advanced users</h2>\n<p></p><div class=\"warning\"><strong>Warning:</strong> These instructions are for experienced Firefox users. Changing settings in the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a> (<em>about:config</em>) can have serious effects on your browser’s stability, security and performance.\n<br><strong>Only proceed if you are comfortable with advanced settings and understand the potential impacts</strong>.</div>\nJavaScript may be disabled for all websites in Advanced Preferences (<em>about:config</em> page). You can confirm that JavaScript is enabled or reset the preference as follows:\n<p></p>\n<ol><li>Type <strong>about:config</strong> in the <a href=\"/en-US/kb/search-firefox-address-bar\">address bar</a> and press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>.<br>A warning page may appear. Click <span class=\"button\">Accept the Risk and Continue</span> to go to the <em>about:config</em> page.\n\n</li><li>Find the <span class=\"pref\">javascript.enabled</span> preference. It should be set to <span class=\"pref\">true</span> by default.\n</li><li>If  <span class=\"pref\">javascript.enabled</span> is set to <span class=\"pref\">false</span>, click the Toggle <img alt=\"Fx71aboutconfig-ToggleButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-29-08-56-36-b0ab10.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> or Reset <img alt=\"Fx71aboutconfig-ResetButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-29-08-51-03-fee2fd.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button to set it back to <span class=\"pref\">true</span>.\n</li></ol>\n<p><sub>JavaScript is a trademark or registered trademark of <a href=\"http://www.oracle.com\">Oracle Corporation</a> in the U.S. and other countries.</sub>\n</p>",
  "text": "This article describes what JavaScript® is and how to allow or block it on certain websites. Table of Contents 1 What is JavaScript? 2 Allow and block JavaScript on certain domains 3 Websites ask you to enable JavaScript 3.1 For advanced users What is JavaScript? JavaScript is a standard programming language that can be included in web pages to provide functionality such as menus, sounds, and other interactive features. By default, Firefox enables the use of JavaScript and requires no additional installation. Allow and block JavaScript on certain domains JavaScript can be used to do things that some people don't like. For better control, you can find and install JavaScript extensions or privacy extensions that let you disable JavaScript, such as these add-ons: NoScript : allows JavaScript and other content to run only on websites of your choice. Ghostery : allows you to block scripts from companies that you don't trust. Note: Some websites use JavaScript for functions such as \"on hover\" drop-down menus, which may not work in Firefox on touch-screen computers. A solution is to disable the \"HID-compliant touch screen\" setting in Windows Device Manager (visit a Windows forum if you need more help); however, this solution will effectively change the touch screen into a plain screen while disabled. Websites ask you to enable JavaScript Websites may tell you that JavaScript is required or ask you to make sure that JavaScript is enabled, even though you don't want JavaScript to be blocked. Turn off any settings to disable JavaScript in your installed extensions or try disabling your extensions to see if you can find the problem. You should contact the developer or visit the website for the add-on, to get help with a specific extension. For advanced users Warning: These instructions are for experienced Firefox users. Changing settings in the Configuration Editor ( about:config ) can have serious effects on your browser’s stability, security and performance. Only proceed if you are comfortable with advanced settings and understand the potential impacts . JavaScript may be disabled for all websites in Advanced Preferences ( about:config page). You can confirm that JavaScript is enabled or reset the preference as follows: Type about:config in the address bar and press Enter Return . A warning page may appear. Click Accept the Risk and Continue to go to the about:config page. Find the javascript.enabled preference. It should be set to true by default. If javascript.enabled is set to false , click the Toggle or Reset button to set it back to true . JavaScript is a trademark or registered trademark of Oracle Corporation in the U.S. and other countries.",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5214,
    "text_bytes": 2686,
    "word_count": 435,
    "downloaded_at": "2025-08-26T10:34:44.559535"
  }
}