{
  "slug": "marketing-data",
  "title": "Manage marketing data settings in Firefox for Desktop",
  "summary": "Learn how Firefox Desktop collects marketing data, how Mozilla uses it, and how you can manage or opt out of marketing data sharing.",
  "url": "https://support.mozilla.org/en-US/kb/marketing-data",
  "html": "<p></p><div class=\"note\"> \n<p><span class=\"for\" data-for=\"fx\"><img alt=\"progressive rollout banner\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-28-12-46-04-f31ad5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\nFirefox handles data with transparency—learn more about what that means for you. <a href=\"https://www.mozilla.org/privacy/firefox/\">Read the Firefox Privacy Notice</a>.\n</p>\n</div>\nIf you arrive on the Firefox download page after clicking an ad on another website, you’ll have the option to share how you discovered Firefox with Mozilla’s marketing measurement partners. This helps us improve marketing efforts and reach more people, using <a href=\"https://support.google.com/analytics/answer/7318509?hl=en\">Google Analytics</a> as part of the process.\n<p></p>\n<div class=\"note\">Firefox does not share information like your browsing history, search queries or saved passwords, with marketing partners. Mozilla only collects the data necessary to measure and improve our marketing campaigns.</div>\n<p>This article explains what data is collected, how it’s used, and how you can opt out.\n</p>\n<h1 id=\"w_what-data-is-collected\">What data is collected?</h1>\n<p>If you choose to share your data, Firefox collects and shares the following:\n</p>\n<ul><li><strong>Attribution data:</strong> When you download Firefox through one of our marketing campaigns, we collect information to determine which campaign or advertisement referred you to Firefox’s download page. This may include:\n<ul><li>Campaign ID, ad group ID and advertising source\n</li><li>Country, timestamp and device metadata\n</li></ul>\n</li><li><strong>Interaction data:</strong> Firefox measures the success of our marketing campaigns by analyzing meaningful usage patterns rather than simply tracking downloads. These conversion events (such as whether a user opens Firefox multiple times during their first week after installing it) help us determine which campaigns are successful.\n</li></ul>\n<p><span class=\"for\" data-for=\"fx136\">For a technical overview of the data collected in the <a href=\"/en-US/kb/usage-ping-settings\">daily usage ping</a>, see the definitions in <a href=\"https://dictionary.telemetry.mozilla.org/apps/firefox_desktop/pings/usage-reporting\">the Glean Dictionary for Desktop</a>.</span>\n</p>\n<h1 id=\"w_how-does-mozilla-use-this-data\">How does Mozilla use this data?</h1>\n<p>Mozilla uses marketing data to:\n</p>\n<ul><li><strong>Measure campaign performance:</strong> Understand which advertisements or marketing campaigns are most effective in encouraging Firefox downloads.\n</li><li><strong>Improve marketing efforts:</strong> Refine how we promote Firefox to reach more people.\n</li></ul>\n<p>Mozilla’s approach to data collection is guided by the <a href=\"https://www.mozilla.org/about/manifesto/\">Mozilla Manifesto</a>. For more details, see the <a href=\"https://www.mozilla.org/privacy/firefox/\">Firefox Privacy Notice</a>.\n</p>\n<h1 id=\"w_how-to-opt-out-of-marketing-data-collection\">How to opt out of marketing data collection</h1>\n<h2 id=\"w_on-the-firefox-download-page\">On the Firefox download page</h2>\n<p>If you’re downloading Firefox from a marketing campaign, you’ll see an opt-out option on the download page. Simply uncheck the box that allows Mozilla to collect marketing data before proceeding with your download.\n</p>\n<h2 id=\"w_in-firefox-settings\">In Firefox settings</h2>\n<p>You can also manage your preferences in Firefox settings:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Go to the <span class=\"menu\">Privacy &amp; Security</span> panel.\n</li><li>Scroll down to <em>Firefox Data Collection and Use</em>.\n</li><li>Uncheck the box next to <span class=\"for\" data-for=\"not fx136\"><strong>Allow Firefox to send technical and interaction data to Mozilla</strong></span><span class=\"for\" data-for=\"fx136\"><strong>Send technical and interaction data to Mozilla</strong></span> to stop sharing marketing data.\n<dl><dt><span class=\"for\" data-for=\"not fx135\"><img alt=\"Fx128DataCollection-OptOutSetting\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-02-22-04-44-29-63e3ee.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"=fx135\"><img alt=\"Fx135DataCollection-OptOutSetting\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-02-22-04-50-36-dfdd4f.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"fx136\"><img alt=\"Fx136DataCollection-OptOutSetting\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-02-22-04-55-57-04579d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</dt></dl>\n</li></ol>\n<p>To learn more, see <a href=\"/en-US/kb/technical-and-interaction-data\">Manage technical and interaction data collection settings in Firefox</a>.\n</p>\n<h1 id=\"w_how-to-avoid-google-analytics-data-collection\">How to avoid Google Analytics data collection</h1>\n<p>To prevent Google Analytics from collecting any data on Mozilla’s websites, you can block cookies. In Firefox, you can adjust your browser settings to block or limit cookies, including those used by Google Analytics. Note that this may also affect other site functionality. For detailed instructions, see <a href=\"/en-US/kb/block-websites-storing-cookies-site-data-firefox\">Block websites from storing cookies and site data in Firefox</a>.\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/technical-and-interaction-data\">Manage technical and interaction data collection settings in Firefox</a>\n</li><li><a href=\"/en-US/kb/mobile-marketing-data\">Manage marketing data settings in Firefox for Android</a>\n</li><li><a href=\"/en-US/kb/privacy-preserving-attribution\">Privacy-Preserving Attribution</a>\n</li></ul>",
  "text": "Firefox handles data with transparency—learn more about what that means for you. Read the Firefox Privacy Notice . If you arrive on the Firefox download page after clicking an ad on another website, you’ll have the option to share how you discovered Firefox with Mozilla’s marketing measurement partners. This helps us improve marketing efforts and reach more people, using Google Analytics as part of the process. Firefox does not share information like your browsing history, search queries or saved passwords, with marketing partners. Mozilla only collects the data necessary to measure and improve our marketing campaigns. This article explains what data is collected, how it’s used, and how you can opt out. What data is collected? If you choose to share your data, Firefox collects and shares the following: Attribution data: When you download Firefox through one of our marketing campaigns, we collect information to determine which campaign or advertisement referred you to Firefox’s download page. This may include: Campaign ID, ad group ID and advertising source Country, timestamp and device metadata Interaction data: Firefox measures the success of our marketing campaigns by analyzing meaningful usage patterns rather than simply tracking downloads. These conversion events (such as whether a user opens Firefox multiple times during their first week after installing it) help us determine which campaigns are successful. For a technical overview of the data collected in the daily usage ping , see the definitions in the Glean Dictionary for Desktop . How does Mozilla use this data? Mozilla uses marketing data to: Measure campaign performance: Understand which advertisements or marketing campaigns are most effective in encouraging Firefox downloads. Improve marketing efforts: Refine how we promote Firefox to reach more people. Mozilla’s approach to data collection is guided by the Mozilla Manifesto . For more details, see the Firefox Privacy Notice . How to opt out of marketing data collection On the Firefox download page If you’re downloading Firefox from a marketing campaign, you’ll see an opt-out option on the download page. Simply uncheck the box that allows Mozilla to collect marketing data before proceeding with your download. In Firefox settings You can also manage your preferences in Firefox settings: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Go to the Privacy & Security panel. Scroll down to Firefox Data Collection and Use . Uncheck the box next to Allow Firefox to send technical and interaction data to Mozilla Send technical and interaction data to Mozilla to stop sharing marketing data. To learn more, see Manage technical and interaction data collection settings in Firefox . How to avoid Google Analytics data collection To prevent Google Analytics from collecting any data on Mozilla’s websites, you can block cookies. In Firefox, you can adjust your browser settings to block or limit cookies, including those used by Google Analytics. Note that this may also affect other site functionality. For detailed instructions, see Block websites from storing cookies and site data in Firefox . Related articles Manage technical and interaction data collection settings in Firefox Manage marketing data settings in Firefox for Android Privacy-Preserving Attribution",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6955,
    "text_bytes": 3441,
    "word_count": 535,
    "downloaded_at": "2025-08-26T10:59:12.649099"
  }
}