{
  "slug": "mozillacrashreporter",
  "title": "Mozilla Crash Reporter",
  "summary": "The Mozilla Crash Reporter dialog box appears when Firefox crashes and lets you send a crash report.  Learn how it works and how to access your crash reports.",
  "url": "https://support.mozilla.org/en-US/kb/mozillacrashreporter",
  "html": "<p>The Mozilla Crash Reporter dialog box appears when Firefox closes unexpectedly and lets you submit a crash report to developers, to make future Firefox versions crash less often. This article describes how it works and shows you how to access your crash reports.\n</p><p>For suggestions on how to prevent Firefox from crashing, see <a href=\"/en-US/kb/troubleshoot-firefox-crashes-closing-or-quitting\">Troubleshoot Firefox crashes (closing or quitting unexpectedly)</a>.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_when-firefox-crashes\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">When Firefox crashes</span></a></li><li class=\"toclevel-1\"><a href=\"#w_viewing-crash-reports\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Viewing crash reports</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_viewing-reports-outside-of-firefox\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Viewing reports outside of Firefox</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_getting-help-with-crash-reports\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Getting help with crash reports</span></a></li></ul></div>\n<h1 id=\"w_when-firefox-crashes\">When Firefox crashes</h1>\n<p>After Firefox crashes, the Mozilla Crash Reporter window will appear.\n</p>\n<dl><dt><img alt=\"Firefox Crash Reporter\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-03-19-07-31-41-b435a4.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p><strong>Tell Mozilla about this crash so they can fix it:</strong> If this box is checked, the Mozilla Crash Reporter will send a summary of the crash to Mozilla. Deselect this box if you don't want to send the report to Mozilla.\n</p><p><span class=\"button\"><strong>Details…</strong></span>: Will open the <em>Report Contents</em> window, where you can view the technical details of the crash.\n</p>\n<dl><dt><img alt=\"Crash Reporter Details\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2013-07-05-02-54-08-30736d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p><strong>Add a comment (comments are publicly visible):</strong> Use this box to add any further information that might be useful to developers trying to find the cause of the crash. The comments you post may be read by anyone.\n</p><p><strong>Include the address of the page I was on:</strong> When checked, the information you send to Mozilla will include the web page you visited before the crash.\n</p><p><strong>Quit Firefox:</strong> Close the dialog and don't start Firefox again.\n</p><p><strong>Restart Firefox:</strong> Start Firefox again. Firefox will give you the option to restore the windows and tabs you had opened before the crash. If Firefox crashes again after choosing to restore your windows and tabs, one of the pages you were on is causing the crash. In this case, choose <span class=\"button\">Close</span> to start a new session.\n</p>\n<h1 id=\"w_viewing-crash-reports\">Viewing crash reports</h1>\n<p>To view your crash reports from within Firefox:\n</p>\n<ol><li> In the address bar, type <strong>about:crashes</strong> and press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>. A list of crash reports will appear.\n<dl><dt><img alt=\"Fx64aboutcrashes\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2018-10-31-03-49-35-1a83d5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> Click on the <span class=\"button\">View</span> button to view the report.\n<dl><dt><img alt=\"FxCrashreport\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2018-10-31-04-15-45-ef4cfa.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<h2 id=\"w_viewing-reports-outside-of-firefox\">Viewing reports outside of Firefox</h2>\n<p>If you can't use the above method because Firefox crashes when it starts, you can also view the reports in files on your computer with the following steps:\n</p><div class=\"for\" data-for=\"win\">\n<ol><li> Press <span class=\"key\"><img alt=\"Windows Key\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2011-09-20-08-33-13-ff63c4.jpg\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span> + <span class=\"key\">R</span> on the keyboard. A <em>Run</em> dialog will open.\n</li><li> In the <em>Run</em> dialog, type <strong><span class=\"filepath\">%APPDATA%\\Mozilla\\Firefox\\Crash Reports\\</span></strong> and press <span class=\"key\">Enter</span>.\n</li></ol>\n</div><p><span class=\"for\" data-for=\"mac\">Crash reports are stored in <span class=\"filepath\">~/Library/Application Support/Firefox/Crash Reports/</span> (show hidden folders, on Mac OS X 10.7 and above, by holding down the <span class=\"key\">Option</span> key while opening the <span class=\"menu\">Go</span> menu in Finder and then selecting Library).</span><span class=\"for\" data-for=\"linux\">Crash reports are stored in <span class=\"filepath\">~/.mozilla/firefox/Crash Reports/</span></span>\n</p><p>The <span class=\"filepath\">Crash Reports</span> folder will contain two subfolders: <span class=\"filepath\">pending</span> and <span class=\"filepath\">submitted</span>. The <span class=\"filepath\">submitted</span> folder contains text files for each crash report submitted, with each file containing a crash report ID. For example, a file named <span class=\"filepath\">bp-031b02bb-26b6-4168-ac0e-2de492090531.txt</span> will contain the following text:<br><code>Crash ID: bp-031b02bb-26b6-4168-ac0e-2de492090531</code>\n</p><p>You can go to <a href=\"https://crash-stats.mozilla.org\">https://crash-stats.mozilla.org</a> and copy the Crash ID into the search field to view the report.\n</p>\n<h1 id=\"w_getting-help-with-crash-reports\">Getting help with crash reports</h1>\n<p>To use your crash report to get help with your Firefox problem, see <a href=\"/en-US/kb/troubleshoot-firefox-crashes-closing-or-quitting\">Troubleshoot Firefox crashes (closing or quitting unexpectedly)</a>.\n</p>",
  "text": "The Mozilla Crash Reporter dialog box appears when Firefox closes unexpectedly and lets you submit a crash report to developers, to make future Firefox versions crash less often. This article describes how it works and shows you how to access your crash reports. For suggestions on how to prevent Firefox from crashing, see Troubleshoot Firefox crashes (closing or quitting unexpectedly) . Table of Contents 1 When Firefox crashes 2 Viewing crash reports 2.1 Viewing reports outside of Firefox 3 Getting help with crash reports When Firefox crashes After Firefox crashes, the Mozilla Crash Reporter window will appear. Tell Mozilla about this crash so they can fix it: If this box is checked, the Mozilla Crash Reporter will send a summary of the crash to Mozilla. Deselect this box if you don't want to send the report to Mozilla. Details… : Will open the Report Contents window, where you can view the technical details of the crash. Add a comment (comments are publicly visible): Use this box to add any further information that might be useful to developers trying to find the cause of the crash. The comments you post may be read by anyone. Include the address of the page I was on: When checked, the information you send to Mozilla will include the web page you visited before the crash. Quit Firefox: Close the dialog and don't start Firefox again. Restart Firefox: Start Firefox again. Firefox will give you the option to restore the windows and tabs you had opened before the crash. If Firefox crashes again after choosing to restore your windows and tabs, one of the pages you were on is causing the crash. In this case, choose Close to start a new session. Viewing crash reports To view your crash reports from within Firefox: In the address bar, type about:crashes and press Enter Return . A list of crash reports will appear. Click on the View button to view the report. Viewing reports outside of Firefox If you can't use the above method because Firefox crashes when it starts, you can also view the reports in files on your computer with the following steps: Press + R on the keyboard. A Run dialog will open. In the Run dialog, type %APPDATA%\\Mozilla\\Firefox\\Crash Reports\\ and press Enter . Crash reports are stored in ~/Library/Application Support/Firefox/Crash Reports/ (show hidden folders, on Mac OS X 10.7 and above, by holding down the Option key while opening the Go menu in Finder and then selecting Library). Crash reports are stored in ~/.mozilla/firefox/Crash Reports/ The Crash Reports folder will contain two subfolders: pending and submitted . The submitted folder contains text files for each crash report submitted, with each file containing a crash report ID. For example, a file named bp-031b02bb-26b6-4168-ac0e-2de492090531.txt will contain the following text: Crash ID: bp-031b02bb-26b6-4168-ac0e-2de492090531 You can go to https://crash-stats.mozilla.org and copy the Crash ID into the search field to view the report. Getting help with crash reports To use your crash report to get help with your Firefox problem, see Troubleshoot Firefox crashes (closing or quitting unexpectedly) .",
  "products": [
    "firefox"
  ],
  "topics": [
    "crashing-and-slow-performance"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6712,
    "text_bytes": 3123,
    "word_count": 511,
    "downloaded_at": "2025-08-26T09:04:20.023556"
  }
}