{
  "slug": "on-device-models",
  "title": "On-device AI models in Firefox",
  "summary": "Learn what on-device AI models are and how you can manage them.",
  "url": "https://support.mozilla.org/en-US/kb/on-device-models",
  "html": "<p>Some features and extensions in Firefox are powered by AI models that are stored and run locally on your device. This approach helps preserve your privacy while enhancing your experience.\n</p><p>This article explains:\n</p>\n<ul><li>What on-device AI models are and how they’re different from AI models stored remotely.\n</li><li>How Firefox uses on-device AI models.\n</li><li>Where you can view and remove on-device AI models.\n</li></ul>\n<h1 id=\"w_what-are-on-device-ai-models\">What are on-device AI models?</h1>\n<p>The programs that make AI work are called models. Just like computer files, AI models can be stored locally, on your device. Or, they can be stored on remote servers – often called “the cloud”.\n</p><p>Storing AI models locally means your data and activity are processed on your computer, to preserve your privacy. When models are stored in the cloud, your data is sent to remote servers for processing.\n</p>\n<h2 id=\"w_benefits-of-on-device-ai-models\">Benefits of on-device AI models</h2>\n<p>Storing and running AI models locally on your device has these advantages:\n</p>\n<ul><li><strong>Preserves your privacy:</strong> Your data is processed on your computer.\n</li><li><strong>Works faster:</strong> Since processing happens on your device, results often appear more quickly.\n</li><li><strong>Works offline:</strong> Features continue to work even without an internet connection.\n</li></ul>\n<h2 id=\"w_how-on-device-ai-is-different-from-cloud-ai\">How on-device AI is different from cloud AI</h2>\n<table>\n<caption>\n</caption><tbody><tr>\n<th></th><th>On-device AI</th><th>Cloud AI\n</th></tr>\n<tr>\n<td><strong>Where processing happens</strong></td><td>On your device</td><td>On remote servers\n</td></tr>\n<tr>\n<td><strong>Privacy</strong></td><td>No data is sent to the servers</td><td>Data is sent to a central location for processing\n</td></tr>\n<tr>\n<td><strong>Speed</strong></td><td>No network delays</td><td>Depends on the internet speed\n</td></tr>\n<tr>\n<td><strong>Internet required</strong></td><td>No</td><td>Yes\n</td></tr></tbody></table>\n<h1 id=\"w_how-firefox-uses-on-device-ai-models\">How Firefox uses on-device AI models</h1>\n<p>Firefox uses on-device AI models to enhance certain features. Here are some examples:\n</p>\n<ul><li>When you edit PDFs in Firefox, AI can <a href=\"/en-US/kb/pdf-alt-text\">create alt text for images you add to PDFs</a>. This helps make your PDFs more accessible for those using screen readers.\n</li><li><a href=\"/en-US/kb/how-use-ai-enhanced-tab-groups\">Help organize your tabs</a>. AI can read the titles of your open tabs and find similar ones to group together. This can help you stay organized while you browse.\n</li></ul>\n<p>Extensions you add to Firefox may also use on-device AI models.\n</p>\n<h1 id=\"w_manage-on-device-ai-models-in-firefox\">Manage on-device AI models in Firefox</h1>\n<p>In the address bar of Firefox, type <strong>about:addons</strong>. Select <span class=\"menu\">On-Device AI</span> from the menu. If you don’t see this item in the menu, it means Firefox and the extensions you’ve downloaded aren’t using any optional AI models on your device.\n</p><p>On this page, you can:\n</p>\n<ul><li><strong>Review models:</strong> See which models have been downloaded, what size the models are, and what they’re used for.\n</li><li><strong>Remove models:</strong> Helpful if you need to manage space on your device, or if you simply don’t use the associated feature or extensions anymore.\n</li></ul>\n<p><img alt=\"Manage on-device AI models\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-06-23-11-57-41-e9021e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</p>\n<h2 id=\"w_remove-an-ai-model\">Remove an AI model</h2>\n<ol><li>On the <em>On-Device AI</em> page, find the model you want to remove.\n</li><li>Select the trashcan icon.\n</li><li>Confirm you want to remove the model.\n<dl><dt><img alt=\"Remove AI model\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-06-23-12-00-37-b42ac1.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<h2 id=\"w_what-happens-after-i-remove-a-model\">What happens after I remove a model?</h2>\n<p>The model is removed from your device.\n</p><p>The related Firefox feature or extension will not be removed. If the feature or extension requires the model to work, it will be re-added if you use the feature or extension.\n</p>\n<h1 id=\"w_frequently-asked-questions-faqs\">Frequently Asked Questions (FAQs)</h1>\n<h2 id=\"w_will-a-feature-still-work-if-i-remove-the-ai-model\">Will a feature still work if I remove the AI model?</h2>\n<p>It depends. Some features may still work, just differently. Other features require the model to work. If you remove a model and then try to use a feature or extension that requires it, the model will be re-added automatically.\n</p>\n<h2 id=\"w_why-dont-i-see-the-on-device-ai-page\">Why don’t I see the <em>On-Device AI</em> page?</h2>\n<p>If you aren’t using any features or extensions powered by on-device AI models that you can manage, you won’t see this page.\n</p>\n<h2 id=\"w_how-do-i-know-what-an-ai-model-is-used-for\">How do I know what an AI model is used for?</h2>\n<p>For each model on the <em>On-Device AI</em> page, we include information about how Firefox uses the model or what extension uses the model. Select a model to view its details and find a link to the model’s card. “Model cards” provide detailed information about a model.\n</p>",
  "text": "Some features and extensions in Firefox are powered by AI models that are stored and run locally on your device. This approach helps preserve your privacy while enhancing your experience. This article explains: What on-device AI models are and how they’re different from AI models stored remotely. How Firefox uses on-device AI models. Where you can view and remove on-device AI models. What are on-device AI models? The programs that make AI work are called models. Just like computer files, AI models can be stored locally, on your device. Or, they can be stored on remote servers – often called “the cloud”. Storing AI models locally means your data and activity are processed on your computer, to preserve your privacy. When models are stored in the cloud, your data is sent to remote servers for processing. Benefits of on-device AI models Storing and running AI models locally on your device has these advantages: Preserves your privacy: Your data is processed on your computer. Works faster: Since processing happens on your device, results often appear more quickly. Works offline: Features continue to work even without an internet connection. How on-device AI is different from cloud AI On-device AI Cloud AI Where processing happens On your device On remote servers Privacy No data is sent to the servers Data is sent to a central location for processing Speed No network delays Depends on the internet speed Internet required No Yes How Firefox uses on-device AI models Firefox uses on-device AI models to enhance certain features. Here are some examples: When you edit PDFs in Firefox, AI can create alt text for images you add to PDFs . This helps make your PDFs more accessible for those using screen readers. Help organize your tabs . AI can read the titles of your open tabs and find similar ones to group together. This can help you stay organized while you browse. Extensions you add to Firefox may also use on-device AI models. Manage on-device AI models in Firefox In the address bar of Firefox, type about:addons . Select On-Device AI from the menu. If you don’t see this item in the menu, it means Firefox and the extensions you’ve downloaded aren’t using any optional AI models on your device. On this page, you can: Review models: See which models have been downloaded, what size the models are, and what they’re used for. Remove models: Helpful if you need to manage space on your device, or if you simply don’t use the associated feature or extensions anymore. Remove an AI model On the On-Device AI page, find the model you want to remove. Select the trashcan icon. Confirm you want to remove the model. What happens after I remove a model? The model is removed from your device. The related Firefox feature or extension will not be removed. If the feature or extension requires the model to work, it will be re-added if you use the feature or extension. Frequently Asked Questions (FAQs) Will a feature still work if I remove the AI model? It depends. Some features may still work, just differently. Other features require the model to work. If you remove a model and then try to use a feature or extension that requires it, the model will be re-added automatically. Why don’t I see the On-Device AI page? If you aren’t using any features or extensions powered by on-device AI models that you can manage, you won’t see this page. How do I know what an AI model is used for? For each model on the On-Device AI page, we include information about how Firefox uses the model or what extension uses the model. Select a model to view its details and find a link to the model’s card. “Model cards” provide detailed information about a model.",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5700,
    "text_bytes": 3663,
    "word_count": 635,
    "downloaded_at": "2025-08-26T11:02:30.955923"
  }
}