{
  "slug": "performance-settings",
  "title": "Firefox's performance settings",
  "summary": "Firefox automatically uses settings that work best with your computer. You can always change these settings.",
  "url": "https://support.mozilla.org/en-US/kb/performance-settings",
  "html": "<p>Firefox automatically chooses performance settings based on your computer’s hardware and operating system. These recommended settings work well for most people, but you can adjust them for better speed, lower memory use, or improved stability.\n</p><p>To change your performance settings:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>In the <span class=\"menu\">General</span> panel, go down to the <strong>Performance</strong> section.\n</li><li>Uncheck the box next to <em>Use recommended performance settings</em>.\n</li></ol>\n<div class=\"for\" data-for=\"fx94\"><p><img alt=\"Fx94PerformanceSettings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-12-07-05-33-22-632fe4.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</p></div><p>You will then be able to change the following:\n</p><p><strong>Hardware acceleration:</strong> Lets Firefox use your computer’s graphics processor (GPU) to display videos, games, and animations, reducing load on the main processor (CPU).\n</p><p>Turning this off can help if you experience:\n</p>\n<ul><li>Video playback issues or flickering\n</li><li>High GPU temperature while browsing\n</li><li>Crashes related to graphics drivers\n</li></ul>\n<p>Restart Firefox after changing this setting.\n</p><p>\n</p>\n<h1 id=\"w_if-you-dont-see-these-options\">If you don’t see these options</h1>\n<ul><li>If Firefox was installed through your Linux distribution’s package manager, updates and some settings may be controlled by your system.\n</li><li>Firefox hides hardware acceleration if your graphics driver isn’t compatible.\n</li><li>If using an older or <a href=\"/en-US/kb/firefox-esr-release-cycle\">ESR</a> version of Firefox, the interface may look different. Make sure you’re using the latest release from <a href=\"https://www.firefox.com/\">firefox.com</a>. For mobile devices, these settings are not available on Android or iOS.\n</li></ul>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/firefox-takes-long-time-start-up\">Firefox takes a long time to start up</a>\n</li><li><a href=\"/en-US/kb/quick-fixes-if-your-firefox-slows-down\">Quick fixes if your Firefox slows down</a>\n</li><li><a href=\"/en-US/kb/firefox-starts-automatically-when-i-restart-window\">Firefox starts automatically when I restart Windows</a>\n</li></ul>",
  "text": "Firefox automatically chooses performance settings based on your computer’s hardware and operating system. These recommended settings work well for most people, but you can adjust them for better speed, lower memory use, or improved stability. To change your performance settings: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the General panel, go down to the Performance section. Uncheck the box next to Use recommended performance settings . You will then be able to change the following: Hardware acceleration: Lets Firefox use your computer’s graphics processor (GPU) to display videos, games, and animations, reducing load on the main processor (CPU). Turning this off can help if you experience: Video playback issues or flickering High GPU temperature while browsing Crashes related to graphics drivers Restart Firefox after changing this setting. If you don’t see these options If Firefox was installed through your Linux distribution’s package manager, updates and some settings may be controlled by your system. Firefox hides hardware acceleration if your graphics driver isn’t compatible. If using an older or ESR version of Firefox, the interface may look different. Make sure you’re using the latest release from firefox.com . For mobile devices, these settings are not available on Android or iOS. Related articles Firefox takes a long time to start up Quick fixes if your Firefox slows down Firefox starts automatically when I restart Windows",
  "products": [
    "firefox"
  ],
  "topics": [
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3068,
    "text_bytes": 1590,
    "word_count": 249,
    "downloaded_at": "2025-08-26T10:37:46.881137"
  }
}