{
  "slug": "personalized-extension-recommendations",
  "title": "Personalized extension recommendations",
  "summary": "Learn more about how Firefox occasionally recommends extensions you may find interesting and how to opt-out.",
  "url": "https://support.mozilla.org/en-US/kb/personalized-extension-recommendations",
  "html": "<p><a href=\"/en-US/kb/find-and-install-add-ons-add-features-to-firefox\">Extensions</a> are pieces of software, usually created by third-party developers, that you can install to customize your Firefox browsing experience. You might occasionally see extension recommendations curated through the <a href=\"/en-US/kb/recommended-extensions-program\">Recommended Extensions program</a> while you browse in Firefox and through the Add-ons Manager (about:addons).\n</p><p><span class=\"for\" data-for=\"not fx140\"><img alt=\"Fx68AddonRecommendations\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2020-06-29-12-04-58-5dfba0.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"fx140\"><img alt=\"personalizefirefox\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-06-16-08-25-03-67ae9a.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</p><p>To discover personalized extension recommendations in the Add-ons Manager:<br>\n</p><p>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"for\" data-for=\"not fx140\"><span class=\"menu\">Add-ons and themes</span></span><span class=\"for\" data-for=\"fx140\"><span class=\"menu\">Extensions and themes</span></span> and select <span class=\"menu\">Recommendations</span>.\n\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-are-personalized-extension-recommendations-in-the-add-ons-manager\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What are personalized extension recommendations in the Add-ons Manager?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-are-extensions-selected\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How are extensions selected?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-opt-out-of-personalized-recommendations-in-the-add-ons-manager\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How do I opt out of personalized recommendations in the Add-ons Manager?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_who-benefits-from-these-personalized-recommendations\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Who benefits from these personalized recommendations?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-learn-more-about-extensions\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">How do I learn more about extensions?</span></a></li></ul></div>\n<h1 id=\"w_what-are-personalized-extension-recommendations-in-the-add-ons-manager\">What are personalized extension recommendations in the Add-ons Manager?</h1>\n<p>Personalized extension recommendations are based on other extensions you’ve installed, profile preferences, hardware, and usage statistics. All user data used to make recommendations is anonymized, non-personal information.\n</p><p>To better predict what extensions you may find interesting, Firefox uses the Telemetry-Aware Add-on Recommender (<a href=\"https://github.com/mozilla/taar#how-does-it-work\">TAAR</a>) system—a Mozilla service that recommends extensions by examining basic browser <a href=\"https://wiki.mozilla.org/Telemetry\">Telemetry</a>. This means TAAR analyzes usage statistics from a large number of other Firefox users, looks at other extensions you may have installed, and considers general characteristics about your Firefox profile (like language preference). Based on this information, TAAR surfaces extension recommendations tailored just for you. \n</p><p>All the data that TAAR analyzes in order to make personalized extension recommendations is anonymized. \n</p>\n<h1 id=\"w_how-are-extensions-selected\">How are extensions selected?</h1>\n<p>All extension recommendations appearing in the Add-ons Manager must first pass through a thorough editorial process. Recommended extensions are exceptional extensions that are hand-selected by Mozilla’s editorial team. These extensions meet Mozilla’s highest standards for functionality, user experience, and security.\n</p><p>Extension developers cannot pay for placement in the recommendation program, and Firefox does not receive any compensation as a result of this process. Recommendations are strictly intended to provide a better browsing experience for Firefox users.\n</p>\n<h1 id=\"w_how-do-i-opt-out-of-personalized-recommendations-in-the-add-ons-manager\">How do I opt out of personalized recommendations in the Add-ons Manager?</h1>\n<p>To turn off personalized recommendations in the Add-ons Manager:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>In the <em>Privacy &amp; Security</em> panel, scroll down to <em>Data Collection and Use</em> and un-check the box that reads, <strong>Allow Firefox to make personalized extension recommendations.</strong>\n</li></ol>\n<p>If you opt out, you’ll still see generalized recommended extensions in the Add-ons Manager; however, they won’t be personally tailored for you using Telemetry data. \n</p>\n<h1 id=\"w_who-benefits-from-these-personalized-recommendations\">Who benefits from these personalized recommendations?</h1>\n<p>Ideally, Firefox users like you. By providing more tailored extension recommendations, we hope to introduce you to extensions that meet your individual needs. \n</p><p>Recommendations are strictly intended to provide a better browsing experience for Firefox users. As described above, extension developers cannot pay for placement in the recommendation program, and Firefox does not receive any compensation as a result of this process.\n</p>\n<h1 id=\"w_how-do-i-learn-more-about-extensions\">How do I learn more about extensions?</h1>\n<p>Visit <a href=\"https://addons.mozilla.org\">addons.mozilla.org (AMO)</a> to explore thousands of extensions and themes. Most extensions and themes are created by independent developers from all over world.\n</p>",
  "text": "Extensions are pieces of software, usually created by third-party developers, that you can install to customize your Firefox browsing experience. You might occasionally see extension recommendations curated through the Recommended Extensions program while you browse in Firefox and through the Add-ons Manager (about:addons). To discover personalized extension recommendations in the Add-ons Manager: Click the menu button , click Add-ons and themes Extensions and themes and select Recommendations . Table of Contents 1 What are personalized extension recommendations in the Add-ons Manager? 2 How are extensions selected? 3 How do I opt out of personalized recommendations in the Add-ons Manager? 4 Who benefits from these personalized recommendations? 5 How do I learn more about extensions? What are personalized extension recommendations in the Add-ons Manager? Personalized extension recommendations are based on other extensions you’ve installed, profile preferences, hardware, and usage statistics. All user data used to make recommendations is anonymized, non-personal information. To better predict what extensions you may find interesting, Firefox uses the Telemetry-Aware Add-on Recommender ( TAAR ) system—a Mozilla service that recommends extensions by examining basic browser Telemetry . This means TAAR analyzes usage statistics from a large number of other Firefox users, looks at other extensions you may have installed, and considers general characteristics about your Firefox profile (like language preference). Based on this information, TAAR surfaces extension recommendations tailored just for you. All the data that TAAR analyzes in order to make personalized extension recommendations is anonymized. How are extensions selected? All extension recommendations appearing in the Add-ons Manager must first pass through a thorough editorial process. Recommended extensions are exceptional extensions that are hand-selected by Mozilla’s editorial team. These extensions meet Mozilla’s highest standards for functionality, user experience, and security. Extension developers cannot pay for placement in the recommendation program, and Firefox does not receive any compensation as a result of this process. Recommendations are strictly intended to provide a better browsing experience for Firefox users. How do I opt out of personalized recommendations in the Add-ons Manager? To turn off personalized recommendations in the Add-ons Manager: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the Privacy & Security panel, scroll down to Data Collection and Use and un-check the box that reads, Allow Firefox to make personalized extension recommendations. If you opt out, you’ll still see generalized recommended extensions in the Add-ons Manager; however, they won’t be personally tailored for you using Telemetry data. Who benefits from these personalized recommendations? Ideally, Firefox users like you. By providing more tailored extension recommendations, we hope to introduce you to extensions that meet your individual needs. Recommendations are strictly intended to provide a better browsing experience for Firefox users. As described above, extension developers cannot pay for placement in the recommendation program, and Firefox does not receive any compensation as a result of this process. How do I learn more about extensions? Visit addons.mozilla.org (AMO) to explore thousands of extensions and themes. Most extensions and themes are created by independent developers from all over world.",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6929,
    "text_bytes": 3650,
    "word_count": 522,
    "downloaded_at": "2025-08-26T10:46:53.134608"
  }
}