{
  "slug": "pinned-tabs-keep-favorite-websites-open",
  "title": "Pinned Tabs - keep favorite websites open and just a click away",
  "summary": "Pinned Tabs allow you to keep your favorite web apps open and just a click away. This article explains how to use them.",
  "url": "https://support.mozilla.org/en-US/kb/pinned-tabs-keep-favorite-websites-open",
  "html": "<p>Pinned Tabs allow you to always keep your favorite <a href=\"/en-US/kb/tabs-organize-websites-single-window\">tabs</a> open and just a click away. Pinned Tabs are small, can't be closed accidentally, and open automatically when you start Firefox. This article goes over the features of Pinned Tabs and shows you how to use them.\n</p><p></p><div class=\"youtube-embed\">\n  <iframe src=\"//www.youtube.com/embed/Bp_wblIfezo?wmode=transparent&amp;rel=0\" frameborder=\"0\" allowfullscreen></iframe>\n</div>\n<p></p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_why-should-i-use-pinned-tabs\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Why should I use Pinned Tabs?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-create-a-pinned-tab\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How do I create a Pinned Tab?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-remove-a-pinned-tab\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How do I remove a Pinned Tab?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-pinned-tabs-differ-from-the-normal-tabs\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">How do Pinned Tabs differ from the normal tabs?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-have-problems\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">I have problems</span></a></li></ul></div>\n<h1 id=\"w_why-should-i-use-pinned-tabs\">Why should I use Pinned Tabs?</h1>\n<p>The internet is full of websites that we use more like programs than just static pages. Popular sites like web mail or social networks are like this – they're used for accomplishing tasks (or to avoid accomplishing tasks), they update themselves and notify you when they've changed. Pinned Tabs allow you to pin any website to the left side of the tab strip so that it's always available.\n</p>\n<dl><dt><img alt=\"Fx128 pinned tab\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-12-20-08-14-21-fdd17c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<h1 id=\"w_how-do-i-create-a-pinned-tab\">How do I create a Pinned Tab?</h1>\n<p>The easiest way to see how useful Pinned Tabs are is to make one. <strong>Try it out:</strong> To turn one of your favorite websites (email, internet radio, social networks ...) into a Pinned Tab:\n</p>\n<ul><li><span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Control</span> key while you click</span>\n on the tab you want to pin and select <span class=\"menu\">Pin Tab</span> from the menu.\n</li></ul>\n<h1 id=\"w_how-do-i-remove-a-pinned-tab\">How do I remove a Pinned Tab?</h1>\n<p>To turn a Pinned Tab back into a regular tab is simple:\n</p>\n<ul><li><span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Control</span> key while you click</span>\n on the Pinned Tab and select <span class=\"menu\">Unpin Tab</span> from the menu.\n</li></ul>\n<h1 id=\"w_how-do-pinned-tabs-differ-from-the-normal-tabs\">How do Pinned Tabs differ from the normal tabs?</h1>\n<ul><li>Pinned Tabs are small – only showing the site's icon, not its title – and they live on the left side of the tab strip.\n</li><li>Pinned Tabs don't have a close button, so you can't accidentally close them.\n<ul><li>You can still close them by <span class=\"for\" data-for=\"win,linux\">right-clicking</span><span class=\"for\" data-for=\"mac\">Control-clicking</span> on them and selecting <span class=\"menu\">Close Tab</span> from the menu.\n</li></ul>\n</li><li>Pinned Tabs notify you with a green dot when they change.\n<dl><dt><img alt=\"Fx128 pinned tab with a dot\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-12-20-08-15-28-8d78f5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>All of the Pinned Tabs you have set when you close Firefox will open as Pinned Tabs when you start Firefox again.\n</li><li>Links to other websites open in a new tab so that your Pinned Tab doesn't change.\n<ul><li>Many web apps already do this, but a Pinned Tab will make this happen even when the website isn't set to do it.\n</li></ul>\n</li></ul>\n<h1 id=\"w_i-have-problems\">I have problems</h1>\n<ul><li>If you're unable to keep your Pinned Tabs after having restarted Firefox, see <a href=\"/en-US/kb/restore-previous-session#w_troubleshooting\">Troubleshooting Session Restore</a>.\n</li></ul>",
  "text": "Pinned Tabs allow you to always keep your favorite tabs open and just a click away. Pinned Tabs are small, can't be closed accidentally, and open automatically when you start Firefox. This article goes over the features of Pinned Tabs and shows you how to use them. Table of Contents 1 Why should I use Pinned Tabs? 2 How do I create a Pinned Tab? 3 How do I remove a Pinned Tab? 4 How do Pinned Tabs differ from the normal tabs? 5 I have problems Why should I use Pinned Tabs? The internet is full of websites that we use more like programs than just static pages. Popular sites like web mail or social networks are like this – they're used for accomplishing tasks (or to avoid accomplishing tasks), they update themselves and notify you when they've changed. Pinned Tabs allow you to pin any website to the left side of the tab strip so that it's always available. How do I create a Pinned Tab? The easiest way to see how useful Pinned Tabs are is to make one. Try it out: To turn one of your favorite websites (email, internet radio, social networks ...) into a Pinned Tab: Right-click Hold down the Control key while you click on the tab you want to pin and select Pin Tab from the menu. How do I remove a Pinned Tab? To turn a Pinned Tab back into a regular tab is simple: Right-click Hold down the Control key while you click on the Pinned Tab and select Unpin Tab from the menu. How do Pinned Tabs differ from the normal tabs? Pinned Tabs are small – only showing the site's icon, not its title – and they live on the left side of the tab strip. Pinned Tabs don't have a close button, so you can't accidentally close them. You can still close them by right-clicking Control-clicking on them and selecting Close Tab from the menu. Pinned Tabs notify you with a green dot when they change. All of the Pinned Tabs you have set when you close Firefox will open as Pinned Tabs when you start Firefox again. Links to other websites open in a new tab so that your Pinned Tab doesn't change. Many web apps already do this, but a Pinned Tab will make this happen even when the website isn't set to do it. I have problems If you're unable to keep your Pinned Tabs after having restarted Firefox, see Troubleshooting Session Restore .",
  "products": [
    "firefox"
  ],
  "topics": [
    "bookmarks",
    "browse",
    "tabs"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4707,
    "text_bytes": 2230,
    "word_count": 420,
    "downloaded_at": "2025-08-26T10:35:07.029588"
  }
}