{
  "slug": "pop-blocker-settings-exceptions-troubleshooting",
  "title": "Pop-up blocker settings, exceptions and troubleshooting",
  "summary": "Learn what pop-up windows are and what settings Firefox has for blocking or allowing them.",
  "url": "https://support.mozilla.org/en-US/kb/pop-blocker-settings-exceptions-troubleshooting",
  "html": "<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-are-pop-ups\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What are pop-ups?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_pop-up-blocker-settings\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Pop-up blocker settings</span></a></li><li class=\"toclevel-1\"><a href=\"#w_pop-ups-not-being-blocked\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Pop-ups not being blocked</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_is-the-pop-up-coming-from-firefox\"><span class=\"tocnumber\">3.1</span> <span class=\"toctext\">Is the pop-up coming from Firefox?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_is-the-pop-up-blocker-on-and-enabled-for-this-site\"><span class=\"tocnumber\">3.2</span> <span class=\"toctext\">Is the pop-up blocker on and enabled for this site?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_is-the-pop-up-shown-after-a-mouse-click-or-a-key-press\"><span class=\"tocnumber\">3.3</span> <span class=\"toctext\">Is the pop-up shown after a mouse click or a key press?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_is-it-a-true-pop-up-window\"><span class=\"tocnumber\">3.4</span> <span class=\"toctext\">Is it a true pop-up window?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_mozilla-surveys\"><span class=\"tocnumber\">3.5</span> <span class=\"toctext\">Mozilla surveys</span></a></li></ul></li></ul></div>\n<h1 id=\"w_what-are-pop-ups\">What are pop-ups?</h1>\n<p>Pop-up windows, or pop-ups, are windows that appear automatically without your permission. They vary in size, but usually don't cover the whole screen. Some pop-ups open on top of the current Firefox window, while others appear underneath Firefox (pop-unders).\n</p><p>Firefox allows you to control both pop-ups and pop-unders in Firefox Settings\n. Pop-up blocking is turned on by default, so you don't have to worry about enabling it to prevent pop-ups from appearing in Firefox.\n</p><p>When blocking a pop-up, Firefox displays an information bar (if it hasn’t been previously dismissed – see below), as well as an icon <img alt=\"popup_icon_fx57\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2017-10-19-02-15-43-1de510.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the address bar.\n</p><p><span class=\"for\" data-for=\"win\"><img alt=\"PopupFx89\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-08-26-08-50-26-8eff36.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"mac,linux\"><img alt=\"Fx90Popup-mac\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-08-29-07-02-57-268cef.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</p><p>When you click either the <span class=\"button\"><span class=\"for\" data-for=\"win\">Options</span><span class=\"for\" data-for=\"mac,linux\">Preferences</span></span> button in the info bar or the icon in the address bar, a menu is displayed with the following choices:\n</p>\n<ul><li><span class=\"menu\">Allow/Block pop-ups for &lt;<em>website address</em>&gt;</span>\n</li><li><span class=\"menu\">Manage <a href=\"#w_pop-up-blocker-settings\">pop-up settings…</a></span>\n</li><li><span class=\"menu\">Don't show this message when pop-ups are blocked</span>\n</li><li><span class=\"menu\">Show &lt;<em>pop-up web address</em>&gt;</span>\n</li></ul>\n<div class=\"note\"><strong>Blocking pop-ups may interfere with some websites:</strong> Some websites, including some banking sites, use pop-ups for important features. Blocking all pop-ups disables such features. To allow specific websites to use pop-ups, while still blocking all others, you can add those specific websites to the list of allowed sites.\n<strong>Blocking pop-ups doesn't always work:</strong> Although Firefox blocks most pop-ups, some websites may show pop-ups using uncovered methods, even when they are blocked.</div>\n<h1 id=\"w_pop-up-blocker-settings\">Pop-up blocker settings</h1>\n<p>To access the pop-up blocker settings:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Select the <span class=\"menu\">Privacy &amp; Security</span> panel.\n</li><li>Go down to the <em>Permissions</em> section.\n<ul><li>Uncheck the box next to <strong>Block pop-up windows</strong> to disable the pop-up blocker altogether.\n</li><li> Click the <span class=\"button\">Exceptions…</span> button to the right of <strong>Block pop-up windows</strong> to open a dialog box to choose which sites are allowed to display pop-ups.\n</li></ul>\n<dl><dt><img alt=\"Allowed Websites Pop-ups\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-11-03-07-43-17-59e222.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\">\n</dt></dl>\n</li></ol>\n<p>The dialog box offers you the following choices:\n</p>\n<ul><li>Type or paste the address of a website and click the <span class=\"button\">Allow</span> button to add it to the list of sites that will be allowed to open pop-up windows.\n</li><li>Select a website from the list and click the <span class=\"button\">Remove Website</span> button to remove it from the exceptions list.\n</li><li>Click the <span class=\"button\">Remove All Websites</span> button to remove all websites from the exceptions list.\n</li></ul>\n<p>Click the <span class=\"button\">Save Changes</span> button to apply your changes.\n</p>\n<h1 id=\"w_pop-ups-not-being-blocked\">Pop-ups not being blocked</h1>\n<h2 id=\"w_is-the-pop-up-coming-from-firefox\">Is the pop-up coming from Firefox?</h2>\n<p>The pop-up may not actually be coming from Firefox. You can determine where the pop-up is coming from by the appearance of the window.\n</p>\n<ul><li>If you see the address bar with the <em>Tracking Protection</em> button <img alt=\"Fx89ShieldIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-05-12-06-f2679d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and the <em>Site Identity</em> button <img alt=\"Fx89Padlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-33-33-7bdc86.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the pop-up window, the pop-up is coming from Firefox.\n</li><li>If you don't see these buttons, you may have malware on your computer that causes the pop-ups. For help, see <a href=\"/en-US/kb/troubleshoot-firefox-issues-caused-malware\">Troubleshoot Firefox issues caused by malware</a>.\n</li></ul>\n<h2 id=\"w_is-the-pop-up-blocker-on-and-enabled-for-this-site\">Is the pop-up blocker on and enabled for this site?</h2>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Select the <span class=\"menu\">Privacy &amp; Security</span> panel and go to the <em>Permissions</em> section.\n</li><li>Make sure the <strong>Block pop-up windows</strong> checkbox is checked.\n</li><li>To the right of <em>Block pop-up windows</em>, click the <span class=\"button\">Exceptions…</span> button. A dialog box will open with a list of sites that are allowed to show pop-ups.\n</li><li>If the site that's opening pop-ups is listed here, select it and click <span class=\"button\">Remove Website</span>.\n</li><li>Click on <span class=\"button\">Save Changes</span> to update your changes.\n</li><li>Close the <span class=\"menu\">Settings</span> page. Any changes you've made will automatically be saved.\n\n</li></ol>\n<h2 id=\"w_is-the-pop-up-shown-after-a-mouse-click-or-a-key-press\">Is the pop-up shown after a mouse click or a key press?</h2>\n<p>Certain events, such as clicking or pressing a key, can spawn pop-ups regardless of if the pop-up blocker is on. This is intentional, so that Firefox doesn't block pop-ups that websites need to work.\n</p>\n<h2 id=\"w_is-it-a-true-pop-up-window\">Is it a true pop-up window?</h2>\n<p>Sometimes ads are designed to look like windows, but really aren't. Firefox's pop-up blocker can't stop these ads.\n</p>\n<h2 id=\"w_mozilla-surveys\">Mozilla surveys</h2>\n<p>When you visit a Mozilla website, sometimes you'll see a pop-up asking you to participate in a survey. The only third-party that Mozilla ever uses for surveys is <a href=\"https://www.alchemer.com/\">Alchemer</a> (formerly SurveyGizmo), which has been vetted by our legal and privacy teams. The Firefox pop-up blocker doesn't block these pop-ups.\n</p>",
  "text": "Table of Contents 1 What are pop-ups? 2 Pop-up blocker settings 3 Pop-ups not being blocked 3.1 Is the pop-up coming from Firefox? 3.2 Is the pop-up blocker on and enabled for this site? 3.3 Is the pop-up shown after a mouse click or a key press? 3.4 Is it a true pop-up window? 3.5 Mozilla surveys What are pop-ups? Pop-up windows, or pop-ups, are windows that appear automatically without your permission. They vary in size, but usually don't cover the whole screen. Some pop-ups open on top of the current Firefox window, while others appear underneath Firefox (pop-unders). Firefox allows you to control both pop-ups and pop-unders in Firefox Settings . Pop-up blocking is turned on by default, so you don't have to worry about enabling it to prevent pop-ups from appearing in Firefox. When blocking a pop-up, Firefox displays an information bar (if it hasn’t been previously dismissed – see below), as well as an icon in the address bar. When you click either the Options Preferences button in the info bar or the icon in the address bar, a menu is displayed with the following choices: Allow/Block pop-ups for < website address > Manage pop-up settings… Don't show this message when pop-ups are blocked Show < pop-up web address > Blocking pop-ups may interfere with some websites: Some websites, including some banking sites, use pop-ups for important features. Blocking all pop-ups disables such features. To allow specific websites to use pop-ups, while still blocking all others, you can add those specific websites to the list of allowed sites. Blocking pop-ups doesn't always work: Although Firefox blocks most pop-ups, some websites may show pop-ups using uncovered methods, even when they are blocked. Pop-up blocker settings To access the pop-up blocker settings: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select the Privacy & Security panel. Go down to the Permissions section. Uncheck the box next to Block pop-up windows to disable the pop-up blocker altogether. Click the Exceptions… button to the right of Block pop-up windows to open a dialog box to choose which sites are allowed to display pop-ups. The dialog box offers you the following choices: Type or paste the address of a website and click the Allow button to add it to the list of sites that will be allowed to open pop-up windows. Select a website from the list and click the Remove Website button to remove it from the exceptions list. Click the Remove All Websites button to remove all websites from the exceptions list. Click the Save Changes button to apply your changes. Pop-ups not being blocked Is the pop-up coming from Firefox? The pop-up may not actually be coming from Firefox. You can determine where the pop-up is coming from by the appearance of the window. If you see the address bar with the Tracking Protection button and the Site Identity button in the pop-up window, the pop-up is coming from Firefox. If you don't see these buttons, you may have malware on your computer that causes the pop-ups. For help, see Troubleshoot Firefox issues caused by malware . Is the pop-up blocker on and enabled for this site? In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select the Privacy & Security panel and go to the Permissions section. Make sure the Block pop-up windows checkbox is checked. To the right of Block pop-up windows , click the Exceptions… button. A dialog box will open with a list of sites that are allowed to show pop-ups. If the site that's opening pop-ups is listed here, select it and click Remove Website . Click on Save Changes to update your changes. Close the Settings page. Any changes you've made will automatically be saved. Is the pop-up shown after a mouse click or a key press? Certain events, such as clicking or pressing a key, can spawn pop-ups regardless of if the pop-up blocker is on. This is intentional, so that Firefox doesn't block pop-ups that websites need to work. Is it a true pop-up window? Sometimes ads are designed to look like windows, but really aren't. Firefox's pop-up blocker can't stop these ads. Mozilla surveys When you visit a Mozilla website, sometimes you'll see a pop-up asking you to participate in a survey. The only third-party that Mozilla ever uses for surveys is Alchemer (formerly SurveyGizmo), which has been vetted by our legal and privacy teams. The Firefox pop-up blocker doesn't block these pop-ups.",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 10228,
    "text_bytes": 4625,
    "word_count": 790,
    "downloaded_at": "2025-08-26T09:04:08.440313"
  }
}