{
  "slug": "privacy-preserving-attribution",
  "title": "Privacy-Preserving Attribution",
  "summary": "Firefox 128 introduces privacy-preserving attribution, allowing advertisers to measure campaign performance while protecting user privacy.",
  "url": "https://support.mozilla.org/en-US/kb/privacy-preserving-attribution",
  "html": "<p>Privacy-preserving attribution (PPA) is an experimental feature shipping in <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 128.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-is-attribution\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What is attribution?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-does-privacy-preserving-attribution-protect-my-data\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How does privacy-preserving attribution protect my data?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_in-what-conditions-is-privacy-preserving-attribution-used\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">In what conditions is privacy-preserving attribution used?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-can-i-disable-ppa\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">How can I disable PPA?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<p>Mozilla is prototyping this feature in order to inform an emerging Web standard designed to help sites understand how their ads perform without collecting data about individual people. By offering sites a non-invasive alternative to cross-site tracking, we hope to achieve a significant reduction in this harmful practice across the web. To opt out, you can disable PPA by following <a href=\"#w_how-can-i-disable-ppa\">these steps</a>.\n</p>\n<h1 id=\"w_what-is-attribution\">What is attribution?</h1>\n<p>Attribution is how advertisers learn whether their advertising works. Attribution measures how many people saw an ad on a website and then later visited the advertiser’s website to do something the advertiser cared about. For example, maybe someone sees an ad for a sale on a product, then buys that product. Attribution counts how many people do that.\n</p><p>Attribution is very important to advertisers. Sadly, <a href=\"https://wiki.mozilla.org/Security/Anti_tracking_policy\">tracking</a> is the only way to perform attribution without help from the browser. Tracking is terrible for privacy, because it gives companies detailed information about what you do online. While Firefox includes many privacy protections that make it more difficult for sites to track you online (<a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a>, <a href=\"/en-US/kb/introducing-total-cookie-protection-standard-mode\">Total Cookie Protection</a>, <a href=\"https://firefox-source-docs.mozilla.org/toolkit/components/antitracking/anti-tracking/query-stripping/index.html\">Query Parameter Stripping</a> and <a href=\"https://www.mozilla.org/firefox/features/private/\">many other measures</a>), there’s a huge incentive for sites to find ways around these in order to perform attribution.\n</p><p>Our hope is that if we develop a good attribution solution, it will offer a real alternative to more objectionable practices like tracking. We are currently testing this approach to see if it can provide advertisers with the information they're looking for.\n</p>\n<h1 id=\"w_how-does-privacy-preserving-attribution-protect-my-data\">How does privacy-preserving attribution protect my data?</h1>\n<p>PPA does not involve websites tracking you. Instead, your browser is in control. This means strong privacy safeguards, including the option to not participate.\n</p><p>Privacy-preserving attribution works as follows:\n</p>\n<ol><li>Websites that show you ads can ask Firefox to remember these ads. When this happens, Firefox stores an “impression” which contains a little bit of information about the ad, including a destination website.\n</li><li>If you visit the destination website and do something that the website considers to be important enough to count (a “conversion”), that website can ask Firefox to generate a report. The destination website specifies what ads it is interested in.\n</li><li>Firefox creates a report based on what the website asks, but does not give the result to the website. Instead, Firefox encrypts the report and anonymously submits it using the <a href=\"https://datatracker.ietf.org/doc/html/draft-ietf-ppm-dap\">Distributed Aggregation Protocol (DAP)</a> to an “aggregation service”.\n</li><li>Your results are combined with many similar reports by the aggregation service. The destination website periodically receives a summary of the reports. The summary includes noise that provides <a href=\"https://en.wikipedia.org/wiki/Differential_privacy\">differential privacy</a>.\n</li></ol>\n<p>This approach has a lot of advantages over legacy attribution methods, which involve many companies learning a lot about what you do online.\n</p><p>PPA does not involve sending information about your browsing activities to anyone. This includes Mozilla and our DAP partner (<a href=\"https://www.isrg.org/\">ISRG</a>). Advertisers only receive aggregate information that answers basic questions about the effectiveness of their advertising.\n</p><p>If you want to understand the specifics of how this feature protects your privacy, you can dive into the technical details in our <a href=\"https://blog.mozilla.org/en/mozilla/privacy-preserving-attribution-for-advertising/\">February 2022 announcement</a>, this <a href=\"https://blog.mozilla.org/netpolicy/2024/08/22/ppa-update/\">August 2024 blog post</a> and this <a href=\"https://github.com/mozilla/explainers/tree/main/ppa-experiment\">technical explaination</a>.\n</p>\n<h1 id=\"w_in-what-conditions-is-privacy-preserving-attribution-used\">In what conditions is privacy-preserving attribution used?</h1>\n<p>PPA is enabled in Firefox starting in version 128. A small number of sites are going to test this and provide feedback to inform our standardization plans, and help us understand if this is likely to gain traction.\n</p>\n<h1 id=\"w_how-can-i-disable-ppa\">How can I disable PPA?</h1>\n<p>You can easily disable the privacy-preserving attribution feature in Firefox if you prefer not to participate. When you opt out, websites won’t be informed of your decision.\n</p><p>To opt out, follow these steps:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>In the <span class=\"menu\">Privacy &amp; Security</span> panel, find the <em>Website Advertising Preferences</em> section.\n</li><li>Uncheck the box labeled <strong>Allow websites to perform privacy-preserving ad measurement</strong>.\n</li></ol>\n<dl><dt><img alt=\"Website advertising preferences\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-06-11-05-46-57-25f80a.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/firefox-privacy-and-security-features\">Firefox privacy and security features</a>\n</li><li><a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection in Firefox for desktop</a>\n</li></ul>",
  "text": "Privacy-preserving attribution (PPA) is an experimental feature shipping in Firefox version 128. Table of Contents 1 What is attribution? 2 How does privacy-preserving attribution protect my data? 3 In what conditions is privacy-preserving attribution used? 4 How can I disable PPA? 5 Related articles Mozilla is prototyping this feature in order to inform an emerging Web standard designed to help sites understand how their ads perform without collecting data about individual people. By offering sites a non-invasive alternative to cross-site tracking, we hope to achieve a significant reduction in this harmful practice across the web. To opt out, you can disable PPA by following these steps . What is attribution? Attribution is how advertisers learn whether their advertising works. Attribution measures how many people saw an ad on a website and then later visited the advertiser’s website to do something the advertiser cared about. For example, maybe someone sees an ad for a sale on a product, then buys that product. Attribution counts how many people do that. Attribution is very important to advertisers. Sadly, tracking is the only way to perform attribution without help from the browser. Tracking is terrible for privacy, because it gives companies detailed information about what you do online. While Firefox includes many privacy protections that make it more difficult for sites to track you online ( Enhanced Tracking Protection , Total Cookie Protection , Query Parameter Stripping and many other measures ), there’s a huge incentive for sites to find ways around these in order to perform attribution. Our hope is that if we develop a good attribution solution, it will offer a real alternative to more objectionable practices like tracking. We are currently testing this approach to see if it can provide advertisers with the information they're looking for. How does privacy-preserving attribution protect my data? PPA does not involve websites tracking you. Instead, your browser is in control. This means strong privacy safeguards, including the option to not participate. Privacy-preserving attribution works as follows: Websites that show you ads can ask Firefox to remember these ads. When this happens, Firefox stores an “impression” which contains a little bit of information about the ad, including a destination website. If you visit the destination website and do something that the website considers to be important enough to count (a “conversion”), that website can ask Firefox to generate a report. The destination website specifies what ads it is interested in. Firefox creates a report based on what the website asks, but does not give the result to the website. Instead, Firefox encrypts the report and anonymously submits it using the Distributed Aggregation Protocol (DAP) to an “aggregation service”. Your results are combined with many similar reports by the aggregation service. The destination website periodically receives a summary of the reports. The summary includes noise that provides differential privacy . This approach has a lot of advantages over legacy attribution methods, which involve many companies learning a lot about what you do online. PPA does not involve sending information about your browsing activities to anyone. This includes Mozilla and our DAP partner ( ISRG ). Advertisers only receive aggregate information that answers basic questions about the effectiveness of their advertising. If you want to understand the specifics of how this feature protects your privacy, you can dive into the technical details in our February 2022 announcement , this August 2024 blog post and this technical explaination . In what conditions is privacy-preserving attribution used? PPA is enabled in Firefox starting in version 128. A small number of sites are going to test this and provide feedback to inform our standardization plans, and help us understand if this is likely to gain traction. How can I disable PPA? You can easily disable the privacy-preserving attribution feature in Firefox if you prefer not to participate. When you opt out, websites won’t be informed of your decision. To opt out, follow these steps: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the Privacy & Security panel, find the Website Advertising Preferences section. Uncheck the box labeled Allow websites to perform privacy-preserving ad measurement . Related articles Firefox privacy and security features Enhanced Tracking Protection in Firefox for desktop",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 7754,
    "text_bytes": 4632,
    "word_count": 724,
    "downloaded_at": "2025-08-26T10:56:48.066137"
  }
}