{
  "slug": "push-notifications-firefox",
  "title": "Web Push notifications in Firefox",
  "summary": "Web Push allows websites to notify users of new messages or updated content while Firefox is open.",
  "url": "https://support.mozilla.org/en-US/kb/push-notifications-firefox",
  "html": "<p>\n<em>Web Push</em> allows websites to notify you of new messages or updated content. While Firefox is open, websites which have been granted permission can send notifications to your browser, which displays them on the screen. Notifications only display when you press a key on your keyboard or tap/click anywhere on the website that you are accessing. If you have not interacted with the website, then the <strong>Notification</strong> permission <img alt=\"Notifications icon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-11-28-22-48-28-d1b914.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> icon will only display in the address bar; the actual notification will not display. You can easily allow or disable notifications and control how they appear.\n</p>\n<dl><dt><img alt=\"Push_notifications\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-04-14-08-10-16-b009c9.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_upgraded-notifications\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Upgraded Notifications</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-is-web-push\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">What is Web Push?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-does-it-work\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How does it work?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-information-do-i-share-with-a-website\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">What information do I share with a website?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-information-does-firefox-use-to-provide-web-push\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">What information does Firefox use to provide Web Push?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-revoke-web-push-permissions-for-a-specific-site\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">How do I revoke Web Push permissions for a specific site?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-add-web-push-to-my-website\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">How do I add Web Push to my website?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-stop-firefox-asking-me-to-allow-notifications\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">How do I stop Firefox asking me to allow notifications?</span></a></li></ul></div>\n<h1 id=\"w_upgraded-notifications\">Upgraded Notifications</h1>\n<p>Firefox can deliver on-screen notifications even when that site is not loaded. Using the Push API, a <a href=\"https://www.w3.org/TR/push-api/\">W3C standard</a>, Firefox receives a push message and can show notifications (if permitted by the user) at any time. Sites can also use Push to update data in the background, even without showing you a notification. If you already gave permission to a site to send notifications, the site will also be able to use the Push API. You can choose whether or not to give permission for a specific website by following these instructions:\n</p>\n<ol><li> Click the padlock <img alt=\"Padlock Fx89\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-04-14-08-11-15-d618d9.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the address bar.\n</li><li> Click the arrow in the <strong>Site Information</strong> drop-down panel.\n</li><li> Click <span class=\"button\">More information</span> in the next panel to bring up the <a href=\"/en-US/kb/firefox-page-info-window\">Page Info window</a>.\n</li><li> Click the <strong>Permissions</strong> tab.\n</li><li> Under <em>Send Notifications</em>, choose a notification option: <span class=\"menu\">Always Ask</span>, <span class=\"menu\">Allow</span> or <span class=\"menu\">Block</span>. If your choices are grayed out, deselect the <strong>Use Default</strong> checkbox.\n</li></ol>\n<p>Alternatively, you can:\n</p>\n<ol><li> <span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li> Click <span class=\"menu\">Privacy &amp; Security</span> from the left panel.\n</li><li> Scroll to the <em>Permissions</em> section.\n</li><li> Click the <span class=\"button\">Settings…</span> button to the right of <strong>Notifications</strong>.\n</li><li> Select <strong>Allow</strong> or <strong>Block</strong> from the <strong>Status</strong> drop-down for any of the websites.\n</li><li> Click the <span class=\"button\">Save Changes</span> button.\n</li></ol>\n<h1 id=\"w_what-is-web-push\">What is Web Push?</h1>\n<p>Web Push is an optional feature that allows websites to send you messages even when the site is not loaded. Sites can use this feature to provide you with notifications or update data in the background.\n</p><p>For example, you can subscribe to notifications from your favorite shopping websites that can notify you of new promotions or offers. You can subscribe to notifications from different websites. A concert site may offer you notifications for shows of your favorite band. You decide to allow that site to notify you, and a week later you get a notification that your band is on tour.\n</p><p>You will only receive messages from sites that you have granted permission.\n</p>\n<h1 id=\"w_how-does-it-work\">How does it work?</h1>\n<p>Websites can install a <a href=\"https://developer.mozilla.org/docs/Web/API/Service_Worker_API\">Service Worker</a>, a background web page with a limited set of functionality, that can subscribe to the push service. The website can then send a push message through Mozilla’s Web Push service to your browser, which can process that message and display a notification on your screen.\n</p>\n<dl><dt><img alt=\"push notification 44\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2016-01-22-13-08-43-059641.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"420\">\n</dt></dl>\n<p>Clicking the notification can open a website or switch to that site’s tab if loaded.\n</p>\n<h1 id=\"w_what-information-do-i-share-with-a-website\">What information do I share with a website?</h1>\n<p>A website that has been granted permissions can send you push messages when the site is not loaded. A quota limits the number of push messages without an on-screen notification that websites can send you. Websites that exceed the quota will have its push messaging disabled and the user must revisit the website again to resubscribe. Web Push does not directly allow websites to determine your IP address.\n</p>\n<h1 id=\"w_what-information-does-firefox-use-to-provide-web-push\">What information does Firefox use to provide Web Push?</h1>\n<p>Firefox maintains an active connection to a push service in order to receive push messages as long as it is open. The connection ends when Firefox is closed. We store a randomized identifier (User Agent IDentifier or UAID) on our server for your browser, along with a random client-generated identifier for each push subscription.  When you have any subscriptions, the UAID is required to allow our push service to route incoming messages to Firefox. If you don't have any active push notification subscriptions, Firefox rotates the UAID on each new connection.\n</p><p>On Firefox for desktop, the push service is operated by Mozilla. Firefox for Android uses a combination of the Mozilla Web Push service and Google’s Cloud Messaging platform to deliver notifications to Firefox for Android. Only Mozilla's applications are enabled to use WebPush on iOS (third-parties are prohibited from using WebPush to send notifications to iOS per the iOS usage agreement).\n</p><p>In all three cases, push messages are encrypted per the <a href=\"https://tools.ietf.org/html/rfc8030\">IETF spec</a>, and only your copy of Firefox can decipher them. The encrypted messages are stored on the server until they are delivered or expired.\n</p><p>We store your IP address for 90 days as part of this service. The stored information is invalidated when either the IP Address or UAID is changed. We do <strong>not</strong> store information about:\n</p>\n<ul><li>the servers and/or services that have sent messages\n</li><li>when a particular user agent was online/active\n</li></ul>\n<h1 id=\"w_how-do-i-revoke-web-push-permissions-for-a-specific-site\">How do I revoke Web Push permissions for a specific site?</h1>\n<p>Web Push is always opt-in in Firefox. A site cannot send you push messages without your permission. To stop a specific site from sending you push messages:\n</p>\n<ol><li> <span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li> Click <span class=\"menu\">Privacy &amp; Security</span> from the left panel.\n</li><li> Scroll to the <em>Permissions</em> section.\n</li><li> Click the <span class=\"button\">Settings…</span> button next to <strong>Notifications</strong>.\n</li><li> Select the website.\n</li><li> Click the <span class=\"button\">Remove Website</span> button.\n</li></ol>\n<p>To stop all sites from sending you push messages, follow the steps above but instead of selecting a specific site, click the <span class=\"button\">Remove All Websites</span> button. Websites will not be able to send you messages and will need to ask your permission to send them in the future.\n</p>\n<div class=\"note\"><strong>To stop notifications on a specific webpage (requires a page reload):</strong> Click the Permissions icon <img alt=\"Fx89PermissionsIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-10-05-34-30-47c30e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to bring up the <a href=\"/en-US/kb/site-permissions-panel\">Site Permissions panel</a> for the website, find the <em>Send Notifications</em> permission and click the <strong>✕</strong> next to <em>Allowed</em> to remove the permission.</div>\n<h1 id=\"w_how-do-i-add-web-push-to-my-website\">How do I add Web Push to my website?</h1>\n<p>The <a href=\"https://developer.mozilla.org/docs/Web/API/Push_API\">Push API specification</a> explains how to create a Service Worker and send push messages.\n</p>\n<h1 id=\"w_how-do-i-stop-firefox-asking-me-to-allow-notifications\">How do I stop Firefox asking me to allow notifications?</h1>\n<p>If a site indicates to Firefox that it wants to show notifications, by default, Firefox asks whether you want to grant permission. You can set Firefox to automatically deny permission without asking. Even after the change, you can make exceptions for sites <strong>you want</strong> to show notifications or use push features.\n</p>\n<ol><li> <span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li> Click <span class=\"menu\">Privacy &amp; Security</span> from the left panel.\n</li><li> Scroll to the <em>Permissions</em> section.\n</li><li> Click the <span class=\"button\">Settings…</span> button to the right of <strong>Notifications</strong>.\n<dl><dt><img alt=\"Fx59Permissions-NotificationSettings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2018-04-09-09-06-49-fc7acb.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> Select the <strong>Block new requests asking to allow notifications</strong> checkbox. \n</li><li> Click the <span class=\"button\">Save Changes</span> button.\n</li></ol>",
  "text": "Web Push allows websites to notify you of new messages or updated content. While Firefox is open, websites which have been granted permission can send notifications to your browser, which displays them on the screen. Notifications only display when you press a key on your keyboard or tap/click anywhere on the website that you are accessing. If you have not interacted with the website, then the Notification permission icon will only display in the address bar; the actual notification will not display. You can easily allow or disable notifications and control how they appear. Table of Contents 1 Upgraded Notifications 2 What is Web Push? 3 How does it work? 4 What information do I share with a website? 5 What information does Firefox use to provide Web Push? 6 How do I revoke Web Push permissions for a specific site? 7 How do I add Web Push to my website? 8 How do I stop Firefox asking me to allow notifications? Upgraded Notifications Firefox can deliver on-screen notifications even when that site is not loaded. Using the Push API, a W3C standard , Firefox receives a push message and can show notifications (if permitted by the user) at any time. Sites can also use Push to update data in the background, even without showing you a notification. If you already gave permission to a site to send notifications, the site will also be able to use the Push API. You can choose whether or not to give permission for a specific website by following these instructions: Click the padlock in the address bar. Click the arrow in the Site Information drop-down panel. Click More information in the next panel to bring up the Page Info window . Click the Permissions tab. Under Send Notifications , choose a notification option: Always Ask , Allow or Block . If your choices are grayed out, deselect the Use Default checkbox. Alternatively, you can: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Click Privacy & Security from the left panel. Scroll to the Permissions section. Click the Settings… button to the right of Notifications . Select Allow or Block from the Status drop-down for any of the websites. Click the Save Changes button. What is Web Push? Web Push is an optional feature that allows websites to send you messages even when the site is not loaded. Sites can use this feature to provide you with notifications or update data in the background. For example, you can subscribe to notifications from your favorite shopping websites that can notify you of new promotions or offers. You can subscribe to notifications from different websites. A concert site may offer you notifications for shows of your favorite band. You decide to allow that site to notify you, and a week later you get a notification that your band is on tour. You will only receive messages from sites that you have granted permission. How does it work? Websites can install a Service Worker , a background web page with a limited set of functionality, that can subscribe to the push service. The website can then send a push message through Mozilla’s Web Push service to your browser, which can process that message and display a notification on your screen. Clicking the notification can open a website or switch to that site’s tab if loaded. What information do I share with a website? A website that has been granted permissions can send you push messages when the site is not loaded. A quota limits the number of push messages without an on-screen notification that websites can send you. Websites that exceed the quota will have its push messaging disabled and the user must revisit the website again to resubscribe. Web Push does not directly allow websites to determine your IP address. What information does Firefox use to provide Web Push? Firefox maintains an active connection to a push service in order to receive push messages as long as it is open. The connection ends when Firefox is closed. We store a randomized identifier (User Agent IDentifier or UAID) on our server for your browser, along with a random client-generated identifier for each push subscription. When you have any subscriptions, the UAID is required to allow our push service to route incoming messages to Firefox. If you don't have any active push notification subscriptions, Firefox rotates the UAID on each new connection. On Firefox for desktop, the push service is operated by Mozilla. Firefox for Android uses a combination of the Mozilla Web Push service and Google’s Cloud Messaging platform to deliver notifications to Firefox for Android. Only Mozilla's applications are enabled to use WebPush on iOS (third-parties are prohibited from using WebPush to send notifications to iOS per the iOS usage agreement). In all three cases, push messages are encrypted per the IETF spec , and only your copy of Firefox can decipher them. The encrypted messages are stored on the server until they are delivered or expired. We store your IP address for 90 days as part of this service. The stored information is invalidated when either the IP Address or UAID is changed. We do not store information about: the servers and/or services that have sent messages when a particular user agent was online/active How do I revoke Web Push permissions for a specific site? Web Push is always opt-in in Firefox. A site cannot send you push messages without your permission. To stop a specific site from sending you push messages: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Click Privacy & Security from the left panel. Scroll to the Permissions section. Click the Settings… button next to Notifications . Select the website. Click the Remove Website button. To stop all sites from sending you push messages, follow the steps above but instead of selecting a specific site, click the Remove All Websites button. Websites will not be able to send you messages and will need to ask your permission to send them in the future. To stop notifications on a specific webpage (requires a page reload): Click the Permissions icon to bring up the Site Permissions panel for the website, find the Send Notifications permission and click the ✕ next to Allowed to remove the permission. How do I add Web Push to my website? The Push API specification explains how to create a Service Worker and send push messages. How do I stop Firefox asking me to allow notifications? If a site indicates to Firefox that it wants to show notifications, by default, Firefox asks whether you want to grant permission. You can set Firefox to automatically deny permission without asking. Even after the change, you can make exceptions for sites you want to show notifications or use push features. In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Click Privacy & Security from the left panel. Scroll to the Permissions section. Click the Settings… button to the right of Notifications . Select the Block new requests asking to allow notifications checkbox. Click the Save Changes button.",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse",
    "notifications",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 13774,
    "text_bytes": 7301,
    "word_count": 1246,
    "downloaded_at": "2025-08-26T10:37:00.834168"
  }
}