{
  "slug": "re-enable-add-ons-disabled-when-updating",
  "title": "Re-enable add-ons that were disabled when updating Firefox",
  "summary": "Many add-ons are automatically compatible with the latest Firefox. For those that aren't, we'll show you how to search for new versions or find an alternative.",
  "url": "https://support.mozilla.org/en-US/kb/re-enable-add-ons-disabled-when-updating",
  "html": "<p>When you update Firefox, it automatically checks your add-ons and updates them to compatible versions when possible. If an add-on can't be updated and is no longer compatible, Firefox turns it off. This article shows you how to update those add-ons and get them working again.\n</p>\n<div class=\"note\"><strong>Note:</strong> If an add-on is disabled and displays a message, <em>(Add-on name) could not be verified for use in Firefox</em>, see <a href=\"/en-US/kb/add-on-signing-in-firefox\">Add-on signing in Firefox</a> and <a href=\"/en-US/kb/root-certificate-expiration\">Update Firefox to prevent add-ons issues from root certificate expiration</a>.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_check-for-new-versions-of-your-add-ons\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Check for new versions of your add-ons</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_search-for-updates-on-the-add-ons-website\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Search for updates on the add-on's website</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_search-for-alternatives\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Search for alternatives</span></a></li></ul></div>\n<h1 id=\"w_check-for-new-versions-of-your-add-ons\">Check for new versions of your add-ons</h1>\n<p>Firefox checks for new versions of your add-ons once a day and updates them automatically. You can manually check for new versions at any time.\n</p>\n<ol><li> Click on the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to expand the menu panel.\n</li><li> <span class=\"for\" data-for=\"not fx140\">Click <span class=\"menu\">Add-ons and themes</span>. The <em>Add-ons Manager</em> page will open.</span><span class=\"for\" data-for=\"fx140\">Click <span class=\"menu\">Extensions and themes</span>. The <em>Add-ons Manager</em> page will open.</span>\n</li><li> Click <img alt=\"Fx91UpdateAddonIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-11-18-04-15-43-04bbcc.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> on the <em>Add-ons Manager</em> page and select <span class=\"menu\">Check for Updates</span>. If Firefox finds updates, they will be downloaded automatically.\n</li><li> Click <span class=\"button\">Update Now</span> or restart Firefox to complete the update.\n</li></ol>\n<h2 id=\"w_search-for-updates-on-the-add-ons-website\">Search for updates on the add-on's website</h2>\n<p>Some add-on authors have different versions of their add-on for different versions of Firefox, so updating through the Add-on Manager doesn't work. In this case, an update might be available on the add-on's website.\n</p>\n<ol><li> In the Add-ons Manager, find the incompatible add-on on the list.\n</li><li> Click the ellipsis <img alt=\"Fx107-Addons-3dotIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-11-18-07-04-19-9b6f89.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> (3-dot) icon and select <span class=\"menu\">Manage</span> to see details about that add-on.\n</li><li> Click on the link next to <em>Homepage</em>. You will be taken to the home page for that add-on.\n</li><li> Download the latest version of the add-on from the add-on home page.\n</li></ol>\n<div class=\"note\"><strong>Note:</strong> If there isn't a version of the add-on available that works, it might help to contact the makers of the add-on while you are on their website.</div>\n<h1 id=\"w_search-for-alternatives\">Search for alternatives</h1>\n<p>There may be other add-ons with similar features that are compatible with your version of Firefox. The <a href=\"https://addons.mozilla.org\">Add-ons site</a> is a good place to find alternatives.\n</p>",
  "text": "When you update Firefox, it automatically checks your add-ons and updates them to compatible versions when possible. If an add-on can't be updated and is no longer compatible, Firefox turns it off. This article shows you how to update those add-ons and get them working again. Note: If an add-on is disabled and displays a message, (Add-on name) could not be verified for use in Firefox , see Add-on signing in Firefox and Update Firefox to prevent add-ons issues from root certificate expiration . Table of Contents 1 Check for new versions of your add-ons 1.1 Search for updates on the add-on's website 2 Search for alternatives Check for new versions of your add-ons Firefox checks for new versions of your add-ons once a day and updates them automatically. You can manually check for new versions at any time. Click on the menu button to expand the menu panel. Click Add-ons and themes . The Add-ons Manager page will open. Click Extensions and themes . The Add-ons Manager page will open. Click on the Add-ons Manager page and select Check for Updates . If Firefox finds updates, they will be downloaded automatically. Click Update Now or restart Firefox to complete the update. Search for updates on the add-on's website Some add-on authors have different versions of their add-on for different versions of Firefox, so updating through the Add-on Manager doesn't work. In this case, an update might be available on the add-on's website. In the Add-ons Manager, find the incompatible add-on on the list. Click the ellipsis (3-dot) icon and select Manage to see details about that add-on. Click on the link next to Homepage . You will be taken to the home page for that add-on. Download the latest version of the add-on from the add-on home page. Note: If there isn't a version of the add-on available that works, it might help to contact the makers of the add-on while you are on their website. Search for alternatives There may be other add-ons with similar features that are compatible with your version of Firefox. The Add-ons site is a good place to find alternatives.",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4227,
    "text_bytes": 2077,
    "word_count": 356,
    "downloaded_at": "2025-08-26T09:04:26.841871"
  }
}