{
  "slug": "recommendations-firefox",
  "title": "Recommendations from Firefox",
  "summary": "This article describes why and how extension recommendations are made, including how to turn off recommendations.",
  "url": "https://support.mozilla.org/en-US/kb/recommendations-firefox",
  "html": "<p>While you're exploring the web with Firefox, the browser may present you with suggestions for features and extensions, tailored to enhance your online experience. These recommendations are carefully curated based on the categories of websites you visit, such as suggesting media-related tools if you often access media sites, without the need to track your visits to individual websites.\n</p><p>This approach not only ensures that the recommendations are highly relevant and beneficial to your browsing needs but also prioritizes your privacy by avoiding the logging of specific sites you explore. By combining insights into your general browsing behavior and the type of content you engage with, Firefox's recommendation system aims to introduce useful tools and features that make your online journey smoother and more personalized.\n</p>\n<dl><dt><span class=\"for\" data-for=\"not fx123\"><img alt=\"recommendation button\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-03-04-13-17-28-cfb65b.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"fx123\"><img alt=\"Feature call out\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-02-27-11-06-42-cb7972.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"400\"></span>\n</dt></dl>\n<div class=\"warning\"> Mozilla is committed to protecting your privacy. We do not collect your browsing data nor share it with third parties for the purpose of making these recommendations. The process of selecting appropriate features and extensions is carried out directly on your device, ensuring your information stays private. All suggested extensions undergo Mozilla's rigorous <a href=\"/en-US/kb/recommended-extensions-program\">Recommended Extensions program</a> to ensure their quality and safety.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-kinds-of-features-and-extensions-are-recommended\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What kinds of features and extensions are recommended?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-are-features-and-extensions-selected\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How are features and extensions selected?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_who-benefits-from-these-recommendations\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Who benefits from these recommendations?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-opt-out-of-recommendations-in-firefox\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">How do I opt out of recommendations in Firefox?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_opt-out-of-recommendations-from-a-recommendation-menu\"><span class=\"tocnumber\">4.1</span> <span class=\"toctext\">Opt out of recommendations from a recommendation menu</span></a></li><li class=\"toclevel-2\"><a href=\"#w_opt-out-of-all-recommendations-from-firefox-settings\"><span class=\"tocnumber\">4.2</span> <span class=\"toctext\">Opt out of all recommendations from Firefox settings</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-learn-more-about-extensions\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">How do I learn more about extensions?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_related-content\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Related content</span></a></li></ul></div>\n<h1 id=\"w_what-kinds-of-features-and-extensions-are-recommended\">What kinds of features and extensions are recommended?</h1>\n<p>Firefox may recommend a variety of features, including browser tools and extensions.\n</p>\n<ul><li><strong>Browser tools</strong> are discrete tools built directly into the browser, like <a href=\"/en-US/kb/pinned-tabs-keep-favorite-websites-open\">Pin Tabs</a>, <a href=\"/en-US/kb/firefox-reader-view-clutter-free-web-pages\">Reader View</a> and <a href=\"/en-US/kb/view-pdf-files-firefox-or-choose-another-viewer#w_edit-pdf-files\">PDF edits</a>. Firefox contains a lot of different tools that can improve your browsing experience and workflows through customization and efficiency gains. The recommendation feature aims to introduce you to tools you may not be aware of but could find useful.\n</li><li><strong><a href=\"/en-US/kb/find-and-install-add-ons-add-features-to-firefox\">Extensions</a></strong> allow you to add features to Firefox to customize your browsing experience. Extensions are software programs, most often developed by a third party, that modify the way Firefox works. They’re like apps for the browser, and they can make the tasks you do online simpler and more efficient. Extensions do things like protect passwords, download videos, find deals, block annoying ads and much more. They empower users to customize their browsing experience to fit their needs and personal tastes, making them an important part of Firefox.\n</li></ul>\n<h1 id=\"w_how-are-features-and-extensions-selected\">How are features and extensions selected?</h1>\n<p>Mozilla's process for selecting recommended features and extensions is comprehensive, ensuring that only the highest-quality tools are suggested. This selection, made by Mozilla's expert product and editorial teams, is based strictly on improving functionality, user experience and security. Specifically, for features, we focus on those that are widely appreciated or have the potential to significantly enhance a user's browsing experience online. Importantly, the integrity of this program is maintained by prohibiting paid placements by extension developers, affirming that the recommendations are solely aimed at improving user browsing experiences.\n</p>\n<h1 id=\"w_who-benefits-from-these-recommendations\">Who benefits from these recommendations?</h1>\n<p>Recommendations are strictly intended to provide a better browsing experience for Firefox users like you. We believe that the recommended features and extensions offer unique value, making the browser even more personal and useful.\n</p>\n<h1 id=\"w_how-do-i-opt-out-of-recommendations-in-firefox\">How do I opt out of recommendations in Firefox?</h1>\n<div class=\"for\" data-for=\"not fx123\"><p>If you wish to opt out of receiving recommendations in Firefox, follow the steps below.\n</p>\n<h2 id=\"w_opt-out-of-recommendations-from-a-recommendation-menu\">Opt out of recommendations from a recommendation menu</h2>\n<p>When you view a recommendation, you can click on <span class=\"button\">Not Now</span> to dismiss it, or you can opt out of recommendations using the drop-down menu:\n</p>\n<dl><dt><img alt=\"recommendation dropdown\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-03-04-13-39-58-943359.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<ul><li><strong>Don't Show Me This Recommendation</strong> – opts out of the specific recommendation.\n</li><li><strong>Manage Recommendation Settings</strong> – This option takes you directly to your Firefox settings page, where you can opt out of all recommendations.\n</li></ul>\n</div><div class=\"for\" data-for=\"fx123\"><p>If you wish to opt out of receiving recommendations in Firefox, follow these steps when a feature call-out appears:\n</p>\n<ul><li>Click on the <img alt=\"Feature call out Dismiss dropdown\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-02-27-11-07-19-7001ce.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"100\"> dropdown menu to reveal your options:\n<dl><dt><img alt=\"Recommendations dropdown menu\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-03-06-06-16-27-f55ddc.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"500\">\n</dt></dl>\n<ul><li><strong>Don't show this recommendation again</strong> – Select this to stop receiving this particular recommendation in the future.\n</li><li><strong>Show fewer recommendations</strong> – Choose this to decrease the number of recommendations you receive.\n</li><li><strong>Manage settings</strong> – This option takes you directly to your Firefox settings page, where you can opt out of all recommendations by following the instructions in the next section.\n</li></ul>\n</li></ul>\n</div>\n<h2 id=\"w_opt-out-of-all-recommendations-from-firefox-settings\">Opt out of all recommendations from Firefox settings</h2>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>In the <span class=\"menu\">General</span> panel, go down to the <em>Browsing</em> section.\n<dl><dt><img alt=\"Browsing opt out recommendations\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-02-27-11-20-02-644f4d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"400\">\n</dt></dl>\n</li><li>Uncheck <img alt=\"Unchecked box box\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-02-27-11-17-36-6c3bf2.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"20\"> the box next to <strong>Recommend extensions as you browse</strong> and the box next to <strong>Recommend features as you browse</strong>.\n</li></ol>\n<h1 id=\"w_how-do-i-learn-more-about-extensions\">How do I learn more about extensions?</h1>\n<p>To explore a wide range of extensions, check out <a href=\"https://addons.mozilla.org\">addons.mozilla.org (AMO)</a>. This platform hosts a vast collection of extensions and themes, predominantly developed by independent creators globally.\n</p>\n<h1 id=\"w_related-content\">Related content</h1>\n<ul><li> <a href=\"/en-US/kb/pinned-tabs-keep-favorite-websites-open\">Pinned Tabs - keep favorite websites open and just a click away</a>\n</li><li> <a href=\"/en-US/kb/firefox-reader-view-clutter-free-web-pages\">Firefox Reader View for clutter-free web pages</a>\n</li><li> <a href=\"/en-US/kb/view-pdf-files-firefox-or-choose-another-viewer\">View and edit PDF files using Firefox’s built-in viewer</a>\n</li><li> <a href=\"/en-US/kb/choose-your-preferred-pdf-viewer-firefox\">Choose your preferred PDF viewer in Firefox</a>\n</li></ul>",
  "text": "While you're exploring the web with Firefox, the browser may present you with suggestions for features and extensions, tailored to enhance your online experience. These recommendations are carefully curated based on the categories of websites you visit, such as suggesting media-related tools if you often access media sites, without the need to track your visits to individual websites. This approach not only ensures that the recommendations are highly relevant and beneficial to your browsing needs but also prioritizes your privacy by avoiding the logging of specific sites you explore. By combining insights into your general browsing behavior and the type of content you engage with, Firefox's recommendation system aims to introduce useful tools and features that make your online journey smoother and more personalized. Mozilla is committed to protecting your privacy. We do not collect your browsing data nor share it with third parties for the purpose of making these recommendations. The process of selecting appropriate features and extensions is carried out directly on your device, ensuring your information stays private. All suggested extensions undergo Mozilla's rigorous Recommended Extensions program to ensure their quality and safety. Table of Contents 1 What kinds of features and extensions are recommended? 2 How are features and extensions selected? 3 Who benefits from these recommendations? 4 How do I opt out of recommendations in Firefox? 4.1 Opt out of recommendations from a recommendation menu 4.2 Opt out of all recommendations from Firefox settings 5 How do I learn more about extensions? 6 Related content What kinds of features and extensions are recommended? Firefox may recommend a variety of features, including browser tools and extensions. Browser tools are discrete tools built directly into the browser, like Pin Tabs , Reader View and PDF edits . Firefox contains a lot of different tools that can improve your browsing experience and workflows through customization and efficiency gains. The recommendation feature aims to introduce you to tools you may not be aware of but could find useful. Extensions allow you to add features to Firefox to customize your browsing experience. Extensions are software programs, most often developed by a third party, that modify the way Firefox works. They’re like apps for the browser, and they can make the tasks you do online simpler and more efficient. Extensions do things like protect passwords, download videos, find deals, block annoying ads and much more. They empower users to customize their browsing experience to fit their needs and personal tastes, making them an important part of Firefox. How are features and extensions selected? Mozilla's process for selecting recommended features and extensions is comprehensive, ensuring that only the highest-quality tools are suggested. This selection, made by Mozilla's expert product and editorial teams, is based strictly on improving functionality, user experience and security. Specifically, for features, we focus on those that are widely appreciated or have the potential to significantly enhance a user's browsing experience online. Importantly, the integrity of this program is maintained by prohibiting paid placements by extension developers, affirming that the recommendations are solely aimed at improving user browsing experiences. Who benefits from these recommendations? Recommendations are strictly intended to provide a better browsing experience for Firefox users like you. We believe that the recommended features and extensions offer unique value, making the browser even more personal and useful. How do I opt out of recommendations in Firefox? If you wish to opt out of receiving recommendations in Firefox, follow the steps below. Opt out of recommendations from a recommendation menu When you view a recommendation, you can click on Not Now to dismiss it, or you can opt out of recommendations using the drop-down menu: Don't Show Me This Recommendation – opts out of the specific recommendation. Manage Recommendation Settings – This option takes you directly to your Firefox settings page, where you can opt out of all recommendations. If you wish to opt out of receiving recommendations in Firefox, follow these steps when a feature call-out appears: Click on the dropdown menu to reveal your options: Don't show this recommendation again – Select this to stop receiving this particular recommendation in the future. Show fewer recommendations – Choose this to decrease the number of recommendations you receive. Manage settings – This option takes you directly to your Firefox settings page, where you can opt out of all recommendations by following the instructions in the next section. Opt out of all recommendations from Firefox settings In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the General panel, go down to the Browsing section. Uncheck the box next to Recommend extensions as you browse and the box next to Recommend features as you browse . How do I learn more about extensions? To explore a wide range of extensions, check out addons.mozilla.org (AMO) . This platform hosts a vast collection of extensions and themes, predominantly developed by independent creators globally. Related content Pinned Tabs - keep favorite websites open and just a click away Firefox Reader View for clutter-free web pages View and edit PDF files using Firefox’s built-in viewer Choose your preferred PDF viewer in Firefox",
  "products": [
    "firefox"
  ],
  "topics": [
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 11410,
    "text_bytes": 5613,
    "word_count": 871,
    "downloaded_at": "2025-08-26T10:46:44.260379"
  }
}