{
  "slug": "recover-lost-or-missing-bookmarks",
  "title": "Recover lost or missing Bookmarks",
  "summary": "If your bookmarks have disappeared, it may be possible to recover them. Learn why bookmarks may seem to be missing and how to get them back.",
  "url": "https://support.mozilla.org/en-US/kb/recover-lost-or-missing-bookmarks",
  "html": "<p>If your bookmarks have suddenly disappeared, don't worry - you should be able to recover them. This article explains how to get back your bookmarks if they disappeared unexpectedly.\n</p>\n<ul><li>If you are able to add, delete, and edit your bookmarks but the changes are lost when you restart Firefox, see <a href=\"/en-US/kb/cant-add-change-or-save-bookmarks\">Can't add, change or save bookmarks - How to fix</a>.\n</li></ul>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_i-can-see-only-the-default-set-of-bookmarks-in-the-bookmarks-folder\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">I can see only the default set of bookmarks in the Bookmarks folder</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_determine-if-firefox-has-created-a-new-profile\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Determine if Firefox has created a new profile</span></a></li><li class=\"toclevel-2\"><a href=\"#w_firefox-creates-a-new-profile-each-time-it-starts\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Firefox creates a new profile each time it starts</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_my-bookmarks-toolbar-is-missing\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">My Bookmarks Toolbar is missing</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-cant-find-all-of-my-bookmarks-and-folders\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">I can't find all of my bookmarks and folders</span></a></li><li class=\"toclevel-1\"><a href=\"#w_my-bookmarks-have-disappeared\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">My bookmarks have disappeared</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_there-is-an-old-firefox-data-folder-on-my-desktop\"><span class=\"tocnumber\">4.1</span> <span class=\"toctext\">There is an \"Old Firefox Data\" folder on my desktop</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_no-bookmarks-are-visible-after-installing-an-add-on\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">No bookmarks are visible after installing an add-on</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-cant-find-my-bookmarks-after-importing-them\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">I can't find my bookmarks after importing them</span></a></li></ul></div>\n<h1 id=\"w_i-can-see-only-the-default-set-of-bookmarks-in-the-bookmarks-folder\">I can see only the default set of bookmarks in the Bookmarks folder</h1>\n<p>Your bookmarks are associated with the Firefox <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile</a> you are using. There may be instances when you or Firefox creates a new profile containing the default set of bookmarks (for example, if you make a <a href=\"/en-US/kb/dedicated-profiles-firefox-installation\">separate installation of Firefox</a> or when you <a href=\"/en-US/kb/install-older-version-firefox\">downgrade Firefox</a>). A new profile may give you the impression that you have lost your bookmarks. \n</p>\n<h2 id=\"w_determine-if-firefox-has-created-a-new-profile\">Determine if Firefox has created a new profile</h2>\n<p>To see if another profile exists, type <strong>about:profiles</strong> into the Firefox address bar and press the <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span> key. This will open the <em>About Profiles</em> page, which will list at least one profile and could list many. The profile that Firefox is currently using will show: <strong>This is the profile in use and it cannot be deleted.</strong> If you have another profile listed, you can launch that profile in a new Firefox browser window to see if it contains your lost bookmarks. See <a href=\"/en-US/kb/recover-user-data-missing-after-firefox-update\">Recover user data missing after Firefox update</a> for more information.\n</p><div class=\"for\" data-for=\"mac\">\n<h2 id=\"w_firefox-creates-a-new-profile-each-time-it-starts\">Firefox creates a new profile each time it starts</h2>\n<p>A new profile is automatically created for each separate installation of Firefox (see <a href=\"/en-US/kb/dedicated-profiles-firefox-installation\">Dedicated profiles per Firefox installation</a> for details). If you are running Firefox directly from the <a href=\"https://en.wikipedia.org/wiki/Apple_Disk_Image\">disk image</a> (<code>Firefox .dmg</code>) file you downloaded, it may be detected as a new installation each time you start Firefox. Do not run Firefox directly from the <code>.dmg</code> file; move it to the <span class=\"menu\">Applications</span> folder instead. See <a href=\"/en-US/kb/how-download-and-install-firefox-mac\">How to download and install Firefox on Mac</a> for instructions.\n</p></div>\n<h1 id=\"w_my-bookmarks-toolbar-is-missing\">My Bookmarks Toolbar is missing</h1>\n<p>If you were using the Bookmarks Toolbar for quick access to your favorite bookmarks and the toolbar is now missing, you may have turned off the option to display the Bookmarks Toolbar. To turn it back on:\n</p><div class=\"for\" data-for=\"win,linux\">\n<ul><li>Right-click on an empty section of the navigation bar and select <span class=\"menu\">Bookmarks Toolbar</span> in the pop-up menu. \n</li></ul>\n</div><div class=\"for\" data-for=\"mac\">\n<ul><li>On the menu bar, click <span class=\"menu\">View</span>, select <span class=\"menu\">Toolbars</span>, and then select <span class=\"menu\">Bookmarks Toolbar</span>.\n</li></ul>\n</div><p>For more information, see the <a href=\"/en-US/kb/bookmarks-toolbar-display-favorite-websites\">Bookmarks Toolbar - Display your favorite websites at the top of the Firefox window</a> article.\n</p>\n<h1 id=\"w_i-cant-find-all-of-my-bookmarks-and-folders\">I can't find all of my bookmarks and folders</h1>\n<p>You can view all of your bookmarks and folders when you click the <span class=\"menu\">Bookmarks</span> menu item in the Firefox Menu bar<span class=\"for\" data-for=\"win,linux\">, if you <a href=\"/en-US/kb/restore-menu-bar-firefox\">enable the Menu bar</a></span>.\nYou can also add a Bookmarks menu button to your Firefox toolbar, a button that with a click, shows all of your bookmarks and folders. Follow these steps:\n</p>\n<ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, then click <span class=\"menu\">More tools</span> and select <span class=\"menu\">Customize Toolbar…</span>\n\n</li><li>Drag the Bookmarks Menu button <img alt=\"Bookmark Menu icon (star on tray)\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2017-10-14-13-54-51-ad9ea7.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> from the Customize Firefox tab onto the toolbar.\n</li></ol>\n<p><br>\n</p>\n<h1 id=\"w_my-bookmarks-have-disappeared\">My bookmarks have disappeared</h1>\n<p>Firefox automatically backs up your bookmarks and saves up to 15 backups in the <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile</a> <span class=\"filepath\">bookmarkbackups</span> folder. To recover bookmarks that were previously saved in the Bookmarks menu or on the Bookmarks toolbar but are now missing, you can restore them from one of these backups:\n</p>\n<ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the menu panel.\n Click <span class=\"menu\">Bookmarks</span> and then click the <span class=\"menu\">Manage bookmarks</span> bar at the bottom.\n\n</li><li> In the Library window, click the <span class=\"for\" data-for=\"mac\"> <img alt=\"import-export-arrows\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-04-10-18-16-d309be.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"win,linux\"><span class=\"button\">Import and Backup</span></span> button and then select <span class=\"menu\">Restore</span>.\n</li><li> Select the backup you want to restore from the list of dated automatic backups.\n<ul><li> You can also select <span class=\"menu\">Choose File…</span> to restore bookmarks from a <a href=\"/en-US/kb/restore-bookmarks-from-backup-or-move-them#w_manual-backup\">manual backup</a>, if you created one.\n</li></ul>\n</li><li> After confirming your choice, the bookmarks from the backup you selected will be restored.\n</li></ol>\n<p>For more information, see <a href=\"/en-US/kb/restore-bookmarks-from-backup-or-move-them\">Restore bookmarks from backup or move them to another computer</a>.\n</p>\n<h2 id=\"w_there-is-an-old-firefox-data-folder-on-my-desktop\">There is an \"Old Firefox Data\" folder on my desktop</h2>\n<p>In some cases, Firefox may create a folder on your desktop called \"Old Firefox Data\". This folder contains a complete backup of your Firefox <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile</a> and can be used to restore bookmarks and other missing information. If you have this folder on your desktop, see <a href=\"/en-US/kb/restore-bookmarks-passwords-and-data-from-an-old-firefox-profile\">Restore bookmarks, passwords, and data from an old Firefox profile</a>.\n</p><div class=\"for\" data-for=\"win\">\n<h1 id=\"w_no-bookmarks-are-visible-after-installing-an-add-on\">No bookmarks are visible after installing an add-on</h1>\n<p>If you have restarted Firefox after installing an add-on and your bookmarks are gone, it's possible that Firefox did not close properly before restarting itself. To recover your bookmarks, restart your computer.\n</p></div>\n<h1 id=\"w_i-cant-find-my-bookmarks-after-importing-them\">I can't find my bookmarks after importing them</h1>\n<p>If you <a href=\"/en-US/kb/import-data-another-browser\">imported your bookmarks from another browser</a>, you can find them inside a specially-named folder, for example, <strong>From Google Chrome</strong> or <strong>From Microsoft Edge</strong> depending on the browser, in one of these locations:\n</p>\n<ul><li>At the end of the Firefox <a href=\"/en-US/kb/bookmarks-toolbar-display-favorite-websites\">Bookmarks Toolbar</a>.\n</li><li>At the bottom of the Bookmarks list accessible from the Bookmarks Menu <img alt=\"Bookmark Menu icon (star on tray)\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2017-10-14-13-54-51-ad9ea7.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> toolbar button.\n</li><li>In the Bookmarks Library. To open the Bookmarks Library window: Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the menu panel.\n Click <span class=\"menu\">Bookmarks</span> and then click the <span class=\"menu\">Manage bookmarks</span> bar at the bottom.\n\n</li></ul>\n<p>If your source bookmarks were stored in a hierarchy of folders, the folder structure is preserved inside the specially-named folder. If desired, you can move your imported bookmarks to other folders. See <a href=\"/en-US/kb/bookmarks-firefox\">Bookmarks in Firefox</a> to learn more about organizing your bookmarks.\n</p><p>\n<br> <br>\n<em><strong>Based on information from <a href=\"http://kb.mozillazine.org/Lost_bookmarks\">Lost bookmarks (mozillaZine KB)</a></strong></em>\n</p>",
  "text": "If your bookmarks have suddenly disappeared, don't worry - you should be able to recover them. This article explains how to get back your bookmarks if they disappeared unexpectedly. If you are able to add, delete, and edit your bookmarks but the changes are lost when you restart Firefox, see Can't add, change or save bookmarks - How to fix . Table of Contents 1 I can see only the default set of bookmarks in the Bookmarks folder 1.1 Determine if Firefox has created a new profile 1.2 Firefox creates a new profile each time it starts 2 My Bookmarks Toolbar is missing 3 I can't find all of my bookmarks and folders 4 My bookmarks have disappeared 4.1 There is an \"Old Firefox Data\" folder on my desktop 5 No bookmarks are visible after installing an add-on 6 I can't find my bookmarks after importing them I can see only the default set of bookmarks in the Bookmarks folder Your bookmarks are associated with the Firefox profile you are using. There may be instances when you or Firefox creates a new profile containing the default set of bookmarks (for example, if you make a separate installation of Firefox or when you downgrade Firefox ). A new profile may give you the impression that you have lost your bookmarks. Determine if Firefox has created a new profile To see if another profile exists, type about:profiles into the Firefox address bar and press the Enter Return key. This will open the About Profiles page, which will list at least one profile and could list many. The profile that Firefox is currently using will show: This is the profile in use and it cannot be deleted. If you have another profile listed, you can launch that profile in a new Firefox browser window to see if it contains your lost bookmarks. See Recover user data missing after Firefox update for more information. Firefox creates a new profile each time it starts A new profile is automatically created for each separate installation of Firefox (see Dedicated profiles per Firefox installation for details). If you are running Firefox directly from the disk image ( Firefox .dmg ) file you downloaded, it may be detected as a new installation each time you start Firefox. Do not run Firefox directly from the .dmg file; move it to the Applications folder instead. See How to download and install Firefox on Mac for instructions. My Bookmarks Toolbar is missing If you were using the Bookmarks Toolbar for quick access to your favorite bookmarks and the toolbar is now missing, you may have turned off the option to display the Bookmarks Toolbar. To turn it back on: Right-click on an empty section of the navigation bar and select Bookmarks Toolbar in the pop-up menu. On the menu bar, click View , select Toolbars , and then select Bookmarks Toolbar . For more information, see the Bookmarks Toolbar - Display your favorite websites at the top of the Firefox window article. I can't find all of my bookmarks and folders You can view all of your bookmarks and folders when you click the Bookmarks menu item in the Firefox Menu bar , if you enable the Menu bar . You can also add a Bookmarks menu button to your Firefox toolbar, a button that with a click, shows all of your bookmarks and folders. Follow these steps: Click the menu button , then click More tools and select Customize Toolbar… Drag the Bookmarks Menu button from the Customize Firefox tab onto the toolbar. My bookmarks have disappeared Firefox automatically backs up your bookmarks and saves up to 15 backups in the profile bookmarkbackups folder. To recover bookmarks that were previously saved in the Bookmarks menu or on the Bookmarks toolbar but are now missing, you can restore them from one of these backups: Click the menu button to open the menu panel. Click Bookmarks and then click the Manage bookmarks bar at the bottom. In the Library window, click the Import and Backup button and then select Restore . Select the backup you want to restore from the list of dated automatic backups. You can also select Choose File… to restore bookmarks from a manual backup , if you created one. After confirming your choice, the bookmarks from the backup you selected will be restored. For more information, see Restore bookmarks from backup or move them to another computer . There is an \"Old Firefox Data\" folder on my desktop In some cases, Firefox may create a folder on your desktop called \"Old Firefox Data\". This folder contains a complete backup of your Firefox profile and can be used to restore bookmarks and other missing information. If you have this folder on your desktop, see Restore bookmarks, passwords, and data from an old Firefox profile . No bookmarks are visible after installing an add-on If you have restarted Firefox after installing an add-on and your bookmarks are gone, it's possible that Firefox did not close properly before restarting itself. To recover your bookmarks, restart your computer. I can't find my bookmarks after importing them If you imported your bookmarks from another browser , you can find them inside a specially-named folder, for example, From Google Chrome or From Microsoft Edge depending on the browser, in one of these locations: At the end of the Firefox Bookmarks Toolbar . At the bottom of the Bookmarks list accessible from the Bookmarks Menu toolbar button. In the Bookmarks Library. To open the Bookmarks Library window: Click the menu button to open the menu panel. Click Bookmarks and then click the Manage bookmarks bar at the bottom. If your source bookmarks were stored in a hierarchy of folders, the folder structure is preserved inside the specially-named folder. If desired, you can move your imported bookmarks to other folders. See Bookmarks in Firefox to learn more about organizing your bookmarks. Based on information from Lost bookmarks (mozillaZine KB)",
  "products": [
    "firefox"
  ],
  "topics": [
    "bookmarks",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 12103,
    "text_bytes": 5781,
    "word_count": 993,
    "downloaded_at": "2025-08-26T09:04:39.825985"
  }
}