{
  "slug": "remove-toolbar-has-taken-over-your-firefox-search",
  "title": "Remove a toolbar that has taken over your Firefox search or home page",
  "summary": "This article will help you remove unwanted third-party toolbars from Firefox and restore the default search, New Tab and home page settings.",
  "url": "https://support.mozilla.org/en-US/kb/remove-toolbar-has-taken-over-your-firefox-search",
  "html": "<p>This article will help you remove third-party toolbars like Ask, searchqu, MyStart, incredibar, seeearch, somoto, sweetim, uTorrent, and others from Firefox and restore your default home page, New tab page and search settings. For help removing the Babylon toolbar, see <a href=\"/en-US/kb/remove-babylon-toolbar-home-page-and-search-engine\">How to remove the Babylon toolbar, home page and search engine</a>.\n</p>\n<ul><li>If you just want to remove a search engine from the Firefox Search Bar, see the <a href=\"/en-US/kb/add-or-remove-search-engine-firefox\">Add or remove a search engine in Firefox</a> article.\n</li><li> If you need help with toolbar customization or if you simply want to hide a toolbar, see <a href=\"/en-US/kb/customize-firefox-controls-buttons-and-toolbars\">Customize Firefox controls, buttons and toolbars</a>.\n</li></ul>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_how-did-this-happen\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">How did this happen?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-fix-it\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How do I fix it?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_use-the-add-ons-manager-to-remove-the-toolbar\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Use the Add-ons Manager to remove the toolbar</span></a></li><li class=\"toclevel-2\"><a href=\"#w_restore-the-default-home-page-or-search-settings\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">Restore the default home page or search settings</span></a></li><li class=\"toclevel-2\"><a href=\"#w_other-solutions\"><span class=\"tocnumber\">2.3</span> <span class=\"toctext\">Other solutions</span></a></li></ul></li></ul></div>\n<h1 id=\"w_how-did-this-happen\">How did this happen?</h1>\n<p>Toolbars from third-party software providers can change your search, New Tab and home page settings or cause other problems with Firefox. These toolbars can get added to Firefox when you visit a website and click on an \"Install\" link, when you download and run a toolbar installer, or when you install software that includes a Firefox toolbar. Be careful when installing or updating other applications and make sure you deselect any options for toolbars or other bundled software that you don't want. \n</p><p>Also, some software providers offer their own version of Firefox that includes a toolbar and other customizations (for instance, <a href=\"http://downloads.yahoo.com/firefox/\">Mozilla Firefox® optimized for Yahoo!</a>) so always make sure you download Firefox from the <a href=\"https://www.mozilla.org/firefox\">Firefox download page</a>.\n</p>\n<h1 id=\"w_how-do-i-fix-it\">How do I fix it?</h1>\n<div class=\"note\"><strong>Note:</strong> The <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">Refresh Firefox feature</a> can fix many issues by restoring Firefox to its default state while saving your essential information. Consider using it before going through a lengthy troubleshooting process.\n</div>\n<h2 id=\"w_use-the-add-ons-manager-to-remove-the-toolbar\">Use the Add-ons Manager to remove the toolbar</h2>\n<p>In most cases, third-party toolbars can be uninstalled from Firefox Add-ons Manager Extensions list, as follows:\n</p>\n<ol><li> Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"for\" data-for=\"not fx140\"><span class=\"menu\">Add-ons and themes</span></span><span class=\"for\" data-for=\"fx140\"><span class=\"menu\">Extensions and themes</span></span> and select <span class=\"menu\">Extensions</span>.\n\n</li><li> Select the toolbar you wish to remove.\n</li><li> Click the <span class=\"button\">Remove</span> button.  \n</li><li> Click <strong>Restart now</strong> if it pops up. Your tabs will be saved and restored after the restart.\n</li></ol>\n<p>If you can't remove the toolbar from the Add-ons Manager, use the \"Disable\" option as a workaround, or see the <a href=\"/en-US/kb/cannot-remove-add-on-extension-or-theme\">Cannot remove an add-on (extension or theme)</a> article for other solutions.  \n</p>\n<h2 id=\"w_restore-the-default-home-page-or-search-settings\">Restore the default home page or search settings</h2>\n<p>You may need to reset your Firefox search preferences and restore the default New Tab page, home page and search engine after removing the toolbar. For more information, see the articles <a href=\"/en-US/kb/change-your-default-search-settings-firefox\">Change your default search settings in Firefox</a>, <a href=\"/en-US/kb/about-new-tab-page\">New Tab page in Firefox</a> and <a href=\"/en-US/kb/how-to-set-the-home-page\">How to set the home page</a>.\n</p>\n<h2 id=\"w_other-solutions\">Other solutions</h2>\n<ul><li>If your current Firefox installation was customized by another software provider, you'll need to <a href=\"/en-US/kb/uninstall-firefox-from-your-computer\">uninstall Firefox from your computer</a> and then download Firefox from the <a href=\"http://www.mozilla.org/firefox\">Firefox download page</a> and reinstall it.  \n</li><li> If the unwanted toolbar, home page and search engine come back when you restart Firefox, you may have malicious software installed on your computer. See <a href=\"/en-US/kb/troubleshoot-firefox-issues-caused-malware\">Troubleshoot Firefox issues caused by malware</a>.\n</li></ul>\n<div class=\"for\" data-for=\"win\">\n<ul><li> If a page (for example, bitable.com) keeps loading even though you have set a different home page, Firefox's shortcut might have been manipulated. See <a href=\"/en-US/kb/wrong-home-page-opens-when-i-start-firefox-how-fix\">Wrong home page opens when I start Firefox - How to fix</a> for instructions on how to change it back.\n</li></ul>\n</div>",
  "text": "This article will help you remove third-party toolbars like Ask, searchqu, MyStart, incredibar, seeearch, somoto, sweetim, uTorrent, and others from Firefox and restore your default home page, New tab page and search settings. For help removing the Babylon toolbar, see How to remove the Babylon toolbar, home page and search engine . If you just want to remove a search engine from the Firefox Search Bar, see the Add or remove a search engine in Firefox article. If you need help with toolbar customization or if you simply want to hide a toolbar, see Customize Firefox controls, buttons and toolbars . Table of Contents 1 How did this happen? 2 How do I fix it? 2.1 Use the Add-ons Manager to remove the toolbar 2.2 Restore the default home page or search settings 2.3 Other solutions How did this happen? Toolbars from third-party software providers can change your search, New Tab and home page settings or cause other problems with Firefox. These toolbars can get added to Firefox when you visit a website and click on an \"Install\" link, when you download and run a toolbar installer, or when you install software that includes a Firefox toolbar. Be careful when installing or updating other applications and make sure you deselect any options for toolbars or other bundled software that you don't want. Also, some software providers offer their own version of Firefox that includes a toolbar and other customizations (for instance, Mozilla Firefox® optimized for Yahoo! ) so always make sure you download Firefox from the Firefox download page . How do I fix it? Note: The Refresh Firefox feature can fix many issues by restoring Firefox to its default state while saving your essential information. Consider using it before going through a lengthy troubleshooting process. Use the Add-ons Manager to remove the toolbar In most cases, third-party toolbars can be uninstalled from Firefox Add-ons Manager Extensions list, as follows: Click the menu button , click Add-ons and themes Extensions and themes and select Extensions . Select the toolbar you wish to remove. Click the Remove button. Click Restart now if it pops up. Your tabs will be saved and restored after the restart. If you can't remove the toolbar from the Add-ons Manager, use the \"Disable\" option as a workaround, or see the Cannot remove an add-on (extension or theme) article for other solutions. Restore the default home page or search settings You may need to reset your Firefox search preferences and restore the default New Tab page, home page and search engine after removing the toolbar. For more information, see the articles Change your default search settings in Firefox , New Tab page in Firefox and How to set the home page . Other solutions If your current Firefox installation was customized by another software provider, you'll need to uninstall Firefox from your computer and then download Firefox from the Firefox download page and reinstall it. If the unwanted toolbar, home page and search engine come back when you restart Firefox, you may have malicious software installed on your computer. See Troubleshoot Firefox issues caused by malware . If a page (for example, bitable.com) keeps loading even though you have set a different home page, Firefox's shortcut might have been manipulated. See Wrong home page opens when I start Firefox - How to fix for instructions on how to change it back.",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5939,
    "text_bytes": 3388,
    "word_count": 564,
    "downloaded_at": "2025-08-26T10:35:31.367346"
  }
}