{
  "slug": "reporting-extensions-and-themes-abuse",
  "title": "Report extensions and themes for abuse",
  "summary": "Discover what constitutes inappropriate content or behavior in an extension or theme, and see how to report any abuse you find.",
  "url": "https://support.mozilla.org/en-US/kb/reporting-extensions-and-themes-abuse",
  "html": "<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-constitutes-abuse-for-an-extension-or-theme\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What constitutes abuse for an extension or theme?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-report-an-extension-or-theme\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How do I report an extension or theme?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-happens-next\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">What happens next?</span></a></li></ul></div>\n<h1 id=\"w_what-constitutes-abuse-for-an-extension-or-theme\">What constitutes abuse for an extension or theme?</h1>\n<p>Every extension and theme distributed for use in Firefox is subject to <a href=\"https://extensionworkshop.com/documentation/publish/add-on-policies/\">Mozilla’s add-on policies</a>, which also require compliance with the <a href=\"https://www.mozilla.org/about/legal/acceptable-use/\">acceptable use policy</a> for Mozilla services. These policies and conditions have been created to protect you from inappropriate content or behavior in extensions and themes for Firefox. The types of content and behavior that are considered inappropriate, and therefore constitute abuse, generally fall into these categories:\n</p><p><strong>Damages your computer or data</strong>\n</p>\n<ul><li>Injects a virus, worm or other type of malware\n</li><li>Steals identifying or sensitive information\n<ul><li>For example: logins and passwords, credit card and bank information, authentication tokens, social media profile information, bookmarks and cookies\n</li></ul>\n</li><li>Sends spam links to people in your contact list\n</li><li>Steals bandwidth\n</li><li>Is difficult or impossible to uninstall\n</li><li>Requests or uses your data in ways that don’t match the extension’s description or privacy policy\n<ul><li>For example, it collects pages you visit without your knowledge or permission, or when it isn’t necessary for the extension to function\n</li></ul>\n</li><li>Mimics warnings and functionality from Firefox or your operating system\n</li></ul>\n<p><strong>Creates spam or advertising</strong>\n</p>\n<ul><li>Inserts advertisements on webpages, especially pages that didn’t previously have ads on them\n</li><li>For themes: Inserts irrelevant advertisements in the theme’s background image, or includes unrelated advertisements in the description\n<ul><li>For example: Includes something like, “Download free movies at www.website.com”\n</li></ul>\n</li></ul>\n<p><strong>Changed search engine, homepage, or new tab without informing or asking you</strong>\n</p>\n<ul><li>For example: You may have Google as your default search engine, and the extension changed it to something else without informing you or asking for your permission\n</li></ul>\n<div class=\"note\"><strong>Note:</strong> If the extension <em>did</em> inform you of this change, or ask for your permission to do it, this likely isn’t a case of abuse. You can adjust the settings on your own:\n<ul><li><a href=\"/en-US/kb/change-your-default-search-settings-firefox\">Change your default search settings</a>\n</li><li><a href=\"/en-US/kb/how-to-set-the-home-page\">Change your homepage</a>\n</li></ul>\n</div>\n<p><strong>Pretends to be something it’s not</strong>\n</p>\n<ul><li>The description and imagery are false or misleading<br><em>Examples:</em><br>\n<ul><li>The description contains random, clickbaity keywords\n</li><li>The description didn’t specify the need for payment, and now you are being asked for money\n</li></ul>\n</li><li>Includes features that aren’t necessary for the extension’s purpose, or uses your data in ways that don’t match the extension’s description or privacy policy<br><em>Examples:</em><br>\n<ul><li>An extension that collects pages you visit when it isn’t necessary, or without your knowledge and permission\n</li><li>A YouTube extension that collects your visited URLs or redirects your searches through an ad network\n</li></ul>\n</li></ul>\n<p><strong>Doesn’t work, breaks websites, or slows Firefox down</strong>\n</p>\n<ul><li>Doesn’t perform the function described in its description\n</li><li>Doesn’t work well\n</li><li>Features are slow or hard to use\n</li><li>Websites look broken or unusual; parts of websites don’t load, such as forms, comments or widgets\n</li><li>Can’t log in or complete a form or transaction\n</li><li>Can’t view a video, for example a Facebook Live or YouTube video\n</li><li>Social media sharing or buttons don’t work\n</li><li>Customer support chats don’t load\n</li><li>Text and browser features disappear\n</li><li>Negatively impacts Firefox’s performance\n</li></ul>\n<div class=\"note\"><strong>Note:</strong> These kinds of issues might be bugs, rather than instances of abuse. The best way to get a functionality issue resolved is to contact the extension developer. If the extension was installed via <a href=\"https://addons.mozilla.org\">addons.mozilla.org</a> (AMO), return to extension’s product page on AMO to get the developer’s contact information. Otherwise, try searching the web for the developer’s contact information.</div>\n<p><strong>Hateful, violent, sexual or illegal content</strong>\n</p>\n<ul><li>Includes graphic depictions of sexuality or violence\n</li><li>Contains abusive or threatening content that targets people based upon race, ethnicity, gender, sexual orientation, religion, disability, age, etc.\n</li><li>Contains content that threatens or bullies other people\n</li><li>Promotes illegal activities, such as gambling or pornography\n</li></ul>\n<div class=\"note\"><strong>Note:</strong> Copyright and trademark issues must be reported in a separate process. <a href=\"https://www.mozilla.org/about/legal/report-infringement/\">Use these instructions</a> to report a problem. </div>\n<p><strong>Never wanted this extension and can’t get rid of it</strong>\n</p>\n<ul><li>You don’t remember installing the extension, or you were tricked or forced into installing it from a website\n<ul><li>For example: The extension trapped you in full-screen mode, or an application installed it without your permission\n</li></ul>\n</li><li>It’s difficult or impossible to uninstall\n</li></ul>\n<p><strong>Some things that don’t constitute abuse include</strong>\n</p>\n<ul><li>A lack of functionality compared to the extension’s description\n</li><li>Poorly working or difficult-to-use features\n</li><li>Slow functioning features, as long as these don’t affect the overall performance of Firefox\n</li></ul>\n<div class=\"note\"><strong>Note:</strong> These kinds of issues might be bugs, rather than instances of abuse. The best way to get a functionality issue resolved is to contact the extension developer. If the extension was installed via <a href=\"https://addons.mozilla.org\">addons.mozilla.org</a> (AMO), return to extension’s product page on AMO to get the developer’s contact information. Otherwise, try searching the web for the developer’s contact information.</div>\n<h1 id=\"w_how-do-i-report-an-extension-or-theme\">How do I report an extension or theme?</h1>\n<p>You can report an extension or theme directly in Firefox or on the <a href=\"https://addons.mozilla.org/firefox/\">AMO product page</a> for the extension or theme.\n</p><p><strong>To submit a report in Firefox:</strong>\n</p>\n<ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"for\" data-for=\"not fx140\"><span class=\"menu\">Add-ons and themes</span></span><span class=\"for\" data-for=\"fx140\"><span class=\"menu\">Extensions and themes</span></span> and select <span class=\"menu\">Extensions or Themes</span>.\n\n</li><li>Select the extension or theme you would like to report.\n</li><li>Click the ellipsis (3-dot) icon and select <strong>Report</strong>.<br><img alt=\"fx72 report extensions\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-12-20-17-07-24-fd9c18.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"250\"><br>\n</li><li>Select a reason for reporting the extension and click <strong>Next</strong>.\n<dl><dt><img alt=\"Report add-on abuse\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-04-27-13-40-51-2d084d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"900\">\n</dt></dl>\n</li><li>Provide more information about your report (optional).\n</li><li>Click <strong>Submit</strong>.\n</li></ol>\n<p><strong>To submit a report on the extension or theme’s <a href=\"https://addons.mozilla.org/firefox/\">AMO product page</a>:</strong>\n</p>\n<ol><li>Go to the <a href=\"https://addons.mozilla.org/firefox/\">Firefox Add-ons</a> page for the extension or theme and click <span class=\"button\">Report this add-on for abuse</span>.\n<dl><dt><img alt=\"report addon button\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2018-08-17-07-55-14-5ed7c8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>Select a reason for reporting the extension and click <strong>Next</strong>.\n</li><li>Provide more information about your report (optional).\n</li><li>Click <strong>Submit</strong>.\n</li></ol>\n<h1 id=\"w_what-happens-next\">What happens next?</h1>\n<p>Your abuse report is sent to the Firefox add-ons team for review. If they confirm that the extension or theme is abusing the Mozilla add-on policies or conditions of use, the extension or theme is removed from <a href=\"https://addons.mozilla.org\">addons.mozilla.org</a> until the developer fixes the issues. Depending on the history and severity of the abuse, the add-ons team may issue a block that prevents the extension or theme from loading in Firefox. For more information, see <a href=\"/en-US/kb/add-ons-cause-issues-are-on-blocklist\">Why does Mozilla disable some add-ons from running in Firefox?</a>\n</p>",
  "text": "Table of Contents 1 What constitutes abuse for an extension or theme? 2 How do I report an extension or theme? 3 What happens next? What constitutes abuse for an extension or theme? Every extension and theme distributed for use in Firefox is subject to Mozilla’s add-on policies , which also require compliance with the acceptable use policy for Mozilla services. These policies and conditions have been created to protect you from inappropriate content or behavior in extensions and themes for Firefox. The types of content and behavior that are considered inappropriate, and therefore constitute abuse, generally fall into these categories: Damages your computer or data Injects a virus, worm or other type of malware Steals identifying or sensitive information For example: logins and passwords, credit card and bank information, authentication tokens, social media profile information, bookmarks and cookies Sends spam links to people in your contact list Steals bandwidth Is difficult or impossible to uninstall Requests or uses your data in ways that don’t match the extension’s description or privacy policy For example, it collects pages you visit without your knowledge or permission, or when it isn’t necessary for the extension to function Mimics warnings and functionality from Firefox or your operating system Creates spam or advertising Inserts advertisements on webpages, especially pages that didn’t previously have ads on them For themes: Inserts irrelevant advertisements in the theme’s background image, or includes unrelated advertisements in the description For example: Includes something like, “Download free movies at www.website.com” Changed search engine, homepage, or new tab without informing or asking you For example: You may have Google as your default search engine, and the extension changed it to something else without informing you or asking for your permission Note: If the extension did inform you of this change, or ask for your permission to do it, this likely isn’t a case of abuse. You can adjust the settings on your own: Change your default search settings Change your homepage Pretends to be something it’s not The description and imagery are false or misleading Examples: The description contains random, clickbaity keywords The description didn’t specify the need for payment, and now you are being asked for money Includes features that aren’t necessary for the extension’s purpose, or uses your data in ways that don’t match the extension’s description or privacy policy Examples: An extension that collects pages you visit when it isn’t necessary, or without your knowledge and permission A YouTube extension that collects your visited URLs or redirects your searches through an ad network Doesn’t work, breaks websites, or slows Firefox down Doesn’t perform the function described in its description Doesn’t work well Features are slow or hard to use Websites look broken or unusual; parts of websites don’t load, such as forms, comments or widgets Can’t log in or complete a form or transaction Can’t view a video, for example a Facebook Live or YouTube video Social media sharing or buttons don’t work Customer support chats don’t load Text and browser features disappear Negatively impacts Firefox’s performance Note: These kinds of issues might be bugs, rather than instances of abuse. The best way to get a functionality issue resolved is to contact the extension developer. If the extension was installed via addons.mozilla.org (AMO), return to extension’s product page on AMO to get the developer’s contact information. Otherwise, try searching the web for the developer’s contact information. Hateful, violent, sexual or illegal content Includes graphic depictions of sexuality or violence Contains abusive or threatening content that targets people based upon race, ethnicity, gender, sexual orientation, religion, disability, age, etc. Contains content that threatens or bullies other people Promotes illegal activities, such as gambling or pornography Note: Copyright and trademark issues must be reported in a separate process. Use these instructions to report a problem. Never wanted this extension and can’t get rid of it You don’t remember installing the extension, or you were tricked or forced into installing it from a website For example: The extension trapped you in full-screen mode, or an application installed it without your permission It’s difficult or impossible to uninstall Some things that don’t constitute abuse include A lack of functionality compared to the extension’s description Poorly working or difficult-to-use features Slow functioning features, as long as these don’t affect the overall performance of Firefox Note: These kinds of issues might be bugs, rather than instances of abuse. The best way to get a functionality issue resolved is to contact the extension developer. If the extension was installed via addons.mozilla.org (AMO), return to extension’s product page on AMO to get the developer’s contact information. Otherwise, try searching the web for the developer’s contact information. How do I report an extension or theme? You can report an extension or theme directly in Firefox or on the AMO product page for the extension or theme. To submit a report in Firefox: Click the menu button , click Add-ons and themes Extensions and themes and select Extensions or Themes . Select the extension or theme you would like to report. Click the ellipsis (3-dot) icon and select Report . Select a reason for reporting the extension and click Next . Provide more information about your report (optional). Click Submit . To submit a report on the extension or theme’s AMO product page : Go to the Firefox Add-ons page for the extension or theme and click Report this add-on for abuse . Select a reason for reporting the extension and click Next . Provide more information about your report (optional). Click Submit . What happens next? Your abuse report is sent to the Firefox add-ons team for review. If they confirm that the extension or theme is abusing the Mozilla add-on policies or conditions of use, the extension or theme is removed from addons.mozilla.org until the developer fixes the issues. Depending on the history and severity of the abuse, the add-ons team may issue a block that prevents the extension or theme from loading in Firefox. For more information, see Why does Mozilla disable some add-ons from running in Firefox?",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 10366,
    "text_bytes": 6432,
    "word_count": 1011,
    "downloaded_at": "2025-08-26T10:46:28.737448"
  }
}