{
  "slug": "report-breakage-due-blocking",
  "title": "How do I report a broken site in Firefox desktop?",
  "summary": "How to report a broken website and what information Mozilla receives when you report breakage caused by Enhanced Tracking Protection.",
  "url": "https://support.mozilla.org/en-US/kb/report-breakage-due-blocking",
  "html": "<div class=\"for\" data-for=\"not fx123\"><p><a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a> sometimes causes websites to display or work incorrectly. For example, some buttons may not work, parts of some pages may be missing, and some pages may not load at all. Reporting any problems caused by content blocking helps us improve Firefox.\n</p><p>Follow these steps, when necessary, to report a site that isn’t working properly:\n</p>\n<ol><li> Click the shield <img alt=\"Fx91ShieldIcon-Blue\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-09-04-07-27-48-6f4a69.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the address bar to open the Protections panel.\n</li><li> Click the blue toggle switch <img alt=\"Fx91ETPbluetoggle\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-03-16-12-56-21-3859dc.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to turn off protections.<br>The site will reload with Enhanced Tracking Protection turned off.\n</li><li> If this fixed the problem, click the shield <img alt=\"Fx91shield-ETPoff\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-03-16-13-20-43-26a8c0.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the Protections panel again.\n<dl><dt><img alt=\"Fx91SiteFixedSendReport\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-03-16-13-01-56-7fcd80.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> Click <span class=\"menu\">Site fixed? Send report</span> to let Firefox know.<br>It will open the <em>Report a Broken Site</em> panel.\n<dl><dt><img alt=\"Fx98ETP-ReportBrokenSite\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-03-23-12-12-39-99d4dd.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> Describe the problem to help us solve the problem faster. (Optional.)\n</li><li> Click the <span class=\"button\">Send Report</span> button.\n</li></ol>\n<p>When you report breakage, Mozilla receives the following information:\n</p>\n<ul><li>Website URL (without query strings to avoid identifying your activity on the site)\n</li><li>Operating system on the device\n</li><li>Version of Firefox that you’re using\n</li><li>Description of the problem that you’ve typed in the text box\n</li><li>Your Firefox privacy settings:\n<ul><li>Enhanced Tracking Protection (On, Off or Only in private browsing)\n</li><li>Your protection level (Standard, Strict or Custom)\n</li><li>Third-party tracking cookies (Blocked or Allowed)\n</li><li>Which third-party tracking cookie block list is being used (Level 1 or Level 2)\n</li><li>Fingerprinting (Blocked or allowed)\n</li><li>Cryptomining (Blocked or allowed)\n</li><li>Other third-party cookies (Always blocked, Never blocked or Blocked from unvisited websites)\n</li><li>Custom referrer settings from <em>about:config</em>\n</li><li>If cookies are set to expire at the end of your session\n</li><li>How long third-party storage will be kept\n</li></ul>\n</li></ul>\n</div><div class=\"for\" data-for=\"fx123\"><p>Are you experiencing issues with a webpage that works fine in other browsers but not in Firefox? This could be a <a href=\"https://www.techopedia.com/definition/23240/browser-compatibility\">web compatibility</a> (webcompat) issue. Common signs include:\n</p>\n<ul><li>Slow or non-functional sites\n</li><li>Broken images or videos\n</li><li>Malfunctioning buttons, links and text boxes\n</li><li>Missing content\n</li><li>Issues with signing in or password autofill\n</li><li>Problems when using an ad blocker\n</li></ul>\n<p>To proactively combat these web compatibility issues, Firefox has integrated a user-friendly reporting tool directly into the browser. This tool enables users to swiftly report issues related to content blocking, thereby aiding in the enhancement of Firefox's performance and user experience.\n</p>\n<div class=\"warning\">To ensure your privacy, the reporting tool allows you to edit the URL before reporting, enabling you to remove any personal information from the URL. For detailed information and precautions, turn to the <a href=\"#w_protect-your-information\">Protect your information</a> section detailed later in this article.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_how-can-i-access-the-report-broken-site-tool\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">How can I access the Report broken site tool?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-information-does-mozilla-collect-from-your-report\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">What information does Mozilla collect from your report?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_protect-your-information\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Protect your information</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_customizable-url\"><span class=\"tocnumber\">3.1</span> <span class=\"toctext\">Customizable URL</span></a></li><li class=\"toclevel-2\"><a href=\"#w_optional-describe-the-problem-text-box\"><span class=\"tocnumber\">3.2</span> <span class=\"toctext\">Optional Describe the Problem Text Box</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_what-will-firefox-do-with-your-report\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">What will Firefox do with your report?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_related-content\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Related content</span></a></li></ul></div>\n<h1 id=\"w_how-can-i-access-the-report-broken-site-tool\">How can I access the <em>Report broken site</em> tool?</h1>\n<p>If a site seems broken due to web compatibility or <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a>-related issues, you can report it directly to the Webcompat team.\nTo report a non-Firefox site that isn’t working properly, follow these steps:\n</p>\n<ol><li>At the top right, click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the Firefox menu.\n</li><li>At the bottom of the menu, select the <img alt=\"Report broken site option\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-02-20-05-15-24-b5e7d9.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"150\"> option.\n</li><li>Next, enter the site URL, pick an option from the dropdown menu under <em>What's broken?</em>, and, optionally, add a short description of the issue.\n<dl><dt><img alt=\"Report broken site panel\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-02-20-05-16-37-5f01b7.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"300\">\n</dt></dl>\n</li><li>To submit your report, click <img alt=\"Report broken site panel Send button\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-02-20-05-19-05-3bfa56.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"50\">.\n</li><li>A success message will confirm your submission. To conclude, click <img alt=\"Report broken site panel Close button\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-02-20-05-20-00-943359.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"60\">.\n<dl><dt><img alt=\"Report broken site panel Success message\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-02-20-05-20-18-490f17.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"300\">\n</dt></dl>\n</li></ol>\n<div class=\"note\">\n<p>The reporting tool will not work on a new tab or <em>about:</em> Firefox page.\n</p><p>For Nightly and Beta channel users: You can send a detailed report using the <strong>Send more info</strong> link, located at the lower end of the <em>Report a broken site</em> panel.\n</p>\n</div>\n<p>\n</p>\n<h1 id=\"w_what-information-does-mozilla-collect-from-your-report\">What information does Mozilla collect from your report?</h1>\n<p>We wish to keep our process as transparent as possible. Any reports you send to Mozilla with this tool will include the following information when we receive it via our data pipeline:\n</p>\n<ul><li>uuid: A single-use Unique User ID that helps us identify the specific report in our data pipeline. This is not tied to your Firefox profile in any way and cannot be used to identify you. If you submit multiple reports, it will be a different uuid each time.\n</li><li>reported_at: The timestamp when our pipeline receives your report\n</li><li>comments: Any notes you would like to share with us in the optional <em>Describe the problem</em> box.\n</li><li>url = The URL of the site you are reporting. While the feature automatically populates the text field with the URL of the site you are currently on when you select <em>Report Broken Site</em>, you will be able to edit it prior to submitting the report.\n</li><li>breakage_category = The answer you chose from the <em>Choose reason</em> dropdown menu\n</li><li>details\n<ul><li>Device (Operating system, version, screen dimensions &amp; touchscreen capability)\n</li><li>User Agent String (Mozilla version, Gecko version, Firefox version and build date)\n</li><li>Graphics (GPU model, version and rendering capabilities)\n</li><li>Privacy settings\n<ul><li>If you’re submitting a report from a Private Browsing window\n</li><li>If Firefox site isolation (Fission) is turned on\n</li><li>If Total Cookie Protection is turned on\n</li><li>Enhanced Tracking Protection (On, Off or Only in private browsing)\n</li><li>Your protection level (Standard, Strict or Custom)\n</li><li>Third-party tracking cookies (Blocked or Allowed)\n</li><li>Which third-party tracking cookie block list is being used (Level 1 or 2)\n</li><li>Fingerprinting (Blocked or Allowed)\n</li><li>Cryptomining (Blocked or Allowed)\n</li><li>Other third-party cookies (Always blocked, Never blocked or Blocked from unvisited websites)\n</li><li>Custom referrer settings from <em>about:config</em>\n</li><li>If cookies are set to expire at the end of your session\n</li><li>How long third-party storage will be kept\n</li></ul>\n</li><li>Security settings (Any antivirus software, antispyware or firewalls installed)\n</li><li>Languages used for Firefox, and\n</li><li>Any details you share in the optional <em>Describe the problem</em> text box\n</li></ul>\n</li></ul>\n<p>\n</p>\n<h1 id=\"w_protect-your-information\">Protect your information</h1>\n<h2 id=\"w_customizable-url\">Customizable URL</h2>\n<p>The <em>Report broken site</em> tool pre-fills the URL of the site you're reporting. Beware, some URLs might contain sensitive data, such as shipping details or personal tax information. To protect your privacy, edit the URL to omit personal details. Note, however, that changes to the URL might hinder our issue reproduction efforts.\n</p>\n<h2 id=\"w_optional-describe-the-problem-text-box\">Optional <em>Describe the Problem</em> Text Box</h2>\n<p>If you believe additional details in the <em>Describe the Problem</em> area could help resolve your web compatibility issue, feel free to include them. However, carefully consider the information you share. We implement measures to protect your data temporarily before it's securely discarded, but submitting sensitive information is ultimately your choice. Your contributions are crucial to our Webcompat team's efforts in improving Firefox. Providing extra context, including thorough responses to <em>What’s broken?</em>, aids us in identifying and rectifying major problems that negatively affect your browsing.\n</p>\n<h1 id=\"w_what-will-firefox-do-with-your-report\">What will Firefox do with your report?</h1>\n<p>When you submit a <em>Report broken site</em> form, it's emailed to the Firefox Webcompat team and entered into a secure internal database accessible only to them. The team reviews these reports, actively filtering for and sanitizing any potentially sensitive personal information before sharing it with other Mozilla staff involved in issue resolution. Access to this data is strictly limited to Mozilla employees. Post-sanitization, the intention is to keep the data for trend analysis and compiling aggregated user statistics, ensuring it's eventually disposed of securely.\n</p></div>\n<h1 id=\"w_related-content\">Related content</h1>\n<p>To learn more about the privacy principles that guide Mozilla's mission, visit:\n</p>\n<ul><li><a href=\"/en-US/kb/how-stay-safe-web\">How to stay safe on the web</a>\n</li><li><a href=\"https://www.mozilla.org/privacy/\">Mozilla Privacy Policy</a>\n</li><li><a href=\"https://www.mozilla.org/about/policy/lean-data/\">Data Privacy Principles</a>\n</li><li><a href=\"https://www.mozilla.org/privacy/firefox/\">Firefox Privacy Notice</a>\n</li><li><a href=\"https://www.mozilla.org/privacy/faq/\">Mozilla's Data Privacy FAQ</a>\n</li></ul>",
  "text": "Enhanced Tracking Protection sometimes causes websites to display or work incorrectly. For example, some buttons may not work, parts of some pages may be missing, and some pages may not load at all. Reporting any problems caused by content blocking helps us improve Firefox. Follow these steps, when necessary, to report a site that isn’t working properly: Click the shield in the address bar to open the Protections panel. Click the blue toggle switch to turn off protections. The site will reload with Enhanced Tracking Protection turned off. If this fixed the problem, click the shield to open the Protections panel again. Click Site fixed? Send report to let Firefox know. It will open the Report a Broken Site panel. Describe the problem to help us solve the problem faster. (Optional.) Click the Send Report button. When you report breakage, Mozilla receives the following information: Website URL (without query strings to avoid identifying your activity on the site) Operating system on the device Version of Firefox that you’re using Description of the problem that you’ve typed in the text box Your Firefox privacy settings: Enhanced Tracking Protection (On, Off or Only in private browsing) Your protection level (Standard, Strict or Custom) Third-party tracking cookies (Blocked or Allowed) Which third-party tracking cookie block list is being used (Level 1 or Level 2) Fingerprinting (Blocked or allowed) Cryptomining (Blocked or allowed) Other third-party cookies (Always blocked, Never blocked or Blocked from unvisited websites) Custom referrer settings from about:config If cookies are set to expire at the end of your session How long third-party storage will be kept Are you experiencing issues with a webpage that works fine in other browsers but not in Firefox? This could be a web compatibility (webcompat) issue. Common signs include: Slow or non-functional sites Broken images or videos Malfunctioning buttons, links and text boxes Missing content Issues with signing in or password autofill Problems when using an ad blocker To proactively combat these web compatibility issues, Firefox has integrated a user-friendly reporting tool directly into the browser. This tool enables users to swiftly report issues related to content blocking, thereby aiding in the enhancement of Firefox's performance and user experience. To ensure your privacy, the reporting tool allows you to edit the URL before reporting, enabling you to remove any personal information from the URL. For detailed information and precautions, turn to the Protect your information section detailed later in this article. Table of Contents 1 How can I access the Report broken site tool? 2 What information does Mozilla collect from your report? 3 Protect your information 3.1 Customizable URL 3.2 Optional Describe the Problem Text Box 4 What will Firefox do with your report? 5 Related content How can I access the Report broken site tool? If a site seems broken due to web compatibility or Enhanced Tracking Protection -related issues, you can report it directly to the Webcompat team. To report a non-Firefox site that isn’t working properly, follow these steps: At the top right, click the menu button to open the Firefox menu. At the bottom of the menu, select the option. Next, enter the site URL, pick an option from the dropdown menu under What's broken? , and, optionally, add a short description of the issue. To submit your report, click . A success message will confirm your submission. To conclude, click . The reporting tool will not work on a new tab or about: Firefox page. For Nightly and Beta channel users: You can send a detailed report using the Send more info link, located at the lower end of the Report a broken site panel. What information does Mozilla collect from your report? We wish to keep our process as transparent as possible. Any reports you send to Mozilla with this tool will include the following information when we receive it via our data pipeline: uuid: A single-use Unique User ID that helps us identify the specific report in our data pipeline. This is not tied to your Firefox profile in any way and cannot be used to identify you. If you submit multiple reports, it will be a different uuid each time. reported_at: The timestamp when our pipeline receives your report comments: Any notes you would like to share with us in the optional Describe the problem box. url = The URL of the site you are reporting. While the feature automatically populates the text field with the URL of the site you are currently on when you select Report Broken Site , you will be able to edit it prior to submitting the report. breakage_category = The answer you chose from the Choose reason dropdown menu details Device (Operating system, version, screen dimensions & touchscreen capability) User Agent String (Mozilla version, Gecko version, Firefox version and build date) Graphics (GPU model, version and rendering capabilities) Privacy settings If you’re submitting a report from a Private Browsing window If Firefox site isolation (Fission) is turned on If Total Cookie Protection is turned on Enhanced Tracking Protection (On, Off or Only in private browsing) Your protection level (Standard, Strict or Custom) Third-party tracking cookies (Blocked or Allowed) Which third-party tracking cookie block list is being used (Level 1 or 2) Fingerprinting (Blocked or Allowed) Cryptomining (Blocked or Allowed) Other third-party cookies (Always blocked, Never blocked or Blocked from unvisited websites) Custom referrer settings from about:config If cookies are set to expire at the end of your session How long third-party storage will be kept Security settings (Any antivirus software, antispyware or firewalls installed) Languages used for Firefox, and Any details you share in the optional Describe the problem text box Protect your information Customizable URL The Report broken site tool pre-fills the URL of the site you're reporting. Beware, some URLs might contain sensitive data, such as shipping details or personal tax information. To protect your privacy, edit the URL to omit personal details. Note, however, that changes to the URL might hinder our issue reproduction efforts. Optional Describe the Problem Text Box If you believe additional details in the Describe the Problem area could help resolve your web compatibility issue, feel free to include them. However, carefully consider the information you share. We implement measures to protect your data temporarily before it's securely discarded, but submitting sensitive information is ultimately your choice. Your contributions are crucial to our Webcompat team's efforts in improving Firefox. Providing extra context, including thorough responses to What’s broken? , aids us in identifying and rectifying major problems that negatively affect your browsing. What will Firefox do with your report? When you submit a Report broken site form, it's emailed to the Firefox Webcompat team and entered into a secure internal database accessible only to them. The team reviews these reports, actively filtering for and sanitizing any potentially sensitive personal information before sharing it with other Mozilla staff involved in issue resolution. Access to this data is strictly limited to Mozilla employees. Post-sanitization, the intention is to keep the data for trend analysis and compiling aggregated user statistics, ensuring it's eventually disposed of securely. Related content To learn more about the privacy principles that guide Mozilla's mission, visit: How to stay safe on the web Mozilla Privacy Policy Data Privacy Principles Firefox Privacy Notice Mozilla's Data Privacy FAQ",
  "products": [
    "firefox"
  ],
  "topics": [
    "performance-and-connectivity",
    "site-breakages"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 14219,
    "text_bytes": 7673,
    "word_count": 1213,
    "downloaded_at": "2025-08-26T10:46:42.058460"
  }
}