{
  "slug": "reset-your-firefox-account-password-recovery-keys",
  "title": "Reset your Mozilla account password with Recovery Keys",
  "summary": "Generate an account recovery key, so you can sign in to your Mozilla account to regain access to your synced data, in case you forget your password.",
  "url": "https://support.mozilla.org/en-US/kb/reset-your-firefox-account-password-recovery-keys",
  "html": "<p>\n</p><p>You can use your account recovery key to sign in to your Mozilla account to regain access to your data in case you forget your password.\n</p>\n<div class=\"warning\"><strong>Important:</strong> If you didn’t save your recovery key, you won’t be able to recover your synced data after resetting your password.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_why-does-resetting-my-password-reset-my-data\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Why does resetting my password reset my data?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_generate-and-store-your-account-recovery-key\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Generate and store your account recovery key</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-to-change-your-account-recovery-key\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How to change your account recovery key</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-to-delete-your-account-recovery-key\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">How to delete your account recovery key</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-to-reset-your-password-with-your-account-recovery-key\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">How to reset your password with your account recovery key</span></a></li><li class=\"toclevel-1\"><a href=\"#w_dont-have-your-recovery-key\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Don't have your recovery key?</span></a></li></ul></div>\n<h1 id=\"w_why-does-resetting-my-password-reset-my-data\">Why does resetting my password reset my data?</h1>\n<p>Mozilla accounts uses your password to encrypt your <a href=\"/en-US/kb/sync\">Sync</a> data (like bookmarks, passwords and settings) on Mozilla’s servers. If you forget your password and have to reset it, this data will be <em>erased</em> for security – unless you have a <strong>recovery key</strong>. A unique account recovery key allows you to reset your password without losing synced encrypted data.\n</p>\n<h1 id=\"w_generate-and-store-your-account-recovery-key\">Generate and store your account recovery key</h1>\n<div class=\"note\"><strong>Important:</strong> Do this, so you have your account recovery key ready in case you need to reset your password.</div>\n<ol><li> Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the menu panel.\n\n</li><li> Click your Mozilla account name at the top (or sign in if you're not already).\n<dl><dt> <img alt=\"Firefox_Mozilla Account Fx139_Menu account option\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-06-18-23-01-30-ed840f.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> Click <span class=\"menu\">Manage account</span>.\n<ul><li> The <em>Mozilla account</em> page will open in a new tab.\n</li></ul>\n</li><li> Under <em>Security</em>, next to <em>Account recovery key</em>, click <span class=\"button\">Create</span>.\n</li><li> On the on onboarding prompt, click <span class=\"button\">Get started</span>.\n</li><li> Enter your password and then click <span class=\"button\">Create account recovery key</span>.\n</li><li> Your account recovery key has been created! Click <span class=\"button\">Download and continue</span> to download a file with it.\n<dl><dt> <img alt=\"Mozilla Account_Recovery key created\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-06-18-23-03-01-0f67a6.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"400\">\n</dt></dl>\n<ul><li> You can also copy your key and then click <span class=\"button\">Continue without downloading</span>. In that case, make sure to save it manually.\n</li><li> Store your account recovery key in a safe location where you won't lose it.\n</li></ul>\n</li><li> Optionally, enter a hint to make it easier for you to remember where you stored your key. The hint will be shown during the password reset.\n</li><li> Click <span class=\"button\">Finish</span>.\n</li></ol>\n<h1 id=\"w_how-to-change-your-account-recovery-key\">How to change your account recovery key</h1>\n<p>If your account recovery key was exposed, or you just don't remember where you stored it, you can create a new one at any time. The previous one will lose its effect.\n</p>\n<ol><li> Follow the first three steps on the <a href=\"#w_generate-and-store-your-account-recovery-key\">Generate and store your account recovery key</a> section to go to the <em>Mozilla Account</em> page.\n</li><li> Under <em>Security</em>, next to <em>Account recovery key</em>, click <span class=\"button\">Change</span>.\n</li><li> Follow the remaining steps on the <a href=\"#w_generate-and-store-your-account-recovery-key\">Generate and store your account recovery key</a> section to create a new account recovery key.\n</li></ol>\n<h1 id=\"w_how-to-delete-your-account-recovery-key\">How to delete your account recovery key</h1>\n<ol><li> Follow the first three steps on the <a href=\"#w_generate-and-store-your-account-recovery-key\">Generate and store your account recovery key</a> section to go to the <em>Mozilla Account</em> page.\n</li><li> Under <em>Security</em>, next to <em>Account recovery key</em>, click the <em>Delete</em> <img alt=\"Mozilla Account_Delete account recovery key button\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-06-18-23-08-55-dfd5a8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button.\n</li><li> On the confirmation promp, click <span class=\"button\">Remove</span>.\n</li></ol>\n<h1 id=\"w_how-to-reset-your-password-with-your-account-recovery-key\">How to reset your password with your account recovery key</h1>\n<p>Go to the <a href=\"https://accounts.firefox.com/signin\">Mozilla account Sign in</a> page, click <strong>Forgot password?</strong> and follow the prompts. See <a href=\"/en-US/kb/how-change-or-reset-your-mozilla-account-password\">How to change or reset your Mozilla account password</a> under the <a href=\"/en-US/kb/how-change-or-reset-your-mozilla-account-password#w_password-reset-with-recovery-key\">Password reset with recovery key</a> section for detailed instructions.\n</p>\n<h1 id=\"w_dont-have-your-recovery-key\">Don't have your recovery key?</h1>\n<p>If your recovery key is not available or you want to reset your password without it, see the <a href=\"/en-US/kb/how-change-or-reset-your-mozilla-account-password#w_password-reset-without-recovery-key\">Password reset without recovery key</a> instructions within <a href=\"/en-US/kb/how-change-or-reset-your-mozilla-account-password\">How to change or reset your Mozilla account password</a>.\n</p>",
  "text": "You can use your account recovery key to sign in to your Mozilla account to regain access to your data in case you forget your password. Important: If you didn’t save your recovery key, you won’t be able to recover your synced data after resetting your password. Table of Contents 1 Why does resetting my password reset my data? 2 Generate and store your account recovery key 3 How to change your account recovery key 4 How to delete your account recovery key 5 How to reset your password with your account recovery key 6 Don't have your recovery key? Why does resetting my password reset my data? Mozilla accounts uses your password to encrypt your Sync data (like bookmarks, passwords and settings) on Mozilla’s servers. If you forget your password and have to reset it, this data will be erased for security – unless you have a recovery key . A unique account recovery key allows you to reset your password without losing synced encrypted data. Generate and store your account recovery key Important: Do this, so you have your account recovery key ready in case you need to reset your password. Click the menu button to open the menu panel. Click your Mozilla account name at the top (or sign in if you're not already). Click Manage account . The Mozilla account page will open in a new tab. Under Security , next to Account recovery key , click Create . On the on onboarding prompt, click Get started . Enter your password and then click Create account recovery key . Your account recovery key has been created! Click Download and continue to download a file with it. You can also copy your key and then click Continue without downloading . In that case, make sure to save it manually. Store your account recovery key in a safe location where you won't lose it. Optionally, enter a hint to make it easier for you to remember where you stored your key. The hint will be shown during the password reset. Click Finish . How to change your account recovery key If your account recovery key was exposed, or you just don't remember where you stored it, you can create a new one at any time. The previous one will lose its effect. Follow the first three steps on the Generate and store your account recovery key section to go to the Mozilla Account page. Under Security , next to Account recovery key , click Change . Follow the remaining steps on the Generate and store your account recovery key section to create a new account recovery key. How to delete your account recovery key Follow the first three steps on the Generate and store your account recovery key section to go to the Mozilla Account page. Under Security , next to Account recovery key , click the Delete button. On the confirmation promp, click Remove . How to reset your password with your account recovery key Go to the Mozilla account Sign in page, click Forgot password? and follow the prompts. See How to change or reset your Mozilla account password under the Password reset with recovery key section for detailed instructions. Don't have your recovery key? If your recovery key is not available or you want to reset your password without it, see the Password reset without recovery key instructions within How to change or reset your Mozilla account password .",
  "products": [
    "firefox",
    "mozilla-account"
  ],
  "topics": [
    "backup-recovery-and-sync",
    "passwords-and-sign-in",
    "reset-passwords",
    "save-passwords"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 7211,
    "text_bytes": 3232,
    "word_count": 574,
    "downloaded_at": "2025-08-26T10:46:31.058747"
  }
}