{
  "slug": "reset-your-primary-password-if-youve-forgotten-it",
  "title": "Reset your Primary Password if you've forgotten it",
  "summary": "You can reset your Firefox primary (formerly \"master\") password if you forgot it.  Warning: This removes all saved usernames and passwords.",
  "url": "https://support.mozilla.org/en-US/kb/reset-your-primary-password-if-youve-forgotten-it",
  "html": "<p>The <a href=\"/en-US/kb/use-primary-password-protect-stored-logins\">Primary Password</a> feature protects all of your locally stored usernames and passwords with a global password. If you have forgotten your primary password, you must reset it.\n</p>\n<div class=\"warning\"><strong>Warning:</strong> Resetting your Primary Password will remove all of your saved usernames and passwords.</div>\n<ol><li>In the Firefox address bar enter the following location:<br><div class=\"note\"><code>chrome://pippki/content/resetpassword.xhtml</code></div>\n</li><li>Press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>.\n</li><li>The \"Reset Primary Password\" page will appear. Click the <span class=\"button\">Reset</span> button to reset your primary password. \n</li></ol>\n<div class=\"warning\"><strong>Remember:</strong> Resetting your Primary Password will remove all of your saved usernames and passwords.</div>",
  "text": "The Primary Password feature protects all of your locally stored usernames and passwords with a global password. If you have forgotten your primary password, you must reset it. Warning: Resetting your Primary Password will remove all of your saved usernames and passwords. In the Firefox address bar enter the following location: chrome://pippki/content/resetpassword.xhtml Press Enter Return . The \"Reset Primary Password\" page will appear. Click the Reset button to reset your primary password. Remember: Resetting your Primary Password will remove all of your saved usernames and passwords.",
  "products": [
    "firefox"
  ],
  "topics": [
    "passwords-and-sign-in",
    "primary-password",
    "reset-passwords"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 996,
    "text_bytes": 593,
    "word_count": 86,
    "downloaded_at": "2025-08-26T11:03:22.658664"
  }
}