{
  "slug": "resist-fingerprinting",
  "title": "Resist Fingerprinting",
  "summary": "Firefox's Advanced Preferences to resist fingerprinting can help prevent websites from uniquely identifying your device but can cause problems. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/resist-fingerprinting",
  "html": "<p>When <em>Resist Fingerprinting</em> settings are enabled in Firefox Advanced Preferences (the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a> <em>about:config</em> page), it can help prevent websites from uniquely identifying you by limiting the information they can gather about your device. While this may be ideal for those prioritizing maximum privacy, it can cause some websites to function improperly. For most users, Mozilla recommends <a href=\"/en-US/kb/firefox-protection-against-fingerprinting\">Fingerprinting Protection</a> mode in Firefox Settings for <em>Enhanced Tracking Protection</em>, which blocks invasive tracking methods while maintaining compatibility with most websites.\n</p><p><a href=\"https://addons.mozilla.org/firefox/\">Add-ons</a> can enable <em>Resist Fingerprinting</em> in Advanced Preferences, which means it might be active without you explicitly enabling it. You can manage the <span class=\"pref\">privacy.resistFingerprinting</span> settings in the <em>about:config</em> page.\n</p>\n<h1 id=\"w_how-to-tell-if-you-have-resist-fingerprinting-enabled-and-if-so-disable-it\">How to tell if you have Resist Fingerprinting enabled, and if so, disable it</h1>\n<p></p><div class=\"warning\"><strong>Warning:</strong> These instructions are for experienced Firefox users. Changing settings in the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a> (<em>about:config</em>) can have serious effects on your browser’s stability, security and performance.\n<br><strong>Only proceed if you are comfortable with advanced settings and understand the potential impacts</strong>.</div>\nTo disable Resist Fingerprinting:\n<p></p>\n<ol><li>Type <strong>about:config</strong> in the <a href=\"/en-US/kb/search-firefox-address-bar\">address bar</a> and press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>.<br>A warning page may appear. Click <span class=\"button\">Accept the Risk and Continue</span> to go to the <em>about:config</em> page.\n\n</li><li>In the search bar at the top, search for <span class=\"pref\">privacy.resistFingerprinting</span>.\n</li><li>A number of preferences will appear but see if either <span class=\"pref\">privacy.resistFingerprinting</span> or <span class=\"pref\">privacy.resistFingerprinting.pbMode</span> have a value of <span class=\"pref\">true</span>.\n</li><li>To tell if an extension is controlling this preference, you can click toggle the value back to <span class=\"pref\">false</span> and restart your browser. After restarting, visit <em>about:config</em> again, and see if the value has been returned to <span class=\"pref\">true</span>.\n</li></ol>\n<p>If it has been, you will need to determine which of your extensions is controlling the preference and disable or remove them. One way to do this is to disable the installed extensions one by one, and restart the browser, seeing if the preference is changed upon restarting Firefox. Please be aware that, in rare cases, <em>multiple</em> extensions might be setting the preference.\n</p><p></p><section class=\"mzp-c-details\">\n<p></p>\n<h2 id=\"w_how-might-resist-fingerprinting-break-web-pages\">How might Resist Fingerprinting break web pages?</h2>\n<p>Resist Fingerprinting causes a number of strange behaviors that are commonly filed as bugs. While they do cause the website to behave strangely or incorrectly, these behaviors also mean that Resist Fingerprinting is working as intended, which is why we do not recommend this feature for the average Firefox user.\n</p><p>It is also important to note that if <span class=\"pref\">privacy.resistFingerprinting.pbMode</span> is set, but <span class=\"pref\">privacy.resistFingerprinting</span> is not – you will still get certain Resist Fingerprinting behaviors on normal windows, because it is not possible to separate these behaviors per-window. This includes using fixed instead of system colors and others.\n</p><p>The most common unexpected behaviors include:\n</p>\n<ul><li>Times are displayed incorrectly or more accurately – they are displayed in the wrong timezone.\n</li><li>Images, especially those created as a result of uploading/editing an image in the browser, may display random lines. For example:\n</li></ul>\n<p><img alt=\"Resist Fingerprinting image breakage\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-10-13-12-40-12-237c65.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</p>\n<ul><li>Certain animations or games may run sluggishly.\n</li><li>Pages may not be localized in the expected language and be in English instead.\n</li><li>Users of macOS or Linux may receive information or downloads intended for the Windows operating system instead.\n</li><li>Icons, maps or images may not be rendered in high fidelity, and appear blurry or low resolution.\n</li><li>Gamepads do not work.\n</li><li>Writing tablets, styluses or touchscreens do not work as expected.\n</li><li>Display preferences such as Light/Dark Mode, Reduced Animations and Reduced Transparency are not respected.\n</li><li>When new windows are opened, they are fixed to a specific size.\n</li><li>The native system colors are replaced, and fixed values are used instead.\n</li></ul>\n<p></p></section>\n<p></p><p></p><section class=\"mzp-c-details\">\n<p></p>\n<h2 id=\"w_what-does-resist-fingerprinting-alter\">What does Resist Fingerprinting alter?</h2>\n<p>Resist Fingerprinting changes a lot of browser behavior – the list below is intended to be both technical in nature and as comprehensive as possible, but still may omit things by accident.\n</p>\n<ul><li>The timezone is reported as UTC or Icelandic.\n</li><li>Math operations in JavaScript may report slightly different values than regular.\n</li><li>The locale is reported as en-US.\n</li><li>The only fonts available to be used by websites are those pre-installed in the Operating System. This also excludes fonts in language packs.\n</li><li>Several properties of the navigator object are fixed, including the hardware concurrency value, application version and build ID. The User Agent version is reported to be the major version (for example, 119.0 instead of 119.1).\n</li><li>The Operating System reported in the HTTP header is Windows, the operating system reported in the navigator object in JavaScript is accurate.\n</li><li>Without granting any permission, only one camera and microphone are reported as media devices. Certain device errors may be reported as “not allowed” instead of “not found”. Device Change events are not reported.\n</li><li>Video and Audio Streams Labels are fixed to “Internal Camera” or “Internal Microphone”.\n</li><li>Media Capabilities are reported as being supported, smooth and not power efficient.\n</li><li>The Video Facing Mode is a fixed value.\n</li><li>The preferred sample rate for Audio is reported as 44100, and the sample rate is reported as 48000.\n</li><li>The Audio Context latency is fixed, and the number of maximum channels is reported as 2.\n</li><li>No gamepads are ever reported as present.\n</li><li>The Network Connection type is reported as “Unknown”.\n</li><li>On macOS, the OS Font Smoothing preference is not respected.\n</li><li>All Device Sensors are disabled.\n</li><li>The frame rate is locked at 60fps.\n</li><li>The precision of all reported timestamps, timers and clocks are reduced to 16.67ms (to match 60fps).\n</li><li>The Outer Window dimensions are reported to be the same as the inner window dimensions.\n</li><li>The window.screenX and screenY properties, as well as mozInnerScreenX and mozInnerScreenY, and event screen coordinates are always reported as 0,0.\n</li><li>The screen top, left, width and height, and screen available top, left, width and height are all reported the same as the window inner dimensions.\n</li><li>The Screen Pixel Depth is reported as 24.\n</li><li>The device pixel ratio is reported as 2.0.\n</li><li>The CSS Resolution is reported as the zoom level, instead of taking into account the true device pixel ratio.\n</li><li>The screen orientation is set to Landscape, as the screen angle is set to 0. OrientationChanged events are suppressed.\n</li><li>The Radius, Rotation and Force attributes of Touch Events are set to 0.\n</li><li>The Max Touch Pointers for Pointer Events is set to 0.\n</li><li>Several Pointer Event attributes, such as Tilt and Pressure, are set to constant values.\n</li><li>All pointer events are set to come from a single primary pointing device.\n</li><li>The pointer capabilities are reported to be Coarse (Android) or Fine &amp; Hover (Desktop).\n</li><li>The key codes for Keyboard Events are modified to avoid leaking the keyboard layout.\n</li><li>The WebSpeech API does not report any available voices.\n</li><li>CSS will report the preferred color scheme as Light.\n</li><li>CSS will report preferred reduced motion as False.\n</li><li>CSS will report preferred contrast as No Preference.\n</li></ul>\n<p></p></section>\n<p></p>",
  "text": "When Resist Fingerprinting settings are enabled in Firefox Advanced Preferences (the Configuration Editor about:config page), it can help prevent websites from uniquely identifying you by limiting the information they can gather about your device. While this may be ideal for those prioritizing maximum privacy, it can cause some websites to function improperly. For most users, Mozilla recommends Fingerprinting Protection mode in Firefox Settings for Enhanced Tracking Protection , which blocks invasive tracking methods while maintaining compatibility with most websites. Add-ons can enable Resist Fingerprinting in Advanced Preferences, which means it might be active without you explicitly enabling it. You can manage the privacy.resistFingerprinting settings in the about:config page. How to tell if you have Resist Fingerprinting enabled, and if so, disable it Warning: These instructions are for experienced Firefox users. Changing settings in the Configuration Editor ( about:config ) can have serious effects on your browser’s stability, security and performance. Only proceed if you are comfortable with advanced settings and understand the potential impacts . To disable Resist Fingerprinting: Type about:config in the address bar and press Enter Return . A warning page may appear. Click Accept the Risk and Continue to go to the about:config page. In the search bar at the top, search for privacy.resistFingerprinting . A number of preferences will appear but see if either privacy.resistFingerprinting or privacy.resistFingerprinting.pbMode have a value of true . To tell if an extension is controlling this preference, you can click toggle the value back to false and restart your browser. After restarting, visit about:config again, and see if the value has been returned to true . If it has been, you will need to determine which of your extensions is controlling the preference and disable or remove them. One way to do this is to disable the installed extensions one by one, and restart the browser, seeing if the preference is changed upon restarting Firefox. Please be aware that, in rare cases, multiple extensions might be setting the preference. How might Resist Fingerprinting break web pages? Resist Fingerprinting causes a number of strange behaviors that are commonly filed as bugs. While they do cause the website to behave strangely or incorrectly, these behaviors also mean that Resist Fingerprinting is working as intended, which is why we do not recommend this feature for the average Firefox user. It is also important to note that if privacy.resistFingerprinting.pbMode is set, but privacy.resistFingerprinting is not – you will still get certain Resist Fingerprinting behaviors on normal windows, because it is not possible to separate these behaviors per-window. This includes using fixed instead of system colors and others. The most common unexpected behaviors include: Times are displayed incorrectly or more accurately – they are displayed in the wrong timezone. Images, especially those created as a result of uploading/editing an image in the browser, may display random lines. For example: Certain animations or games may run sluggishly. Pages may not be localized in the expected language and be in English instead. Users of macOS or Linux may receive information or downloads intended for the Windows operating system instead. Icons, maps or images may not be rendered in high fidelity, and appear blurry or low resolution. Gamepads do not work. Writing tablets, styluses or touchscreens do not work as expected. Display preferences such as Light/Dark Mode, Reduced Animations and Reduced Transparency are not respected. When new windows are opened, they are fixed to a specific size. The native system colors are replaced, and fixed values are used instead. What does Resist Fingerprinting alter? Resist Fingerprinting changes a lot of browser behavior – the list below is intended to be both technical in nature and as comprehensive as possible, but still may omit things by accident. The timezone is reported as UTC or Icelandic. Math operations in JavaScript may report slightly different values than regular. The locale is reported as en-US. The only fonts available to be used by websites are those pre-installed in the Operating System. This also excludes fonts in language packs. Several properties of the navigator object are fixed, including the hardware concurrency value, application version and build ID. The User Agent version is reported to be the major version (for example, 119.0 instead of 119.1). The Operating System reported in the HTTP header is Windows, the operating system reported in the navigator object in JavaScript is accurate. Without granting any permission, only one camera and microphone are reported as media devices. Certain device errors may be reported as “not allowed” instead of “not found”. Device Change events are not reported. Video and Audio Streams Labels are fixed to “Internal Camera” or “Internal Microphone”. Media Capabilities are reported as being supported, smooth and not power efficient. The Video Facing Mode is a fixed value. The preferred sample rate for Audio is reported as 44100, and the sample rate is reported as 48000. The Audio Context latency is fixed, and the number of maximum channels is reported as 2. No gamepads are ever reported as present. The Network Connection type is reported as “Unknown”. On macOS, the OS Font Smoothing preference is not respected. All Device Sensors are disabled. The frame rate is locked at 60fps. The precision of all reported timestamps, timers and clocks are reduced to 16.67ms (to match 60fps). The Outer Window dimensions are reported to be the same as the inner window dimensions. The window.screenX and screenY properties, as well as mozInnerScreenX and mozInnerScreenY, and event screen coordinates are always reported as 0,0. The screen top, left, width and height, and screen available top, left, width and height are all reported the same as the window inner dimensions. The Screen Pixel Depth is reported as 24. The device pixel ratio is reported as 2.0. The CSS Resolution is reported as the zoom level, instead of taking into account the true device pixel ratio. The screen orientation is set to Landscape, as the screen angle is set to 0. OrientationChanged events are suppressed. The Radius, Rotation and Force attributes of Touch Events are set to 0. The Max Touch Pointers for Pointer Events is set to 0. Several Pointer Event attributes, such as Tilt and Pressure, are set to constant values. All pointer events are set to come from a single primary pointing device. The pointer capabilities are reported to be Coarse (Android) or Fine & Hover (Desktop). The key codes for Keyboard Events are modified to avoid leaking the keyboard layout. The WebSpeech API does not report any available voices. CSS will report the preferred color scheme as Light. CSS will report preferred reduced motion as False. CSS will report preferred contrast as No Preference.",
  "products": [
    "firefox"
  ],
  "topics": [
    "advanced-and-experimental-features",
    "performance-and-connectivity",
    "privacy-and-security",
    "site-breakages"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 9091,
    "text_bytes": 7017,
    "word_count": 1102,
    "downloaded_at": "2025-08-26T10:57:20.235742"
  }
}