{
  "slug": "restore-bookmarks-from-backup-or-move-them",
  "title": "Restore bookmarks from backup or move them to another computer",
  "summary": "Learn how to restore your bookmarks from the automatic backups that Firefox creates, save and restore your own backups, and move bookmarks to another computer.",
  "url": "https://support.mozilla.org/en-US/kb/restore-bookmarks-from-backup-or-move-them",
  "html": "<p>Firefox automatically creates backups of your <a href=\"/en-US/kb/bookmarks-firefox\">bookmarks</a> and saves the last 15 backups for safekeeping. This article describes how to restore your bookmarks from the automatic backups that Firefox creates, how to save and restore your own bookmark backup files, and how to move your bookmarks to another computer.\n</p>\n<ul><li> If your bookmarks suddenly become unavailable in Firefox, see <a href=\"/en-US/kb/recover-lost-or-missing-bookmarks\">Recover lost or missing Bookmarks</a> for troubleshooting information.\n</li><li> For more information about using bookmarks, see <a href=\"/en-US/kb/bookmarks-firefox\">Bookmarks in Firefox</a>.\n</li></ul>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_backup-and-restore\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Backup and restore</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_manual-backup\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Manual backup</span></a></li><li class=\"toclevel-2\"><a href=\"#w_restoring-from-backups\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Restoring from backups</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_moving-bookmarks-to-another-computer\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Moving bookmarks to another computer</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_using-firefox-sync\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Using Firefox Sync</span></a></li><li class=\"toclevel-2\"><a href=\"#w_using-a-bookmark-backup-file\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">Using a bookmark backup file</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_restoring-bookmarks-after-upgrading-or-downgrading-windows-10\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Restoring bookmarks after upgrading or downgrading Windows 10</span></a></li></ul></div>\n<h1 id=\"w_backup-and-restore\">Backup and restore</h1>\n<h2 id=\"w_manual-backup\">Manual backup</h2>\n<ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the menu panel.\n Click <span class=\"menu\">Bookmarks</span> and then click the <span class=\"menu\">Manage bookmarks</span> bar at the bottom.\n\n</li><li> In the Library window, click the <span class=\"for\" data-for=\"mac\"><img alt=\"import-export-arrows\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-04-10-18-16-d309be.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"win,linux\"><span class=\"button\">Import and Backup</span></span> button and then select <span class=\"menu\">Backup…</span>.<span class=\"for\" data-for=\"win\"><br><img alt=\"Bookmarks Backup 68\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-05-08-14-55-26baa0.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</li><li> In the Bookmarks backup filename window that opens, choose a location to save the file, which is named <span class=\"filepath\">bookmarks-\"date\".json</span> by default. The desktop is usually a good spot, but any place that is easy to remember will work.\n</li><li> Save the bookmarks json file. The Bookmarks backup filename window will close and then you can close the Library window.\n</li></ol>\n<h2 id=\"w_restoring-from-backups\">Restoring from backups</h2>\n<div class=\"warning\"><strong>Caution: Restoring bookmarks from a backup will overwrite your current set of bookmarks with the ones in the backup file.</strong></div>\n<ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the menu panel.\n Click <span class=\"menu\">Bookmarks</span> and then click the <span class=\"menu\">Manage bookmarks</span> bar at the bottom.\n\n</li><li> In the Library window, click the <span class=\"for\" data-for=\"mac\"><img alt=\"import-export-arrows\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-04-10-18-16-d309be.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"win,linux\"><span class=\"button\">Import and Backup</span></span> button and then select <span class=\"menu\">Restore</span>. <span class=\"for\" data-for=\"win\"><br> <img alt=\"Bookmarks Restore 68\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-05-08-19-30-c86aaa.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</li><li> Select the backup from which you want to restore:\n<ul><li> The dated entries are automatic bookmark backups.\n</li><li> <span class=\"menu\">Choose File…</span> lets you restore from a manual backup (see above).\n</li></ul>\n</li><li> After selecting a backup and confirming your choice, your bookmarks from that backup will be restored.\n</li><li> Close the Library window.\n</li></ol>\n<h1 id=\"w_moving-bookmarks-to-another-computer\">Moving bookmarks to another computer</h1>\n<h2 id=\"w_using-firefox-sync\">Using Firefox Sync</h2>\n<p>You can use Firefox Sync to move your bookmarks from one computer to another.\n</p>\n<div class=\"note\"> <strong>Important:</strong> Firefox Sync continuously updates itself as you change bookmarks, so <strong>it does not provide a true backup service</strong>, nor is it intended to be used as one. </div>\n<p>Firefox Sync is the best way to keep your bookmarks (and other profile data) synchronized between all of the computers you use. See <a href=\"/en-US/kb/how-do-i-set-sync-my-computer\">How do I set up Sync on my computer?</a> for more information and instructions on setting it up.\n</p>\n<h2 id=\"w_using-a-bookmark-backup-file\">Using a bookmark backup file</h2>\n<p>You can also use a bookmark backup file from one computer and restore it on another computer. This is useful if you can't synchronize the two computers' bookmarks using Sync, for some reason.\n</p><p>The bookmark backup file can either be a <a href=\"#w_manual-backup\">manual backup</a> (see above) or one of the automatic dated backups located inside the <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">Firefox profile folder</a> named <span class=\"filepath\">bookmarkbackups</span> folder. Place the bookmark backup file on your transfer media (for example a Flash drive) and copy it to the desktop (or any location) of the other computer. You can then restore the backup from the Firefox Library window, using the <span class=\"menu\">Choose File…</span> option, as described in the <a href=\"#w_restoring-from-backups\">Restoring from backups</a> section above.\n</p>\n<h1 id=\"w_restoring-bookmarks-after-upgrading-or-downgrading-windows-10\">Restoring bookmarks after upgrading or downgrading Windows 10</h1>\n<p>After upgrading or downgrading your Windows 10 operating system, a directory named <span class=\"filepath\">Windows.old</span> is created, and most of the data erased from the upgrade or downgrade is stored there. One especially useful item is the Bookmarks from Firefox. Follow the instructions in <a href=\"#w_restoring-from-backups\">Restoring from backups</a> above, and when you select <span class=\"menu\">Choose File…</span>, follow the path <em>C:\\Windows.old\\Users\\&lt;UserName&gt;\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles\\&lt;filename.default&gt;\\bookmarkbackups</em> to your previous bookmarks. Check the file date for information when the backup was created. Be aware using a backup bookmark folder will replace all the bookmarks in Firefox with the bookmarks in the backup file.\n</p>",
  "text": "Firefox automatically creates backups of your bookmarks and saves the last 15 backups for safekeeping. This article describes how to restore your bookmarks from the automatic backups that Firefox creates, how to save and restore your own bookmark backup files, and how to move your bookmarks to another computer. If your bookmarks suddenly become unavailable in Firefox, see Recover lost or missing Bookmarks for troubleshooting information. For more information about using bookmarks, see Bookmarks in Firefox . Table of Contents 1 Backup and restore 1.1 Manual backup 1.2 Restoring from backups 2 Moving bookmarks to another computer 2.1 Using Firefox Sync 2.2 Using a bookmark backup file 3 Restoring bookmarks after upgrading or downgrading Windows 10 Backup and restore Manual backup Click the menu button to open the menu panel. Click Bookmarks and then click the Manage bookmarks bar at the bottom. In the Library window, click the Import and Backup button and then select Backup… . In the Bookmarks backup filename window that opens, choose a location to save the file, which is named bookmarks-\"date\".json by default. The desktop is usually a good spot, but any place that is easy to remember will work. Save the bookmarks json file. The Bookmarks backup filename window will close and then you can close the Library window. Restoring from backups Caution: Restoring bookmarks from a backup will overwrite your current set of bookmarks with the ones in the backup file. Click the menu button to open the menu panel. Click Bookmarks and then click the Manage bookmarks bar at the bottom. In the Library window, click the Import and Backup button and then select Restore . Select the backup from which you want to restore: The dated entries are automatic bookmark backups. Choose File… lets you restore from a manual backup (see above). After selecting a backup and confirming your choice, your bookmarks from that backup will be restored. Close the Library window. Moving bookmarks to another computer Using Firefox Sync You can use Firefox Sync to move your bookmarks from one computer to another. Important: Firefox Sync continuously updates itself as you change bookmarks, so it does not provide a true backup service , nor is it intended to be used as one. Firefox Sync is the best way to keep your bookmarks (and other profile data) synchronized between all of the computers you use. See How do I set up Sync on my computer? for more information and instructions on setting it up. Using a bookmark backup file You can also use a bookmark backup file from one computer and restore it on another computer. This is useful if you can't synchronize the two computers' bookmarks using Sync, for some reason. The bookmark backup file can either be a manual backup (see above) or one of the automatic dated backups located inside the Firefox profile folder named bookmarkbackups folder. Place the bookmark backup file on your transfer media (for example a Flash drive) and copy it to the desktop (or any location) of the other computer. You can then restore the backup from the Firefox Library window, using the Choose File… option, as described in the Restoring from backups section above. Restoring bookmarks after upgrading or downgrading Windows 10 After upgrading or downgrading your Windows 10 operating system, a directory named Windows.old is created, and most of the data erased from the upgrade or downgrade is stored there. One especially useful item is the Bookmarks from Firefox. Follow the instructions in Restoring from backups above, and when you select Choose File… , follow the path C:\\Windows.old\\Users\\<UserName>\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles\\<filename.default>\\bookmarkbackups to your previous bookmarks. Check the file date for information when the backup was created. Be aware using a backup bookmark folder will replace all the bookmarks in Firefox with the bookmarks in the backup file.",
  "products": [
    "firefox"
  ],
  "topics": [
    "backup-data",
    "backup-recovery-and-sync",
    "bookmarks",
    "browse",
    "import-and-export-settings",
    "settings",
    "sync-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 8412,
    "text_bytes": 3927,
    "word_count": 632,
    "downloaded_at": "2025-08-26T09:04:30.432890"
  }
}