{
  "slug": "review-checker-review-quality",
  "title": "Shop online with more confidence using Firefox Review Checker",
  "summary": "See how reliable product reviews are when you shop online using Review Checker in Firefox.",
  "url": "https://support.mozilla.org/en-US/kb/review-checker-review-quality",
  "html": "<div class=\"warning\"><strong>Important Update:</strong> The Review Checker feature is shutting down and will no longer be available after June 10, 2025.</div>\n<p>Explore Review Checker, a Firefox feature that enables you to know whether reviews are reliable when you shop online with <a href=\"http://Amazon.com\">Amazon.com</a>, <a href=\"http://BestBuy.com\">BestBuy.com</a> and <a href=\"http://Walmart.com\">Walmart.com</a>. This article will guide you through what this feature offers and how to make the most of it.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_about-review-checker\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">About Review Checker</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_how-it-works\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">How it works</span></a></li><li class=\"toclevel-2\"><a href=\"#w_how-review-quality-is-determined\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">How review quality is determined</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_how-to-use-review-checker\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How to use Review Checker</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_turn-off-review-checker\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Turn off Review Checker</span></a></li><li class=\"toclevel-2\"><a href=\"#w_turn-review-checker-back-on\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">Turn Review Checker back on</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_protect-your-privacy\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Protect your privacy</span></a></li><li class=\"toclevel-1\"><a href=\"#w_recommended-and-sponsored-products\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Recommended and sponsored products</span></a></li><li class=\"toclevel-1\"><a href=\"#w_frequently-asked-questions\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Frequently asked questions</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_what-is-the-difference-between-review-quality-and-product-quality\"><span class=\"tocnumber\">5.1</span> <span class=\"toctext\">What is the difference between review quality and product quality?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_will-review-checker-affect-my-browsing-speed-or-performance\"><span class=\"tocnumber\">5.2</span> <span class=\"toctext\">Will Review Checker affect my browsing speed or performance?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_can-i-customize-review-checkers-settings\"><span class=\"tocnumber\">5.3</span> <span class=\"toctext\">Can I customize Review Checker's settings?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_can-i-use-review-checker-on-websites-other-than-amazon-best-buy-and-walmart\"><span class=\"tocnumber\">5.4</span> <span class=\"toctext\">Can I use Review Checker on websites other than Amazon, Best Buy and Walmart?</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<h1 id=\"w_about-review-checker\">About Review Checker</h1>\n<p>Firefox's Review Checker is a feature to help you make informed purchasing decisions. Powered by <a href=\"https://www.fakespot.com/our-mission\">Fakespot by Mozilla</a>, this feature assesses the quality of product reviews by helping you know whether the reviews are likely from real customers or whether they’re from biased or paid reviewers.\n</p>\n<h2 id=\"w_how-it-works\">How it works</h2>\n<p>Review Checker uses AI technology to analyze reviews on Amazon, Best Buy and Walmart. It assigns each product's reviews a <strong>letter grade</strong>, ranging from A to F, indicating their reliability.\n</p>\n<ul><li><strong>A and B:</strong> Reliable reviews. We believe the reviews are likely from real customers who left honest, unbiased reviews.\n</li><li><strong>C:</strong> We believe there’s a mix of reliable and unreliable reviews.\n</li><li><strong>D and F:</strong> Unreliable reviews. We believe the reviews are likely fake or from biased reviewers.\n</li></ul>\n<p>The <strong>adjusted rating</strong> in Review Checker is based only on reviews we believe to be reliable. <strong>Highlights</strong> are from the retailer’s reviews within the last 80 days that we believe to be reliable.\n</p>\n<h2 id=\"w_how-review-quality-is-determined\">How review quality is determined</h2>\n<p>Fakespot's AI technology undergoes continuous improvement as it analyzes more data. It scrutinizes reviews, searching for patterns that indicate fake or unreliable content, and applies various tests to ensure accuracy. We place a strong emphasis on reviews from real consumers who have purchased and used a product as the most reliable source of feedback.\n</p>\n<h1 id=\"w_how-to-use-review-checker\">How to use Review Checker</h1>\n<ol><li>When you're on a product detail page on Amazon, Best Buy or Walmart, look for the price tag icon in the address bar.\n<dl><dt><img alt=\"Fx129OpenReviewChecker-AddressBarIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-08-19-07-50-36-2c364b.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>Click the price tag icon <img alt=\"Fx129OpenReviewCheckerIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-08-19-07-09-53-c6397f.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"20\">.\n</li><li>Select <img alt=\"Yes try it button\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-10-05-13-25-05-e8c731.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"80\"> to turn the Review Checker on.\n<dl><dt><img alt=\"Review checker for desktop\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-11-20-06-39-58-05e465.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<p>To close the Review Checker, click the ✕ icon in the upper right corner of the sidebar. Alternatively, click the blue price tag icon <img alt=\"review checker icon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-10-05-13-23-25-8c3fa8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"30\"> in the address bar.\n</p>\n<h2 id=\"w_turn-off-review-checker\">Turn off Review Checker</h2>\n<p>In the <em>Settings</em> section at the bottom of the Review Checker, choose <span class=\"menu\">Turn off Review Checker</span>.\n</p>\n<h2 id=\"w_turn-review-checker-back-on\">Turn Review Checker back on</h2>\n<ul><li>To use Review Checker again after you’ve turned it off, visit a product detail page on one of the supported retailers.\n</li><li>Click the price tag icon <img alt=\"Fx129OpenReviewCheckerIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-08-19-07-09-53-c6397f.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"20\"> and select <img alt=\"Yes try it button\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-10-05-13-25-05-e8c731.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"80\"> to turn Review Checker back on.\n</li></ul>\n<h1 id=\"w_protect-your-privacy\">Protect your privacy</h1>\n<p>Firefox is committed to empowering you with information about review reliability while respecting your privacy. We use <a href=\"https://blog.mozilla.org/en/products/firefox/partnership-ohttp-prio/\">Oblivious HTTP (OHTTP)</a> for Review Checker.\n</p><p>When Review Checker is turned on, we use information about the products you visit on Amazon, Best Buy and Walmart to analyze the reviews, but by using OHTTP we ensure Mozilla cannot link you or your device to the products you have viewed. OHTTP uses encryption and a third party intermediary server, so all Mozilla learns from this network request is that someone, somewhere, looked at a given product.\n</p>\n<h1 id=\"w_recommended-and-sponsored-products\">Recommended and sponsored products</h1>\n<p>Related products will sometimes appear in Review Checker, under <em>More to consider</em>. These can be sponsored or non-sponsored products. Either way, our goal is to make the content helpful to your shopping experience.\n</p><p>All products (both sponsored and non-sponsored):\n</p>\n<ul><li><strong>Are highly relevant to the product you're viewing</strong>. We do not display products based on a stored history of searches. For example, if you’re currently viewing a standing desk, we may show a recommendation for another standing desk.\n</li><li><strong>Have reliable reviews</strong> (an A or B letter grade) and an adjusted rating of at least 3.5 stars.\n</li><li><strong>Protect your privacy</strong>. We use Oblivious HTTP (OHTTP) to prevent Firefox and our partners from tracking the products you view. Learn more in the <a href=\"#w_protect-your-privacy\">Protect your privacy</a> section above.\n</li></ul>\n<p>Sponsored products will say <em>sponsored</em> underneath.\n</p><p>If you prefer to not see related products (both sponsored and non-sponsored), simply go to <span class=\"menu\">Settings</span> at the bottom of <em>Review Checker</em>:\n</p>\n<dl><dt><img alt=\"Fx131ReviewCheckerSettings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-10-08-10-07-40-c90c12.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>Click the <strong>Show recommendations and sponsored content</strong> toggle to switch it off <img alt=\"Review checker toggle off\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-10-08-05-10-30-b5e7d9.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">.\n</p>\n<h1 id=\"w_frequently-asked-questions\">Frequently asked questions</h1>\n<h2 id=\"w_what-is-the-difference-between-review-quality-and-product-quality\">What is the difference between review quality and product quality?</h2>\n<p>Review Checker is designed to evaluate the authenticity of product reviews on e-commerce websites. It assigns letter grades to reviews to help you identify reliable and unreliable feedback, and assess the likelihood that feedback and ratings come from real customers. It does not assess the quality of the product itself, which involves evaluating its actual features, performance and durability. Review Checker focuses solely on review quality and does not provide insights into the product's performance or features.\n</p>\n<h2 id=\"w_will-review-checker-affect-my-browsing-speed-or-performance\">Will Review Checker affect my browsing speed or performance?</h2>\n<p>Review Checker is designed to be lightweight and should not impact your browsing speed or overall browser performance. It operates in the background and does not consume substantial system resources.\n</p>\n<h2 id=\"w_can-i-customize-review-checkers-settings\">Can I customize Review Checker's settings?</h2>\n<p>Currently, Review Checker does not offer customization options. It operates based on predefined algorithms to assess review quality automatically.\n</p>\n<h2 id=\"w_can-i-use-review-checker-on-websites-other-than-amazon-best-buy-and-walmart\">Can I use Review Checker on websites other than Amazon, Best Buy and Walmart?</h2>\n<p>Currently, Review Checker only supports three US-based retailers: Amazon, Best Buy and Walmart. We are working on expanding this feature to other locales and retailers.\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/how-review-checker-preserves-user-privacy\">How Review Checker preserves user privacy</a>\n</li></ul>",
  "text": "Important Update: The Review Checker feature is shutting down and will no longer be available after June 10, 2025. Explore Review Checker, a Firefox feature that enables you to know whether reviews are reliable when you shop online with Amazon.com , BestBuy.com and Walmart.com . This article will guide you through what this feature offers and how to make the most of it. Table of Contents 1 About Review Checker 1.1 How it works 1.2 How review quality is determined 2 How to use Review Checker 2.1 Turn off Review Checker 2.2 Turn Review Checker back on 3 Protect your privacy 4 Recommended and sponsored products 5 Frequently asked questions 5.1 What is the difference between review quality and product quality? 5.2 Will Review Checker affect my browsing speed or performance? 5.3 Can I customize Review Checker's settings? 5.4 Can I use Review Checker on websites other than Amazon, Best Buy and Walmart? 6 Related articles About Review Checker Firefox's Review Checker is a feature to help you make informed purchasing decisions. Powered by Fakespot by Mozilla , this feature assesses the quality of product reviews by helping you know whether the reviews are likely from real customers or whether they’re from biased or paid reviewers. How it works Review Checker uses AI technology to analyze reviews on Amazon, Best Buy and Walmart. It assigns each product's reviews a letter grade , ranging from A to F, indicating their reliability. A and B: Reliable reviews. We believe the reviews are likely from real customers who left honest, unbiased reviews. C: We believe there’s a mix of reliable and unreliable reviews. D and F: Unreliable reviews. We believe the reviews are likely fake or from biased reviewers. The adjusted rating in Review Checker is based only on reviews we believe to be reliable. Highlights are from the retailer’s reviews within the last 80 days that we believe to be reliable. How review quality is determined Fakespot's AI technology undergoes continuous improvement as it analyzes more data. It scrutinizes reviews, searching for patterns that indicate fake or unreliable content, and applies various tests to ensure accuracy. We place a strong emphasis on reviews from real consumers who have purchased and used a product as the most reliable source of feedback. How to use Review Checker When you're on a product detail page on Amazon, Best Buy or Walmart, look for the price tag icon in the address bar. Click the price tag icon . Select to turn the Review Checker on. To close the Review Checker, click the ✕ icon in the upper right corner of the sidebar. Alternatively, click the blue price tag icon in the address bar. Turn off Review Checker In the Settings section at the bottom of the Review Checker, choose Turn off Review Checker . Turn Review Checker back on To use Review Checker again after you’ve turned it off, visit a product detail page on one of the supported retailers. Click the price tag icon and select to turn Review Checker back on. Protect your privacy Firefox is committed to empowering you with information about review reliability while respecting your privacy. We use Oblivious HTTP (OHTTP) for Review Checker. When Review Checker is turned on, we use information about the products you visit on Amazon, Best Buy and Walmart to analyze the reviews, but by using OHTTP we ensure Mozilla cannot link you or your device to the products you have viewed. OHTTP uses encryption and a third party intermediary server, so all Mozilla learns from this network request is that someone, somewhere, looked at a given product. Recommended and sponsored products Related products will sometimes appear in Review Checker, under More to consider . These can be sponsored or non-sponsored products. Either way, our goal is to make the content helpful to your shopping experience. All products (both sponsored and non-sponsored): Are highly relevant to the product you're viewing . We do not display products based on a stored history of searches. For example, if you’re currently viewing a standing desk, we may show a recommendation for another standing desk. Have reliable reviews (an A or B letter grade) and an adjusted rating of at least 3.5 stars. Protect your privacy . We use Oblivious HTTP (OHTTP) to prevent Firefox and our partners from tracking the products you view. Learn more in the Protect your privacy section above. Sponsored products will say sponsored underneath. If you prefer to not see related products (both sponsored and non-sponsored), simply go to Settings at the bottom of Review Checker : Click the Show recommendations and sponsored content toggle to switch it off . Frequently asked questions What is the difference between review quality and product quality? Review Checker is designed to evaluate the authenticity of product reviews on e-commerce websites. It assigns letter grades to reviews to help you identify reliable and unreliable feedback, and assess the likelihood that feedback and ratings come from real customers. It does not assess the quality of the product itself, which involves evaluating its actual features, performance and durability. Review Checker focuses solely on review quality and does not provide insights into the product's performance or features. Will Review Checker affect my browsing speed or performance? Review Checker is designed to be lightweight and should not impact your browsing speed or overall browser performance. It operates in the background and does not consume substantial system resources. Can I customize Review Checker's settings? Currently, Review Checker does not offer customization options. It operates based on predefined algorithms to assess review quality automatically. Can I use Review Checker on websites other than Amazon, Best Buy and Walmart? Currently, Review Checker only supports three US-based retailers: Amazon, Best Buy and Walmart. We are working on expanding this feature to other locales and retailers. Related articles How Review Checker preserves user privacy",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 12536,
    "text_bytes": 6011,
    "word_count": 976,
    "downloaded_at": "2025-08-26T10:56:18.819817"
  }
}