{
  "slug": "screenshare-safety",
  "title": "Share browser windows or your screen with sites you trust",
  "summary": "Learn how to use Firefox's screen sharing feature safely.",
  "url": "https://support.mozilla.org/en-US/kb/screenshare-safety",
  "html": "<p>Screen sharing is a powerful new feature that lets you share what’s on your computer screen with a website, so you can co-browse with a friend, or allow a technician to diagnose a problem on your computer remotely.\n</p>\n<dl><dt><img alt=\"screenshare\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2016-11-28-16-48-07-ec0c24.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div class=\"warning\">Screen sharing can be risky if you share a browser window or your whole screen with <strong>websites you don't trust</strong>.</div>\n<h1 id=\"w_what-are-the-risks-of-sharing-with-sites-i-dont-trust\">What are the risks of sharing with sites I don't trust?</h1>\n<p>Firefox will warn you not to share when a browser window is visible on your screen unless you trust that website. These are the reasons:\n</p>\n<ul><li>When sharing a window, a website may passively record what you’re doing, including things you didn’t intend to share.\n</li><li>Websites can actively control browser windows, popping up private information from other websites you never intended to share. It can do this quickly and discreetly. If you share your screen with a malicious website, that website now has the ability to browse as you, using any login information you may have already entered or stored, and to steal your private data.\n</li></ul>\n<h1 id=\"w_what-causes-these-risks\">What causes these risks?</h1>\n<p>Websites and ads have always been able to display content from other sites, but websites normally can’t read the pixels that make up the content on other sites. For more technical information, see <a href=\"https://en.wikipedia.org/wiki/Same-origin_policy\">same-origin policy</a>. It’s an important web security mechanism that exists in all browsers.\n</p><p>Once you share a browser window with a site, you’re allowing that site to see the results of other sites it summons, including your private information. You no longer have that important web security mechanism in place.\n</p><p><strong>Example:</strong> A user who doesn't log out of the banking site before closing the tab, and shares the screen with a malicious site afterwards. That site can now display and capture personal account information immediately or when the user is not looking or steps away from the computer (based on inactivity or looking at the web camera, if shared).\n</p>\n<div class=\"note\">For more information, see <a href=\"https://blog.mozilla.org/webrtc/share-browser-windows-entire-screen-sites-trust/\">this Mozilla blog post</a>.</div>",
  "text": "Screen sharing is a powerful new feature that lets you share what’s on your computer screen with a website, so you can co-browse with a friend, or allow a technician to diagnose a problem on your computer remotely. Screen sharing can be risky if you share a browser window or your whole screen with websites you don't trust . What are the risks of sharing with sites I don't trust? Firefox will warn you not to share when a browser window is visible on your screen unless you trust that website. These are the reasons: When sharing a window, a website may passively record what you’re doing, including things you didn’t intend to share. Websites can actively control browser windows, popping up private information from other websites you never intended to share. It can do this quickly and discreetly. If you share your screen with a malicious website, that website now has the ability to browse as you, using any login information you may have already entered or stored, and to steal your private data. What causes these risks? Websites and ads have always been able to display content from other sites, but websites normally can’t read the pixels that make up the content on other sites. For more technical information, see same-origin policy . It’s an important web security mechanism that exists in all browsers. Once you share a browser window with a site, you’re allowing that site to see the results of other sites it summons, including your private information. You no longer have that important web security mechanism in place. Example: A user who doesn't log out of the banking site before closing the tab, and shares the screen with a malicious site afterwards. That site can now display and capture personal account information immediately or when the user is not looking or steps away from the computer (based on inactivity or looking at the web camera, if shared). For more information, see this Mozilla blog post .",
  "products": [
    "firefox"
  ],
  "topics": [
    "audio-and-video",
    "browse",
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2664,
    "text_bytes": 1930,
    "word_count": 331,
    "downloaded_at": "2025-08-26T10:37:35.792930"
  }
}