{
  "slug": "secure-website-certificate",
  "title": "Secure website certificate",
  "summary": "Websites can present Firefox with a certificate to identify themselves. Find out how Firefox checks the authenticity of the sites you visit.",
  "url": "https://support.mozilla.org/en-US/kb/secure-website-certificate",
  "html": "<p><a href=\"https://developer.mozilla.org/docs/Web/Security/Transport_Layer_Security\">Transport Layer Security</a> (TLS) secure website certificates verify the ownership and the integrity of the information of websites you visit. This article explains how it works.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-websites-use-certificates\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What websites use certificates?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_chain-of-trust\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Chain of trust</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_how-does-firefox-verify-certificate-integrity\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">How does Firefox verify certificate integrity?</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_viewing-a-certificate\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Viewing a certificate</span></a></li><li class=\"toclevel-1\"><a href=\"#w_certificate-content\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Certificate content</span></a></li><li class=\"toclevel-1\"><a href=\"#w_problematic-certificates\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Problematic certificates</span></a></li></ul></div>\n<h1 id=\"w_what-websites-use-certificates\">What websites use certificates?</h1>\n<p>Websites whose addresses start with <strong>https</strong> use TLS server certificates. Websites using TLS server certificates provide assurance of two things:\n</p>\n<ul><li> The website administrator owns or has control over the domain name, ensuring users connect to the legitimate site and not a spoofed or malicious copy the website.\n</li><li> Encrypted data exchange over TLS between the browser and the website is protected against eavesdropping or from being tampered with by unauthorized parties.\n</li></ul>\n<h1 id=\"w_chain-of-trust\">Chain of trust</h1>\n<p>Browsers such as Firefox verify certificates through a hierarchy called a <strong>chain of trust</strong>, which typically consists of at least three certificates:\n</p>\n<ul><li> The root <strong>(trust anchor)</strong> certificate\n</li><li> One or more intermediate certificates\n</li><li> The TLS server <strong>(end entity)</strong> certificate\n</li></ul>\n<dl><dt><img alt=\"Chain of trust diagram\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-02-10-11-02-32-3cb87c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">  \n</dt></dl>\n<p>The root certificate belongs to a <a href=\"https://wikipedia.org/wiki/Certificate_authority\">Certificate Authority</a> (CA) that is trusted by the browser to issue other certificates. Typically, a root certificate issues one or more intermediate certificates that are then used to issue TLS server certificates to organizations that can demonstrate control over website domains specified by those certificates.\n</p><p>Certificates rely on public key cryptography, in which an asymmetric key pair has two mathematically related keys:\n</p>\n<ul><li> <strong>Private Key:</strong> This key is kept secret by its owner and is used for cryptographic operations such as signing data (including certificates) or decrypting information encrypted with the public key\n</li><li> <strong>Public Key:</strong> This key is shared publicly and is used to verify signatures created by the private key or to encrypt information that only the private key can decrypt\n</li></ul>\n<p>Public key certificates contain the following information:\n</p>\n<ul><li> Details about the Certificate Authority (CA) that issued the certificate\n</li><li> A public key belonging to the organization that received the certificate\n</li><li> Identifying details about the organization that holds the private key (see <a href=\"#w_certificate-content\">Certificate content</a> below. For TLS server certificates, this is primarily the domain name of the website)\n</li></ul>\n<p>Now, we can describe how Firefox determines whether a website is secure. \n</p>\n<h2 id=\"w_how-does-firefox-verify-certificate-integrity\">How does Firefox verify certificate integrity?</h2>\n<p>This is how Firefox uses the chain of trust to verify TLS server certificates:\n</p>\n<ol><li> Firefox downloads the certificate of the website you visited.\n</li><li> Firefox checks the certificate against its internal database of trusted Certificate Authorities (CAs).\n<ul><li> It uses the public key of the root CA certificate to ensure that the root certificate and intermediate certificates have been properly signed down the chain to the TLS server certificate that the website has provided.\n</li></ul>\n</li><li> Firefox checks the information in the certificate to ensure that the website you're connected to matches the website listed in the certificate.\n</li><li> Firefox generates a symmetric key for encrypting HTTP traffic for the connection.\n</li><li> Firefox encrypts the symmetric key with the public key of the server, which is found in the server certificate.\n</li><li> The private key, which is on the web server, decrypts the necessary connection data to complete what is known as the <em>TLS handshake</em>.\n</li></ol>\n<p>Secure communication can then occur between Firefox and the website. \n</p>\n<h1 id=\"w_viewing-a-certificate\">Viewing a certificate</h1>\n<p>To view a certificate, follow these steps:\n</p>\n<ol><li> Click the padlock icon <img alt=\"Fx89Padlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-33-33-7bdc86.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the address bar.\n</li><li> In the <a href=\"/en-US/kb/site-information-panel\">Site Information panel</a> that opens, click <span class=\"button\">Connection secure</span>.\n<dl><dt> <img alt=\"Fx134SiteInfo-ConnectionSecure\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-22-07-00-26-fbfa09.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> In the next panel, click <span class=\"button\">More Information</span>.\n<dl><dt> <img alt=\"Fx134SiteInfo-MoreInfo\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-22-07-01-39-01bbf4.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> In the <a href=\"/en-US/kb/firefox-page-info-window\">Page Info window</a> that opens, click <span class=\"button\">View Certificate</span>.\n<dl><dt> <img alt=\"Fx134SiteInfo-ViewCert\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-22-07-02-57-5b4ad2.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<p>Firefox will now open the <em>about:certificate</em> page to display information about the certificate for the website you're on:\n</p>\n<dl><dt><img alt=\"Fx134SiteInfo-AboutCert\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-22-06-58-47-7271a0.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>The three tabs show, from left to right, the TLS server certificate, the intermediate certificate and the root certificate.\n</p>\n<h1 id=\"w_certificate-content\">Certificate content</h1>\n<p>TLS server certificates contain the following information:\n</p>\n<ul><li> <strong>Subject:</strong> Contains optional attributes, such as the website name and other information about the organization owning the certificate.\n</li><li> <strong>Issuer:</strong> Identifies the CA entity that issued the certificate.\n</li><li> <strong>Validity:</strong> Shows how long the certificate is valid for.\n</li><li> <strong>Subject Alt Name Extension:</strong> Lists the website addresses that the certificate is valid for.\n</li><li> <strong>Public Key Info:</strong> Lists attributes of the public key of the certificate.\n</li><li> <strong>Serial Number:</strong> Uniquely identifies the certificate.\n</li><li> <strong>Signature Algorithm:</strong> Algorithm used to create the Signature.\n</li><li> <strong>Fingerprints:</strong> Hash of the certificate file in <a href=\"https://wiki.openssl.org/index.php/DER\">DER</a> binary format.\n</li><li> <strong>Key-Usage</strong> and <strong>Extended Key Usage</strong>: Specify how people can use the certificate, such as for performing TLS web server authentication.\n</li><li> <strong>Subject Key ID:</strong> An identifier generated from the TLS certificate's public key as a way to identify the certificate.\n</li><li> <strong>Authority Key ID:</strong> An identifier generated from the CA's public key as a way to identify the public key corresponding to the private key used to sign the certificate.\n</li><li> <strong>CRL Endpoints:</strong> The locations of the <a href=\"https://csrc.nist.gov/glossary/term/certificate_revocation_list\">Certificate Revocation List</a> (CRL) of the issuing CA.\n</li><li> <strong>Authority Info:</strong> Contains the validation method for the certificate authority and the intermediate certificate file.\n</li><li> <strong>Certificate Policies:</strong> Contains pointers to the type of TLS certificate it is (e.g. information verified when the certificate was issued).\n</li><li> <strong>Embedded SCTs:</strong> Lists the <a href=\"https://www.globalsign.com/en/blog/what-is-certificate-transparency\">Signed Certificate Timestamps</a> (SCTs).\n</li></ul>\n<h1 id=\"w_problematic-certificates\">Problematic certificates</h1>\n<p>When you visit a website whose address starts with <strong>https</strong> and a problem with the TLS certificate is detected, the browser will display an error page. The <a href=\"/en-US/kb/what-does-your-connection-is-not-secure-mean\">What do the security warning codes mean?</a> article describes common certificate errors.\n</p><p>To view the problematic certificate, follow these steps:\n</p>\n<ol><li> On the warning page, click <span class=\"button\">Advanced…</span>.\n<dl><dt> <img alt=\"Fx134SecurityWarning\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-22-07-42-51-0bd8b8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> Click <em>View Certificate</em>.\n<dl><dt> <img alt=\"Fx134SecurityWarning-ViewCert\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-22-07-44-14-2f508e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<p>The bad certificate will now display.\n</p><p>\n</p>",
  "text": "Transport Layer Security (TLS) secure website certificates verify the ownership and the integrity of the information of websites you visit. This article explains how it works. Table of Contents 1 What websites use certificates? 2 Chain of trust 2.1 How does Firefox verify certificate integrity? 3 Viewing a certificate 4 Certificate content 5 Problematic certificates What websites use certificates? Websites whose addresses start with https use TLS server certificates. Websites using TLS server certificates provide assurance of two things: The website administrator owns or has control over the domain name, ensuring users connect to the legitimate site and not a spoofed or malicious copy the website. Encrypted data exchange over TLS between the browser and the website is protected against eavesdropping or from being tampered with by unauthorized parties. Chain of trust Browsers such as Firefox verify certificates through a hierarchy called a chain of trust , which typically consists of at least three certificates: The root (trust anchor) certificate One or more intermediate certificates The TLS server (end entity) certificate The root certificate belongs to a Certificate Authority (CA) that is trusted by the browser to issue other certificates. Typically, a root certificate issues one or more intermediate certificates that are then used to issue TLS server certificates to organizations that can demonstrate control over website domains specified by those certificates. Certificates rely on public key cryptography, in which an asymmetric key pair has two mathematically related keys: Private Key: This key is kept secret by its owner and is used for cryptographic operations such as signing data (including certificates) or decrypting information encrypted with the public key Public Key: This key is shared publicly and is used to verify signatures created by the private key or to encrypt information that only the private key can decrypt Public key certificates contain the following information: Details about the Certificate Authority (CA) that issued the certificate A public key belonging to the organization that received the certificate Identifying details about the organization that holds the private key (see Certificate content below. For TLS server certificates, this is primarily the domain name of the website) Now, we can describe how Firefox determines whether a website is secure. How does Firefox verify certificate integrity? This is how Firefox uses the chain of trust to verify TLS server certificates: Firefox downloads the certificate of the website you visited. Firefox checks the certificate against its internal database of trusted Certificate Authorities (CAs). It uses the public key of the root CA certificate to ensure that the root certificate and intermediate certificates have been properly signed down the chain to the TLS server certificate that the website has provided. Firefox checks the information in the certificate to ensure that the website you're connected to matches the website listed in the certificate. Firefox generates a symmetric key for encrypting HTTP traffic for the connection. Firefox encrypts the symmetric key with the public key of the server, which is found in the server certificate. The private key, which is on the web server, decrypts the necessary connection data to complete what is known as the TLS handshake . Secure communication can then occur between Firefox and the website. Viewing a certificate To view a certificate, follow these steps: Click the padlock icon in the address bar. In the Site Information panel that opens, click Connection secure . In the next panel, click More Information . In the Page Info window that opens, click View Certificate . Firefox will now open the about:certificate page to display information about the certificate for the website you're on: The three tabs show, from left to right, the TLS server certificate, the intermediate certificate and the root certificate. Certificate content TLS server certificates contain the following information: Subject: Contains optional attributes, such as the website name and other information about the organization owning the certificate. Issuer: Identifies the CA entity that issued the certificate. Validity: Shows how long the certificate is valid for. Subject Alt Name Extension: Lists the website addresses that the certificate is valid for. Public Key Info: Lists attributes of the public key of the certificate. Serial Number: Uniquely identifies the certificate. Signature Algorithm: Algorithm used to create the Signature. Fingerprints: Hash of the certificate file in DER binary format. Key-Usage and Extended Key Usage : Specify how people can use the certificate, such as for performing TLS web server authentication. Subject Key ID: An identifier generated from the TLS certificate's public key as a way to identify the certificate. Authority Key ID: An identifier generated from the CA's public key as a way to identify the public key corresponding to the private key used to sign the certificate. CRL Endpoints: The locations of the Certificate Revocation List (CRL) of the issuing CA. Authority Info: Contains the validation method for the certificate authority and the intermediate certificate file. Certificate Policies: Contains pointers to the type of TLS certificate it is (e.g. information verified when the certificate was issued). Embedded SCTs: Lists the Signed Certificate Timestamps (SCTs). Problematic certificates When you visit a website whose address starts with https and a problem with the TLS certificate is detected, the browser will display an error page. The What do the security warning codes mean? article describes common certificate errors. To view the problematic certificate, follow these steps: On the warning page, click Advanced… . Click View Certificate . The bad certificate will now display.",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 11309,
    "text_bytes": 5908,
    "word_count": 902,
    "downloaded_at": "2025-08-26T10:35:51.509025"
  }
}