{
  "slug": "solve-math-calculations-directly-your-firefox-addr",
  "title": "Solve math calculations directly in your Firefox address bar",
  "summary": "Learn about engaging in math calculations and unit conversions directly in the Firefox address bar",
  "url": "https://support.mozilla.org/en-US/kb/solve-math-calculations-directly-your-firefox-addr",
  "html": "<p></p><div class=\"note\"> \n<p><span class=\"for\" data-for=\"fx\"><img alt=\"progressive rollout banner\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-28-12-46-04-f31ad5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\nThis feature is experimental and is being introduced to the Firefox user base through a progressive rollout. It may not yet be available to all users. \n</p>\n</div>\nIf you want to quickly work on a math calculation or convert Celsius to Fahrenheit, the Firefox address bar can help you complete these tasks without the need to open additional calculators or conversion apps. This article will help you enable the address bar calculator/unit conversions features and show you how to efficiently use them.\n<p></p>\n<div class=\"note\"><strong>Note:</strong> The built-in math calculator has been available since <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 137, and the unit conversions tool will be available in Firefox starting with version 141.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_math-calculator\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Math calculator</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_supported-calculations\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Supported calculations</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_unit-conversions\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Unit conversions</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_supported-conversions\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Supported conversions</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_reasons-to-use-these-features\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Reasons to use these features</span></a></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<h1 id=\"w_math-calculator\">Math calculator</h1>\n<p>The Firefox address bar allows you to work on math calculations directly from this area, without having to open a different app or even a different tab within the browser. The new feature will simply let you type in a math calculation, and it will instantly display the result, as you can see below.\n</p>\n<dl><dt><img alt=\"137_calculator\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-05-15-13-15-03-0ea2dd.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<h2 id=\"w_supported-calculations\">Supported calculations</h2>\n<p>The math calculations can vary from simple ones (these can usually be solved in just one step) to more complex ones (these require more steps to be solved).\n</p><p>You can also combine calculations, and the address bar will give you the right answer. If you want to do so, check out the complete list of all the calculations the Firefox address bar supports:\n</p>\n<ul><li>Addition (+)\n</li><li>Subtraction (-)\n</li><li>Division (/)\n</li><li>Multiplication (*)\n</li><li>Exponentiation (^)\n</li><li>Expressions with parentheses (for example: (a+b)^n+p)\n</li></ul>\n<div class=\"note\"><strong>Note:</strong> Depending on your default search engine, typing a math calculation in the Firefox address bar will display results from it, as well. For example, if you have Google as your search engine with <a href=\"/en-US/kb/search-suggestions-firefox\">Search Suggestions</a> enabled, typing <strong>5*5</strong> will show <strong>= 25</strong> twice in the address bar. The top result comes from the Firefox address bar calculator, and the second result comes from Google. They can be differentiated by their icons.</div>\n<h1 id=\"w_unit-conversions\">Unit conversions</h1>\n<p>The Firefox address bar also includes the unit conversions feature, and it works similarly to the math calculator. You just need to type in a conversion, and the address bar will instantly show you the result.\n</p>\n<dl><dt><img alt=\"kminmiles\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-05-15-13-22-14-57ba8e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div class=\"note\"><strong>Note:</strong> The general syntax for the unit conversions tool is:<br><code>&lt;number&gt;&lt;source_unit&gt; [in|to|=] &lt;destination_unit&gt;</code></div>\n<h2 id=\"w_supported-conversions\">Supported conversions</h2>\n<p>The feature supports the following unit conversions:\n</p>\n<ul><li><strong>Temperatures:</strong>\n<ul><li>Celsius\n</li><li>Kelvin\n</li><li>Fahrenheit\n</li></ul>\n</li><li><strong>Time Zones:</strong>\n<ul><li>IDLW: -12\n</li><li>NT: -11\n</li><li>HST: -10\n</li><li>AKST: -9\n</li><li>PST: -8\n</li><li>AKDT: -8\n</li><li>MST: -7\n</li><li>PDT: -7\n</li><li>CST: -6\n</li><li>MDT: -6\n</li><li>EST: -5\n</li><li>CDT: -5\n</li><li>EDT: -4\n</li><li>AST: -4\n</li><li>GUY: -3\n</li><li>ADT: -3\n</li><li>AT: -2\n</li><li>UTC: 0\n</li><li>GMT: 0\n</li><li>Z: 0\n</li><li>WET: 0\n</li><li>WEST: 1\n</li><li>CET: 1\n</li><li>BST: 1\n</li><li>IST: 1\n</li><li>CEST: 2\n</li><li>EET: 2\n</li><li>EEST: 3\n</li><li>MSK: 3\n</li><li>MSD: 4\n</li><li>ZP4: 4\n</li><li>ZP5: 5\n</li><li>ZP6: 6\n</li><li>WAST: 7\n</li><li>AWST: 8\n</li><li>WST: 8\n</li><li>JST: 9\n</li><li>ACST: 9.5\n</li><li>ACDT: 10.5\n</li><li>AEST: 10\n</li><li>AEDT: 11\n</li><li>NZST: 12\n</li><li>IDLE: 12\n</li><li>NZD: 13\n</li></ul>\n</li><li><strong>Angle:</strong>\n<ul><li>Degree\n</li><li>Radian\n</li><li>Minute\n</li><li>Second\n</li></ul>\n</li><li><strong>Force:</strong>\n<ul><li>Newton\n</li><li>Kilonewton\n</li><li>Exanewton\n</li><li>Petanewton\n</li><li>Teranewton\n</li><li>Giganewton\n</li><li>Meganewton\n</li><li>Hectonewton\n</li><li>Dekanewton\n</li><li>Decinewton\n</li><li>Centinewton\n</li><li>Milinewton\n</li><li>Micronewton\n</li><li>Nanonewton\n</li><li>Piconewton\n</li><li>Femtonewton\n</li><li>Attonewton\n</li><li>Dyn\n</li><li>Ton force short\n</li><li>Ton force long\n</li><li>Kip force\n</li><li>Pound force\n</li><li>Ounce force\n</li><li>Pond\n</li><li>Kilopond\n</li></ul>\n</li><li><strong>Length:</strong>\n<ul><li>Meter\n</li><li>Nanometer\n</li><li>Micrometer\n</li><li>Millimeter\n</li><li>Centimeter\n</li><li>Kilometer\n</li><li>Mile\n</li><li>Yard\n</li><li>Foot\n</li><li>Inch\n</li></ul>\n</li><li><strong>Mass:</strong>\n<ul><li>Kilogram\n</li><li>Gram\n</li><li>Milligram\n</li><li>Ton\n</li><li>Longton\n</li><li>Shortton\n</li><li>Pound\n</li><li>Lbs\n</li><li>Ounce\n</li><li>Carat\n</li></ul>\n</li></ul>\n<div class=\"note\"><strong>Note:</strong> You can specifically compare your timezone with various other global timezones by using functions like <strong>now to PDT</strong>, <strong>5 PM PDT to here</strong> and <strong>20:30 to PDT</strong>, in the Firefox address bar.</div>\n<h1 id=\"w_reasons-to-use-these-features\">Reasons to use these features</h1>\n<ul><li><strong>Save time:</strong> By using the Math calculator and Unit conversions features directly in the Firefox address bar, you can calculate various operations and convert useful metrics without having to go the extra mile.\n</li><li><strong>Streamline productivity:</strong> These features are designed to get the right information without having to open new tabs or visit additional online resources.\n</li><li><strong>Keep your system clean:</strong> You won’t need to install additional calculators or unit conversion apps, which means less stress on your device and more room for you to install other software.\n</li></ul>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/search-firefox-address-bar\">Search with the Firefox address bar</a>\n</li><li><a href=\"/en-US/kb/address-bar-autocomplete-firefox\">Address bar autocomplete suggestions in Firefox</a>\n</li><li><a href=\"/en-US/kb/remove-websites-address-bar-suggestions\">Remove websites from the address bar suggestions</a>\n</li></ul>",
  "text": "This feature is experimental and is being introduced to the Firefox user base through a progressive rollout. It may not yet be available to all users. If you want to quickly work on a math calculation or convert Celsius to Fahrenheit, the Firefox address bar can help you complete these tasks without the need to open additional calculators or conversion apps. This article will help you enable the address bar calculator/unit conversions features and show you how to efficiently use them. Note: The built-in math calculator has been available since Firefox version 137, and the unit conversions tool will be available in Firefox starting with version 141. Table of Contents 1 Math calculator 1.1 Supported calculations 2 Unit conversions 2.1 Supported conversions 3 Reasons to use these features 4 Related articles Math calculator The Firefox address bar allows you to work on math calculations directly from this area, without having to open a different app or even a different tab within the browser. The new feature will simply let you type in a math calculation, and it will instantly display the result, as you can see below. Supported calculations The math calculations can vary from simple ones (these can usually be solved in just one step) to more complex ones (these require more steps to be solved). You can also combine calculations, and the address bar will give you the right answer. If you want to do so, check out the complete list of all the calculations the Firefox address bar supports: Addition (+) Subtraction (-) Division (/) Multiplication (*) Exponentiation (^) Expressions with parentheses (for example: (a+b)^n+p) Note: Depending on your default search engine, typing a math calculation in the Firefox address bar will display results from it, as well. For example, if you have Google as your search engine with Search Suggestions enabled, typing 5*5 will show = 25 twice in the address bar. The top result comes from the Firefox address bar calculator, and the second result comes from Google. They can be differentiated by their icons. Unit conversions The Firefox address bar also includes the unit conversions feature, and it works similarly to the math calculator. You just need to type in a conversion, and the address bar will instantly show you the result. Note: The general syntax for the unit conversions tool is: <number><source_unit> [in|to|=] <destination_unit> Supported conversions The feature supports the following unit conversions: Temperatures: Celsius Kelvin Fahrenheit Time Zones: IDLW: -12 NT: -11 HST: -10 AKST: -9 PST: -8 AKDT: -8 MST: -7 PDT: -7 CST: -6 MDT: -6 EST: -5 CDT: -5 EDT: -4 AST: -4 GUY: -3 ADT: -3 AT: -2 UTC: 0 GMT: 0 Z: 0 WET: 0 WEST: 1 CET: 1 BST: 1 IST: 1 CEST: 2 EET: 2 EEST: 3 MSK: 3 MSD: 4 ZP4: 4 ZP5: 5 ZP6: 6 WAST: 7 AWST: 8 WST: 8 JST: 9 ACST: 9.5 ACDT: 10.5 AEST: 10 AEDT: 11 NZST: 12 IDLE: 12 NZD: 13 Angle: Degree Radian Minute Second Force: Newton Kilonewton Exanewton Petanewton Teranewton Giganewton Meganewton Hectonewton Dekanewton Decinewton Centinewton Milinewton Micronewton Nanonewton Piconewton Femtonewton Attonewton Dyn Ton force short Ton force long Kip force Pound force Ounce force Pond Kilopond Length: Meter Nanometer Micrometer Millimeter Centimeter Kilometer Mile Yard Foot Inch Mass: Kilogram Gram Milligram Ton Longton Shortton Pound Lbs Ounce Carat Note: You can specifically compare your timezone with various other global timezones by using functions like now to PDT , 5 PM PDT to here and 20:30 to PDT , in the Firefox address bar. Reasons to use these features Save time: By using the Math calculator and Unit conversions features directly in the Firefox address bar, you can calculate various operations and convert useful metrics without having to go the extra mile. Streamline productivity: These features are designed to get the right information without having to open new tabs or visit additional online resources. Keep your system clean: You won’t need to install additional calculators or unit conversion apps, which means less stress on your device and more room for you to install other software. Related articles Search with the Firefox address bar Address bar autocomplete suggestions in Firefox Remove websites from the address bar suggestions",
  "products": [
    "firefox"
  ],
  "topics": [
    "advanced-and-experimental-features"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 8212,
    "text_bytes": 4259,
    "word_count": 701,
    "downloaded_at": "2025-08-26T11:02:34.153744"
  }
}