{
  "slug": "suspicious-activity-my-firefox-account",
  "title": "Suspicious activity on my Mozilla account",
  "summary": "How to protect yourself if suspicious activity is detected on your Mozilla account.",
  "url": "https://support.mozilla.org/en-US/kb/suspicious-activity-my-firefox-account",
  "html": "<p>Your Mozila account syncs your passwords, bookmarks and history across multiple devices. If you notice suspicious activity on your Mozilla account (like someone signing in from an unknown device), there are steps you can take to prevent further access to your information.\n</p>\n<h1 id=\"w_first-change-your-sync-password-from-a-synced-computer\">First, change your Sync password from a synced computer</h1>\n<p>This first step will prevent devices with your old Mozilla account password from connecting to the Sync server and getting all of the new passwords that you will have to create in the next section.\n</p><ol><li>(In Firefox for desktop) Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the menu panel.\n\n</li><li>Click your Mozilla account name or email address (or click <span class=\"menu\">Sign in</span>).\n</li><li>Click <span class=\"menu\">Manage Account</span>\n<ul><li>Alternatively, go to <a href=\"https://accounts.firefox.com/signin\">Mozilla account Sign in</a>.\n</li></ul>\n</li><li>On the Mozilla account page, scroll down to the <strong>Security</strong> section and click the <span class=\"button\">Change</span> button next to  <strong>Password</strong>.\n</li><li>Follow the steps to enter your old and new passwords, then click <span class=\"button\">Save</span> to finish.\n</li></ol>\n<p></p>\n<div class=\"note\">When you open Firefox on another connected device, it will prompt you to enter your new Mozilla account password. Or, you can update your other connected devices with the new password as follows:\n<ol><li>Disconnect your other devices from your Mozilla account by following <a href=\"/en-US/kb/remove-synced-device-firefox-accounts\">these steps</a>.\n</li><li>Reconnect these same devices by following <a href=\"/en-US/kb/how-do-i-set-sync-my-computer#w_connect-additional-devices-to-sync\">these instructions</a>.</li></ol></div>\n\n<h1 id=\"w_second-change-all-of-your-website-passwords-from-a-synced-computer\">Second, change all of your website passwords from a synced computer</h1>\n<div class=\"warning\">Change your Mozilla account password (see previous section) before changing your other account passwords to prevent your new passwords from syncing with devices.</div>\n<p>This part is more time consuming but important. If you don't change the passwords for things like your bank account, it would still be possible for someone else to log in to your account using the existing already synced password. \n</p><p>See <a href=\"/en-US/kb/password-strength\">Choose a strong password</a> for an easy way to create better passwords.\n</p>",
  "text": "Your Mozila account syncs your passwords, bookmarks and history across multiple devices. If you notice suspicious activity on your Mozilla account (like someone signing in from an unknown device), there are steps you can take to prevent further access to your information. First, change your Sync password from a synced computer This first step will prevent devices with your old Mozilla account password from connecting to the Sync server and getting all of the new passwords that you will have to create in the next section. (In Firefox for desktop) Click the menu button to open the menu panel. Click your Mozilla account name or email address (or click Sign in ). Click Manage Account Alternatively, go to Mozilla account Sign in . On the Mozilla account page, scroll down to the Security section and click the Change button next to Password . Follow the steps to enter your old and new passwords, then click Save to finish. When you open Firefox on another connected device, it will prompt you to enter your new Mozilla account password. Or, you can update your other connected devices with the new password as follows: Disconnect your other devices from your Mozilla account by following these steps . Reconnect these same devices by following these instructions . Second, change all of your website passwords from a synced computer Change your Mozilla account password (see previous section) before changing your other account passwords to prevent your new passwords from syncing with devices. This part is more time consuming but important. If you don't change the passwords for things like your bank account, it would still be possible for someone else to log in to your account using the existing already synced password. See Choose a strong password for an easy way to create better passwords.",
  "products": [
    "firefox",
    "mobile",
    "mozilla-account"
  ],
  "topics": [
    "passwords-and-sign-in",
    "privacy-and-security",
    "security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2836,
    "text_bytes": 1804,
    "word_count": 300,
    "downloaded_at": "2025-08-26T10:37:23.929904"
  }
}