{
  "slug": "tab-overview-menu",
  "title": "Tab overview menu",
  "summary": "Learn how to use the tab overview menu in Firefox to quickly manage and navigate your open tabs",
  "url": "https://support.mozilla.org/en-US/kb/tab-overview-menu",
  "html": "<p>Firefox’s tab overview menu is designed to help you manage and navigate your open tabs. Whether you have just a few tabs or many, this feature lets you quickly find, organize and switch tabs, providing a smooth browsing experience. This article will guide you on how to use the tab overview menu to maintain a tidy and organized browser environment, regardless of the number of tabs you have opened.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_access-the-tab-overview-menu\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Access the tab overview menu</span></a></li><li class=\"toclevel-1\"><a href=\"#w_manage-tabs\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Manage tabs</span></a></li><li class=\"toclevel-1\"><a href=\"#w_navigate-tabs\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Navigate tabs</span></a></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<h1 id=\"w_access-the-tab-overview-menu\">Access the tab overview menu</h1>\n<p>Click the <img alt=\"tab icon 2\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-06-25-13-37-26-16c7e5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"16\"> icon at the top-right corner of the Firefox window, next to the tabs bar. (If <a href=\"/en-US/kb/use-sidebar-access-tools-and-vertical-tabs\">Vertical Tabs</a> are enabled, click the <em>List all tabs</em> <img alt=\"Fx138VerticalListAllTabs\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-05-21-20-53-09-7cec8d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> icon in the toolbar.) A drop-down menu will appear, with some menu options and a list of all your open tabs. Each listed tab shows the title and favicon of the webpage. The active tab will be shown in bold type.\n</p>\n<dl><dt><span class=\"for\" data-for=\"not fx129\"><img alt=\"Tab overview menu\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-06-25-14-33-33-a4ae11.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"=fx129,=fx130,=fx131,=fx132\"><img alt=\"Tab overview menu V129\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-08-05-07-47-59-4771d9.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"fx133\"><img alt=\"tab overview menu fx133\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-11-26-06-30-01-daa7e9.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span> \n</dt></dl>\n<h1 id=\"w_manage-tabs\">Manage tabs</h1>\n<ul><li><strong>Search tabs:</strong> The <span class=\"menu\">Search tabs</span> option at the top of the menu lets you use the address bar to find a specific tab, by typing in keywords related to its content.\n</li></ul>\n<div class=\"for\" data-for=\"fx133\">\n<ul><li><strong>Tabs from other devices:</strong> Use the <span class=\"menu\">Tabs from other devices</span> option in the tab overview menu to access tabs that are open on your other devices <a href=\"/en-US/kb/sync\">synced</a> with your Mozilla account. This feature helps you continue browsing seamlessly across devices. Simply click on the desired tab to open it on your current device.\n</li></ul>\n</div>\n<ul><li><strong>Close <span class=\"for\" data-for=\"fx129\">all</span> duplicate tabs:</strong> To quickly close <span class=\"for\" data-for=\"fx129\">all your</span><span class=\"for\" data-for=\"not fx129\">any</span> duplicate tabs, select the <span class=\"for\" data-for=\"fx129\"><span class=\"menu\">Close all duplicate tabs</span> option. A pop-up asking you to confirm this will open. Click <span class=\"button\">Close tabs</span> to proceed</span><span class=\"for\" data-for=\"not fx129\"><span class=\"menu\">Close duplicate tabs</span> option</span>. This will automatically identify those tabs with the same URL and will only keep open the last active tab.\n</li><li><strong>Open a new container tab:</strong> The <span class=\"menu\">New container tab</span> option, if available, will open a tab in a different container. This allows you to keep your browsing activities separated by context, such as work and personal. For more information about Firefox containers, see <a href=\"/en-US/kb/how-use-firefox-containers\">How to use Firefox containers</a>.\n</li></ul>\n<h1 id=\"w_navigate-tabs\">Navigate tabs</h1>\n<ul><li><strong>Switch tabs:</strong> Scroll through the tabs list and click the tab you want to switch to. This will immediately bring the selected tab into focus.\n</li><li><strong>Close a tab:</strong> To close a tab directly from the menu, click the <strong>✕</strong> icon after the tab's title.\n</li></ul>\n<p>For more information on managing tabs, check out the <a href=\"/en-US/kb/tab-context-menu\">Tab context menu</a> article.\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/tabs-organize-websites-single-window\">Use tabs to organize lots of websites in a single window</a>\n</li><li><a href=\"/en-US/kb/search-open-tabs-firefox\">Search open tabs in Firefox</a>\n</li><li><a href=\"/en-US/kb/tab-preferences-and-settings\">Tab preferences and settings</a>\n</li><li><a href=\"/en-US/kb/about-new-tab-page\">New Tab page in Firefox</a>\n</li><li><a href=\"/en-US/kb/pinned-tabs-keep-favorite-websites-open\">Pinned Tabs - keep favorite websites open and just a click away</a>\n</li></ul>\n<div class=\"for\" data-for=\"fx137\">\n<ul><li><a href=\"/en-US/kb/tab-groups\">Tab groups</a>\n</li></ul>\n</div>",
  "text": "Firefox’s tab overview menu is designed to help you manage and navigate your open tabs. Whether you have just a few tabs or many, this feature lets you quickly find, organize and switch tabs, providing a smooth browsing experience. This article will guide you on how to use the tab overview menu to maintain a tidy and organized browser environment, regardless of the number of tabs you have opened. Table of Contents 1 Access the tab overview menu 2 Manage tabs 3 Navigate tabs 4 Related articles Access the tab overview menu Click the icon at the top-right corner of the Firefox window, next to the tabs bar. (If Vertical Tabs are enabled, click the List all tabs icon in the toolbar.) A drop-down menu will appear, with some menu options and a list of all your open tabs. Each listed tab shows the title and favicon of the webpage. The active tab will be shown in bold type. Manage tabs Search tabs: The Search tabs option at the top of the menu lets you use the address bar to find a specific tab, by typing in keywords related to its content. Tabs from other devices: Use the Tabs from other devices option in the tab overview menu to access tabs that are open on your other devices synced with your Mozilla account. This feature helps you continue browsing seamlessly across devices. Simply click on the desired tab to open it on your current device. Close all duplicate tabs: To quickly close all your any duplicate tabs, select the Close all duplicate tabs option. A pop-up asking you to confirm this will open. Click Close tabs to proceed Close duplicate tabs option . This will automatically identify those tabs with the same URL and will only keep open the last active tab. Open a new container tab: The New container tab option, if available, will open a tab in a different container. This allows you to keep your browsing activities separated by context, such as work and personal. For more information about Firefox containers, see How to use Firefox containers . Navigate tabs Switch tabs: Scroll through the tabs list and click the tab you want to switch to. This will immediately bring the selected tab into focus. Close a tab: To close a tab directly from the menu, click the ✕ icon after the tab's title. For more information on managing tabs, check out the Tab context menu article. Related articles Use tabs to organize lots of websites in a single window Search open tabs in Firefox Tab preferences and settings New Tab page in Firefox Pinned Tabs - keep favorite websites open and just a click away Tab groups",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse",
    "tabs"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6171,
    "text_bytes": 2532,
    "word_count": 451,
    "downloaded_at": "2025-08-26T10:56:50.272799"
  }
}