{
  "slug": "telemetry-collection-windows-default-browser-trend",
  "title": "Telemetry collection - Windows default browser trends",
  "summary": "This article explains one example of how Firefox collects and uses telemetry data with the Default Browser Agent Windows scheduled task.",
  "url": "https://support.mozilla.org/en-US/kb/telemetry-collection-windows-default-browser-trend",
  "html": "<p></p><div class=\"for\" data-for=\"not win\"><div class=\"warning\">This article only applies to Firefox on Windows.</div></div>\n<p></p><p>This article describes a scheduled task on Windows that applies to Firefox users. This task, called the <strong>Firefox Default Browser Agent</strong>, is a small check that runs in the background and is an example of how Firefox <a href=\"/en-US/kb/technical-and-interaction-data\">collects and uses technical and interaction (telemetry) data</a>. As with all other telemetry-related changes here at Mozilla, it has gone through our data review, a process designed with user choice and privacy at its core.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-does-this-task-do\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What does this task do?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_why-is-this-data-collected\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Why is this data collected?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_can-i-opt-out-of-this-data-collection\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Can I opt out of this data collection?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_learn-more\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Learn more</span></a></li></ul></div>\n<h1 id=\"w_what-does-this-task-do\">What does this task do?</h1>\n<p>The Firefox Default Browser Agent is a Windows-only scheduled task that runs in the background once a day for each installation of Firefox you have installed. This task collects information related to the system’s current and previous default browser setting (this is the browser Windows will use to open a website link) and the operating system locale and version. This data cannot be associated with regular profile-based telemetry data.\n</p>\n<h1 id=\"w_why-is-this-data-collected\">Why is this data collected?</h1>\n<p>Collecting telemetry is one way we’re able to ensure we can understand default browser trends in a way that helps us improve Firefox. It’s our hope that by better understanding more about our users and their choices around browser preferences, we can continue to build a better Firefox.\n</p>\n<h1 id=\"w_can-i-opt-out-of-this-data-collection\">Can I opt out of this data collection?</h1>\n<p>Yes, all Firefox data collection is optional and you can <a href=\"/en-US/kb/technical-and-interaction-data#w_how-to-turn-off-technical-and-interaction-data-collection\">opt out</a> at any time in your Firefox preferences. If you use an Enterprise version of Firefox, we also respect custom enterprise telemetry-related <a href=\"/en-US/kb/enforcing-policies-firefox-enterprise\">policy settings</a> if they exist, including disabling this task.\n</p>\n<h1 id=\"w_learn-more\">Learn more</h1>\n<ul><li><a href=\"/en-US/kb/make-firefox-your-default-browser\">Make Firefox your default browser</a>\n</li><li><a href=\"/en-US/kb/how-change-your-default-browser-firefox-windows\">Make Firefox your default browser on Windows</a>\n</li><li>Firefox Source Docs documentation:\n<ul><li><a href=\"https://firefox-source-docs.mozilla.org/toolkit/mozapps/defaultagent/default-browser-agent/index.html\">Default Browser Agent</a> \n</li><li><a href=\"https://firefox-source-docs.mozilla.org/toolkit/components/telemetry/data/default-browser-ping.html\">“default browser” ping</a>\n</li></ul>\n</li></ul>",
  "text": "This article only applies to Firefox on Windows. This article describes a scheduled task on Windows that applies to Firefox users. This task, called the Firefox Default Browser Agent , is a small check that runs in the background and is an example of how Firefox collects and uses technical and interaction (telemetry) data . As with all other telemetry-related changes here at Mozilla, it has gone through our data review, a process designed with user choice and privacy at its core. Table of Contents 1 What does this task do? 2 Why is this data collected? 3 Can I opt out of this data collection? 4 Learn more What does this task do? The Firefox Default Browser Agent is a Windows-only scheduled task that runs in the background once a day for each installation of Firefox you have installed. This task collects information related to the system’s current and previous default browser setting (this is the browser Windows will use to open a website link) and the operating system locale and version. This data cannot be associated with regular profile-based telemetry data. Why is this data collected? Collecting telemetry is one way we’re able to ensure we can understand default browser trends in a way that helps us improve Firefox. It’s our hope that by better understanding more about our users and their choices around browser preferences, we can continue to build a better Firefox. Can I opt out of this data collection? Yes, all Firefox data collection is optional and you can opt out at any time in your Firefox preferences. If you use an Enterprise version of Firefox, we also respect custom enterprise telemetry-related policy settings if they exist, including disabling this task. Learn more Make Firefox your default browser Make Firefox your default browser on Windows Firefox Source Docs documentation: Default Browser Agent “default browser” ping",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3369,
    "text_bytes": 1865,
    "word_count": 310,
    "downloaded_at": "2025-08-26T10:53:35.133318"
  }
}