{
  "slug": "text-encoding-no-longer-available-firefox-menu",
  "title": "Text Encoding no longer available in the Firefox menu panel",
  "summary": "The Firefox menu panel no longer has a Text Encoding submenu. It is still available in the Menu bar View menu and as an optional toolbar button.",
  "url": "https://support.mozilla.org/en-US/kb/text-encoding-no-longer-available-firefox-menu",
  "html": "<p>The <em>Text Encoding</em> menu item was removed from the Firefox menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> panel in <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 89. Instead, you can use the Menu bar<span class=\"for\" data-for=\"not mac\">, <a href=\"/en-US/kb/restore-menu-bar-firefox\">when the Menu bar is enabled</a>,</span> by clicking <span class=\"menu\">View</span> and selecting <span class=\"menu\">Repair Text Encoding</span> from the drop-down menu. <span class=\"for\" data-for=\"win,linux\">You can press and release the <span class=\"key\">Alt</span> key to temporarily show the Menu bar.</span>\n</p>\n<dl><dt><img alt=\"Fx91View-RepairTextEncoding\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-08-15-12-21-06-d018c5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div class=\"note\"><strong>Note:</strong> On most modern pages, the <span class=\"menu\">Repair Text Encoding</span> menu item will be greyed-out because character encoding changes are not supported. </div>\n<p><a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 91 introduced a new \"Repair Text Encoding\" feature. There is no longer a sub-menu with a list of encoding choices. When the <span class=\"menu\">Repair Text Encoding</span> menu item is activated and you click on it, Firefox will automatically change the text encoding based on page content, when this is possible. See <a href=\"https://hsivonen.fi/no-encoding-menu/\">this article</a> for more information.\n</p><p>You can view what text encoding in used on the page in the <span class=\"menu\">General</span> tab of <a href=\"/en-US/kb/firefox-page-info-window\">Page Info window</a>. (To open the Page Info window, <span class=\"for\" data-for=\"mac\">go to the Menu bar</span><span class=\"for\" data-for=\"not mac\"><a href=\"/en-US/kb/restore-menu-bar-firefox\">enable the Menu bar</a></span>, click <span class=\"menu\">Tools</span> and select <span class=\"menu\">Page Info</span> from the drop-down menu).\n</p>\n<div class=\"note\">\n<p><strong>Tip:</strong> You can also <a href=\"/en-US/kb/customize-firefox-controls-buttons-and-toolbars\">customize your Firefox toolbar</a> to add a <span class=\"button\">Repair Text Encoding</span> button:\n</p>\n<ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, then click <span class=\"menu\">More tools</span> and select <span class=\"menu\">Customize Toolbar…</span>\n\n<ul><li>A special tab will open, where you can drag and drop items in or out of the overflow menu and the toolbar. \n</li></ul>\n</li><li>Drag the <span class=\"button\">Repair Text Encoding</span> button to the toolbar.\n</li><li>Click <span class=\"button\">Done</span>.\n</li></ol>\n</div>",
  "text": "The Text Encoding menu item was removed from the Firefox menu panel in Firefox version 89. Instead, you can use the Menu bar , when the Menu bar is enabled , by clicking View and selecting Repair Text Encoding from the drop-down menu. You can press and release the Alt key to temporarily show the Menu bar. Note: On most modern pages, the Repair Text Encoding menu item will be greyed-out because character encoding changes are not supported. Firefox version 91 introduced a new \"Repair Text Encoding\" feature. There is no longer a sub-menu with a list of encoding choices. When the Repair Text Encoding menu item is activated and you click on it, Firefox will automatically change the text encoding based on page content, when this is possible. See this article for more information. You can view what text encoding in used on the page in the General tab of Page Info window . (To open the Page Info window, go to the Menu bar enable the Menu bar , click Tools and select Page Info from the drop-down menu). Tip: You can also customize your Firefox toolbar to add a Repair Text Encoding button: Click the menu button , then click More tools and select Customize Toolbar… A special tab will open, where you can drag and drop items in or out of the overflow menu and the toolbar. Drag the Repair Text Encoding button to the toolbar. Click Done .",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse",
    "customization",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3374,
    "text_bytes": 1344,
    "word_count": 243,
    "downloaded_at": "2025-08-26T10:54:11.131700"
  }
}