{
  "slug": "text-recognition",
  "title": "Copy text from images on Firefox for MacOS",
  "summary": "Learn how to copy text from images in Firefox for MacOS.",
  "url": "https://support.mozilla.org/en-US/kb/text-recognition",
  "html": "<p>Text Recognition allows you to extract text from a selected image on your current webpage. Whether it is a memorable caption in a meme or contact information in a screenshot event flyer, you can copy that text to share, store, or look up without needing to manually retype everything.\n</p><p>This feature is also compatible with VoiceOver, the built-in macOS screen reader. \n</p>\n<div class=\"note\">Note: \n<ul><li>Text recognition is available in <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 106 and above.\n</li><li>At this time, this feature is only supported on macOS 10.15 (Catalina) or higher. \n</li><li>If you are using macOS 10.15 (Catalina), Text Recognition only supports English. However, if you are using macOS 11.0 (Big Sur) or higher, Text Recognition is available in the following languages at different recognition levels:\n</li></ul>\n<p><strong>More Accurate Recognition:</strong> English, Chinese, Portuguese, French, Italian, German, and Spanish \n</p><p><strong>Faster Recognition: </strong>English, Portuguese, French, Italian, German, and Spanish\n</p>\n</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_using-text-recognition\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Using Text Recognition</span></a></li><li class=\"toclevel-1\"><a href=\"#w_pop-up\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Pop-up</span></a></li><li class=\"toclevel-1\"><a href=\"#w_data-collection\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Data collection</span></a></li><li class=\"toclevel-1\"><a href=\"#w_screen-reader\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Screen Reader</span></a></li><li class=\"toclevel-1\"><a href=\"#w_troubleshooting\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Troubleshooting</span></a></li></ul></div>\n<h1 id=\"w_using-text-recognition\">Using Text Recognition</h1>\n<p>To copy text from an image, simply right-click on it and select <span class=\"menu\">Copy Text from Image</span> from the menu that appears. \n</p><p>Don't see the menu after right-clicking? Try holding <span class=\"button\">Shift</span> while right-clicking, or double-right-clicking on the image to bring it up.\n</p>\n<div class=\"note\">Note: With this feature, you can copy text from any .jpg, .png, and .webp image. Please note that the <span class=\"menu\">Copy Text from Image</span> command will not work on images that were intentionally designed to disable text copying.</div>\n<p><img alt=\"CopyTextImageMacOS\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-08-24-10-04-41-3603b0.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\">\n</p>\n<h1 id=\"w_pop-up\">Pop-up</h1>\n<p>Once you prompt Text Recognition from the menu, you will see a modal popup with a loading animation as Firefox analyzes the image.<br>\n<img alt=\"MacOStextfromimage\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-08-24-10-07-10-7775b4.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\">\n</p><p>It might take a few more seconds for the feature to load if there’s longer, more complex text in the image you selected.\n</p><p><img alt=\"TextfromImageScrollbar\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-08-24-10-06-05-245b03.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\">\n</p><p>The feature automatically copies all of the extracted text to your clipboard. However, if you’d like to copy only a portion of the text, you will be able to select, highlight, and copy your preferred excerpt with <span class=\"key\">command</span> + <span class=\"key\">C</span>.\n</p><p>To close the modal, you can either click on the <span class=\"button\">Close</span> button or press <span class=\"key\">esc</span>.\n</p>\n<h1 id=\"w_data-collection\">Data collection</h1>\n<p>We won’t collect any of your personal data apart from the following:\n</p>\n<ol><li>Whether or not you prompt the feature via the context menu.\n</li><li>Whether or not you use a screen reader for the feature.\n</li></ol>\n<h1 id=\"w_screen-reader\">Screen Reader</h1>\n<p>Text Recognition is compatible with VoiceOver. Once you prompt the feature, the modal will be read as usual by the screen reader. See <a href=\"/en-US/kb/accessibility-features-firefox\">Accessibility features in Firefox</a>  for more information.\n<img alt=\"ScreenreaderMacOS\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-08-24-10-05-27-0af490.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"800\">\n</p>\n<h1 id=\"w_troubleshooting\">Troubleshooting</h1>\n<p>As Text Recognition is a work in progress, you may encounter some text errors if the image has more complex text. If Text Recognition does not work, you will see an error message in the pop-up.\n</p><p>If you encounter any errors with the feature, please <a href=\"https://bugzilla.mozilla.org/\">file a bug on Bugzilla</a> and try the feature on another image. We hope to improve Text Recognition based on your feedback.\n</p>",
  "text": "Text Recognition allows you to extract text from a selected image on your current webpage. Whether it is a memorable caption in a meme or contact information in a screenshot event flyer, you can copy that text to share, store, or look up without needing to manually retype everything. This feature is also compatible with VoiceOver, the built-in macOS screen reader. Note: Text recognition is available in Firefox version 106 and above. At this time, this feature is only supported on macOS 10.15 (Catalina) or higher. If you are using macOS 10.15 (Catalina), Text Recognition only supports English. However, if you are using macOS 11.0 (Big Sur) or higher, Text Recognition is available in the following languages at different recognition levels: More Accurate Recognition: English, Chinese, Portuguese, French, Italian, German, and Spanish Faster Recognition: English, Portuguese, French, Italian, German, and Spanish Table of Contents 1 Using Text Recognition 2 Pop-up 3 Data collection 4 Screen Reader 5 Troubleshooting Using Text Recognition To copy text from an image, simply right-click on it and select Copy Text from Image from the menu that appears. Don't see the menu after right-clicking? Try holding Shift while right-clicking, or double-right-clicking on the image to bring it up. Note: With this feature, you can copy text from any .jpg, .png, and .webp image. Please note that the Copy Text from Image command will not work on images that were intentionally designed to disable text copying. Pop-up Once you prompt Text Recognition from the menu, you will see a modal popup with a loading animation as Firefox analyzes the image. It might take a few more seconds for the feature to load if there’s longer, more complex text in the image you selected. The feature automatically copies all of the extracted text to your clipboard. However, if you’d like to copy only a portion of the text, you will be able to select, highlight, and copy your preferred excerpt with command + C . To close the modal, you can either click on the Close button or press esc . Data collection We won’t collect any of your personal data apart from the following: Whether or not you prompt the feature via the context menu. Whether or not you use a screen reader for the feature. Screen Reader Text Recognition is compatible with VoiceOver. Once you prompt the feature, the modal will be read as usual by the screen reader. See Accessibility features in Firefox for more information. Troubleshooting As Text Recognition is a work in progress, you may encounter some text errors if the image has more complex text. If Text Recognition does not work, you will see an error message in the pop-up. If you encounter any errors with the feature, please file a bug on Bugzilla and try the feature on another image. We hope to improve Text Recognition based on your feedback.",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse",
    "images-and-documents"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5509,
    "text_bytes": 2858,
    "word_count": 479,
    "downloaded_at": "2025-08-26T10:55:14.030473"
  }
}