{
  "slug": "tips-assessing-safety-extension",
  "title": "Tips for assessing the safety of an extension",
  "summary": "Here are a few tips for assessing the safety of a third party extension.",
  "url": "https://support.mozilla.org/en-US/kb/tips-assessing-safety-extension",
  "html": "<p>When installing an extension, you might encounter a message requesting permission to access your browser's data or features. Granting this permission is necessary for the extension to install and function properly.\n</p><p>It's important to note that if you're downloading an extension from a source other than <a href=\"https://addons.mozilla.org\">addons.mozilla.org</a> (AMO), you should verify the authenticity of the source to ensure a secure installation.\n</p><p>Remember, it's essential to be cautious about the permissions you grant to extensions. Although most extensions are from trustworthy third-party developers, bad actors may put your security and privacy at risk by using extensions to expose sensitive browsing data. This article guides you in evaluating the safety of the extensions you're planning to install or an extension that is currently installed.\n</p>\n<dl><dt><span class=\"for\" data-for=\"fx129\"><img alt=\"Permissions request add-ons\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-10-23-12-24-40-943359.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"1000\"></span><span class=\"for\" data-for=\"not fx129\"><img alt=\"Fx128AddExtensionPermissions\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-10-23-17-02-59-694bdc.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"1000\"></span>\n</dt></dl>\n<div class=\"for\" data-for=\"fx129\"><div class=\"note\"><strong>Note:</strong> See <a href=\"/en-US/kb/extensions-private-browsing\">Extensions in Private Browsing</a> regarding the <em>Run in Private Windows</em> checkbox.</div></div>\n<p>When a developer submits an extension to <a href=\"https://addons.mozilla.org\">addons.mozilla.org</a>, it’s scanned for a set of common issues. It may also be subject to human review. But neither of these processes guarantee that an extension is absolutely 100% safe.\n</p><p>With permissions messages, you can see what data and features an extension wants to access, so you can make more informed choices about the software you’re considering.\n</p><p>If you’re unclear how to decide on an extension’s safety, here are a few questions to ask yourself:\n</p>\n<ul><li> <strong>Is the extension from a brand or developer I trust?</strong>\n</li></ul>\n<p>Most extensions, however, are written by individual developers who aren't well-known. So you might therefore want to ask:\n</p>\n<ul><li><strong>Is the developer’s website, their blog, or social media activity consistent with the features of the extension?</strong>\n</li></ul>\n<p>Also consider:\n</p>\n<ul><li> <strong>How many other users have installed this extension? Does it have a good star rating and positive reviews?</strong>\n</li></ul>\n<p>If the extension doesn't have many reviews or you're still not reassured, then consider:\n</p>\n<ul><li> <strong>Are the permissions requests consistent with the features of the extension?</strong>\n</li></ul>\n<p>For example, if the extension is requesting access to your location, is there a location feature included in the description of the extension? In some cases, though, it may not be obvious how certain permissions relate to a feature of the extension, so you should ask:\n</p>\n<ul><li> <strong>Does the extension’s website or description on <a href=\"https://addons.mozilla.org\">addons.mozilla.org</a> include an explanation of why the extension is requesting these permissions? Is the explanation consistent with the features of the extension?</strong>\n</li></ul>\n<p>If you'd like more information about every potential permission request you may encounter, see <a href=\"/en-US/kb/permission-request-messages-firefox-extensions\">Permission request messages for Firefox extensions</a>.\n</p><p>For an even deeper analysis:\n</p>\n<ul><li> <strong>Does the extension have a privacy policy? Am I comfortable with the collection and processing of my data under the terms of the policy?</strong>\n</li></ul>\n<p>After probing these questions, you'll hopefully be satisfied that the extension is requesting an appropriate set of permissions.\n</p><p>While the vast majority of extension developers aren't interested in stealing your personal information or doing anything nefarious, you should be aware there are occasional bad actors. Always heed caution when installing extensions or any third-party software.\n</p><p>To view extensions officially endorsed by Mozilla through the <a href=\"/en-US/kb/recommended-extensions-program\">Recommended Extensions program</a>, see <a href=\"https://addons.mozilla.org/firefox/search/?recommended=true&amp;type=extension\">this list of add-ons</a>.\n</p>",
  "text": "When installing an extension, you might encounter a message requesting permission to access your browser's data or features. Granting this permission is necessary for the extension to install and function properly. It's important to note that if you're downloading an extension from a source other than addons.mozilla.org (AMO), you should verify the authenticity of the source to ensure a secure installation. Remember, it's essential to be cautious about the permissions you grant to extensions. Although most extensions are from trustworthy third-party developers, bad actors may put your security and privacy at risk by using extensions to expose sensitive browsing data. This article guides you in evaluating the safety of the extensions you're planning to install or an extension that is currently installed. Note: See Extensions in Private Browsing regarding the Run in Private Windows checkbox. When a developer submits an extension to addons.mozilla.org , it’s scanned for a set of common issues. It may also be subject to human review. But neither of these processes guarantee that an extension is absolutely 100% safe. With permissions messages, you can see what data and features an extension wants to access, so you can make more informed choices about the software you’re considering. If you’re unclear how to decide on an extension’s safety, here are a few questions to ask yourself: Is the extension from a brand or developer I trust? Most extensions, however, are written by individual developers who aren't well-known. So you might therefore want to ask: Is the developer’s website, their blog, or social media activity consistent with the features of the extension? Also consider: How many other users have installed this extension? Does it have a good star rating and positive reviews? If the extension doesn't have many reviews or you're still not reassured, then consider: Are the permissions requests consistent with the features of the extension? For example, if the extension is requesting access to your location, is there a location feature included in the description of the extension? In some cases, though, it may not be obvious how certain permissions relate to a feature of the extension, so you should ask: Does the extension’s website or description on addons.mozilla.org include an explanation of why the extension is requesting these permissions? Is the explanation consistent with the features of the extension? If you'd like more information about every potential permission request you may encounter, see Permission request messages for Firefox extensions . For an even deeper analysis: Does the extension have a privacy policy? Am I comfortable with the collection and processing of my data under the terms of the policy? After probing these questions, you'll hopefully be satisfied that the extension is requesting an appropriate set of permissions. While the vast majority of extension developers aren't interested in stealing your personal information or doing anything nefarious, you should be aware there are occasional bad actors. Always heed caution when installing extensions or any third-party software. To view extensions officially endorsed by Mozilla through the Recommended Extensions program , see this list of add-ons .",
  "products": [
    "firefox",
    "privacy-and-security"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4833,
    "text_bytes": 3274,
    "word_count": 507,
    "downloaded_at": "2025-08-26T10:38:38.316299"
  }
}