{
  "slug": "troubleshoot-firefox-crashes-closing-or-quitting",
  "title": "Troubleshoot Firefox crashes (closing or quitting unexpectedly)",
  "summary": "Learn how to troubleshoot and fix Firefox crashes, and find out how to get more help if you're having problems solving the issue.",
  "url": "https://support.mozilla.org/en-US/kb/troubleshoot-firefox-crashes-closing-or-quitting",
  "html": "<p>We understand how frustrating it is when Firefox crashes (closes or quits unexpectedly). When Firefox crashes, the <a href=\"/en-US/kb/mozillacrashreporter\">Mozilla Crash Reporter</a> will allow you to submit a crash to us, so we can continue making improvements to Firefox. Here are also some things to try to get Firefox up and running optimally.\n</p>\n<div class=\"note\"><strong>Before getting started:</strong>\n<ul><li>If the page stops working because part of the page has crashed or stopped responding, try reloading the page to see if that fixes the problem.\n</li><li>If Firefox is open but won't respond to any of your actions, then this is a <em>hang</em>, not a crash.  See <a href=\"/en-US/kb/firefox-hangs-or-not-responding\">Firefox hangs or is not responding - How to fix</a> for solutions.\n</li><li>If Firefox crashes at startup:\n<ul><li><a href=\"#w_check-to-see-if-the-crash-happens-in-troubleshoot-mode\">Check to see if the crash happens in Troubleshoot Mode</a> (see below).\n</li><li>Try a clean reinstall (see <a href=\"/en-US/kb/firefox-keeps-crashing-startup\">Firefox keeps crashing at startup</a>).\n</li></ul>\n</li></ul>\n<p>Otherwise, follow the steps below in order.\n</p>\n</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_update-your-software\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Update your software</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_update-firefox\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Update Firefox</span></a></li><li class=\"toclevel-2\"><a href=\"#w_update-windows\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Update Windows</span></a></li><li class=\"toclevel-2\"><a href=\"#w_update-macos\"><span class=\"tocnumber\">1.3</span> <span class=\"toctext\">Update macOS</span></a></li><li class=\"toclevel-2\"><a href=\"#w_update-linux\"><span class=\"tocnumber\">1.4</span> <span class=\"toctext\">Update Linux</span></a></li><li class=\"toclevel-2\"><a href=\"#w_update-your-drivers\"><span class=\"tocnumber\">1.5</span> <span class=\"toctext\">Update your drivers</span></a></li><li class=\"toclevel-2\"><a href=\"#w_update-your-internet-security-software\"><span class=\"tocnumber\">1.6</span> <span class=\"toctext\">Update your Internet Security software</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_check-for-viruses-or-spyware\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Check for viruses or spyware</span></a></li><li class=\"toclevel-1\"><a href=\"#w_check-for-third-party-modules\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Check for third-party modules</span></a></li><li class=\"toclevel-1\"><a href=\"#w_check-to-see-if-the-crash-happens-in-troubleshoot-mode\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Check to see if the crash happens in Troubleshoot Mode</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_the-crash-still-happens-in-troubleshoot-mode\"><span class=\"tocnumber\">4.1</span> <span class=\"toctext\">The crash still happens in Troubleshoot Mode</span></a></li><li class=\"toclevel-2\"><a href=\"#w_the-crash-doesnt-happen-in-troubleshoot-mode\"><span class=\"tocnumber\">4.2</span> <span class=\"toctext\">The crash doesn't happen in Troubleshoot Mode</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_check-your-hardware\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Check your hardware</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_check-your-ram-for-errors\"><span class=\"tocnumber\">5.1</span> <span class=\"toctext\">Check your RAM for errors</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_get-help-fixing-this-crash\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Get help fixing this crash</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_ask-for-help-in-the-community-support-forum\"><span class=\"tocnumber\">6.1</span> <span class=\"toctext\">Ask for help in the Community Support forum</span></a></li></ul></li></ul></div>\n<h1 id=\"w_update-your-software\">Update your software</h1>\n<p><em>The crash you're experiencing may have already been fixed in a new version!</em> \n</p>\n<h2 id=\"w_update-firefox\">Update Firefox</h2>\n<p>Every Firefox release includes a number of fixes for crashes that people have reported.  Making sure you have the latest version may fix your crash.  See <a href=\"/en-US/kb/update-firefox-latest-release\">Update Firefox to the latest release</a> for details.\n</p><div class=\"for\" data-for=\"win\">\n<h2 id=\"w_update-windows\">Update Windows</h2>\n<p>Make sure you have all of the latest security and stability fixes.\n</p></div><div class=\"for\" data-for=\"mac\">\n<h2 id=\"w_update-macos\">Update macOS</h2>\n<p>Make sure your Mac has all of the latest security and stability fixes.\n</p></div><div class=\"for\" data-for=\"linux\">\n<h2 id=\"w_update-linux\">Update Linux</h2>\n<p>Make sure you have all of the latest security and stability fixes.\n</p></div>\n<h2 id=\"w_update-your-drivers\">Update your drivers</h2>\n<p>Check if your graphics drivers are up-to-date. For more information, see <a href=\"/en-US/kb/upgrade-graphics-drivers-use-hardware-acceleration\">Upgrade your graphics drivers to use hardware acceleration and WebGL</a>.\n</p><p>If your crash happens while printing, check that your printer driver is up-to-date by going to your printer manufacturer's support website. The <a href=\"/en-US/kb/fix-printing-problems-firefox\">Fix printing problems in Firefox</a> article may also help.\n</p>\n<h2 id=\"w_update-your-internet-security-software\">Update your Internet Security software</h2>\n<p>Make sure you have the latest version of your Internet security software (including firewalls, antivirus programs, anti-spyware programs, and more).\n</p><div class=\"for\" data-for=\"win\">\n<h1 id=\"w_check-for-viruses-or-spyware\">Check for viruses or spyware</h1>\n<p>A number of different viruses and spyware are known to crash Firefox. For more information, see <a href=\"/en-US/kb/troubleshoot-firefox-issues-caused-malware\">Troubleshoot Firefox issues caused by malware</a>.\n</p>\n<h1 id=\"w_check-for-third-party-modules\">Check for third-party modules</h1>\n<p>Third-party applications (such as antivirus software, archiving software, and other tools) may load modules into Firefox. Sometimes, these applications load harmful modules that cause Firefox crashes, reduced performance, or compatibility issues. You may not notice that a malicious or unexpected module has been loaded, and it may cause problems that appear to be Firefox issues. For more information, see <a href=\"/en-US/kb/identify-problems-third-party-modules-firefox-windows\">Identify problems caused by third-party modules in Firefox for Windows</a>.\n</p></div>\n<h1 id=\"w_check-to-see-if-the-crash-happens-in-troubleshoot-mode\">Check to see if the crash happens in Troubleshoot Mode</h1>\n<p>If updating software didn't work or if Firefox crashes on startup, use the steps below to test whether the crash happens in <a href=\"/en-US/kb/diagnose-firefox-issues-using-troubleshoot-mode\">Firefox Troubleshoot Mode</a> or not and then follow the instructions in the recommended articles.\n</p>\n<ol><li> <p>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"menu\">Help</span>, select <span class=\"menu\">Troubleshoot Mode…</span> and click <span class=\"button\">Restart</span> in the <em>Restart Firefox in Troubleshoot Mode?</em> dialog.\n</p>\n<div class=\"note\"><strong>Note:</strong> You can also start Firefox in Troubleshoot Mode by <span class=\"for\" data-for=\"win\">holding down the <span class=\"key\">Shift</span> key while starting Firefox.</span><span class=\"for\" data-for=\"mac\">holding down the <span class=\"key\">option</span> key while starting Firefox.</span><span class=\"for\" data-for=\"linux\">quitting Firefox and then going to your <strong>Terminal</strong> and running: <code>firefox -safe-mode</code><br>You may need to specify the Firefox installation path (e.g. <span class=\"filepath\">/usr/lib/firefox</span>).</span></div>\n</li><li> When the <em>Open Firefox in Troubleshoot Mode?</em> window appears, press the <span class=\"button\">Open</span> button. \n<dl><dt><img alt=\"Fx88TroubleshootMode\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-03-31-17-39-57-bfee23.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<p>After Firefox starts in Troubleshoot Mode, test for your problem.\n</p>\n<div class=\"note\"><strong>Note:</strong> The <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">Refresh Firefox feature</a> can fix many issues by restoring Firefox to its default state while saving your essential information. Consider using it before going through a lengthy troubleshooting process.\n</div>\n<h2 id=\"w_the-crash-still-happens-in-troubleshoot-mode\">The crash still happens in Troubleshoot Mode</h2>\n<p>If your crash still happens in Troubleshoot Mode, it is not being caused by an extension, theme, or hardware acceleration. Try to <a href=\"#w_get-help-fixing-this-crash\">get help with your crash ID</a> (see below).\n</p>\n<h2 id=\"w_the-crash-doesnt-happen-in-troubleshoot-mode\">The crash doesn't happen in Troubleshoot Mode</h2>\n<p>If your crash doesn't happen in Troubleshoot Mode, it is most likely because an extension, theme, or hardware acceleration is causing the crash.\n</p>\n<ul><li>Follow the steps in <a href=\"/en-US/kb/troubleshoot-extensions-themes-to-fix-problems\">Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems</a> to determine the cause.\n</li></ul>\n<h1 id=\"w_check-your-hardware\">Check your hardware</h1>\n<h2 id=\"w_check-your-ram-for-errors\">Check your RAM for errors</h2>\n<p>If Firefox crashes repeatedly, check your RAM for errors using for instance the following tool, <span class=\"for\" data-for=\"win,linux\"><a href=\"http://www.memtest.org/\">Memtest86+</a></span><span class=\"for\" data-for=\"mac\"><a href=\"http://www.kelleycomputing.net/rember/\">Rember</a></span>.\n</p>\n<h1 id=\"w_get-help-fixing-this-crash\">Get help fixing this crash</h1>\n<p>Figuring out the cause of a crash can be difficult. If you've tried the steps above and can't get Firefox to stop crashing, the instructions below will show you how to get the crash Report IDs for your most recent submitted crash reports, so our volunteers can help you.\n</p><p><strong>If you can open Firefox, at least in Troubleshoot Mode:</strong>\n</p>\n<ol><li>In the Firefox address bar, type <strong>about:crashes</strong> and hit <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>. A page listing submitted crash reports (and unsubmitted crash reports, if any) will appear.<br><img alt=\"Fx115aboutcrashes\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-12-17-16-36-25-9d225a.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n<ul><li>If you have recent, unsubmitted crash reports: Click the <span class=\"button\">Submit</span> button for each recent unsubmitted report and then reload the <em>about:crashes</em> page.\n</li></ul>\n</li><li>You should copy the Report IDs for <strong>submitted</strong> crash reports (they start with <strong>bp-</strong>) to your support question in the Community Support forum.\n</li></ol>\n<div class=\"note\"><strong>Note:</strong> If you can't open Firefox because it crashes at startup even in Troubleshoot Mode, use these alternative instructions to locate Report IDs:\n<ol><li><span class=\"for\" data-for=\"win\">Press <span class=\"key\"><img alt=\"Windows Key\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2011-09-20-08-33-13-ff63c4.jpg\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span> + <span class=\"key\">R</span> on the keyboard. Type in <span class=\"filepath\">\"%APPDATA%\\Mozilla\\Firefox\\Crash Reports\\submitted\"</span> (including the quotation marks) and click <span class=\"button\">OK</span>.</span><span class=\"for\" data-for=\"mac\">Click the <strong>Finder</strong> icon in the dock. On the menu bar, click the <span class=\"menu\">Go</span> menu, hold down the <span class=\"key\">option</span> or <span class=\"key\">alt</span> key and select <span class=\"menu\">Library</span>. A window will open containing your Library folder. Then open the “Application Support” folder, the “Firefox” folder, the “Crash Reports” folder and finally the “submitted” folder.</span><span class=\"for\" data-for=\"linux\">Go to <span class=\"filepath\">~/.mozilla/firefox/Crash Reports/submitted</span>.</span>\n</li><li>In the resulting folder, there will be a text file for each crash report you have submitted. Using the <span class=\"menu\">View</span> menu, arrange them by date to find out which is the newest file and double-click on it to open it.</li></ol></div>\n\n<h2 id=\"w_ask-for-help-in-the-community-support-forum\">Ask for help in the Community Support forum</h2>\n<ol><li> <strong><a href=\"/en-US/questions/new/firefox/form\">Click this link</a></strong> to ask for help with your crash on the Firefox Community Support forum (see <a href=\"/en-US/kb/get-community-support\">Get community support</a> for other support resources).\n<ul><li>You may need to create an account or log in to your existing account during the “ask a question” process.\n</li></ul>\n</li><li>On the <strong>Ask your question</strong> form, enter a subject and topic, then fill out the next section with as much information you have about the crash. Include any of the steps you completed above, like updating Firefox or testing for the crash in Troubleshoot Mode.\n</li><li>Copy the long Report ID number you've got above for the latest crashes (<strong>bp-…</strong>) and paste it into your question.\n</li><li>Finally, click the <span class=\"button\">Submit</span> button.<div class=\"note\">We know that providing all this information is time-consuming, but it will make it much easier for our volunteers to help you.</div>\n</li></ol>\n<p>\n<br> <br>\n<em><strong>Based on information from <a href=\"http://kb.mozillazine.org/Firefox_crashes\">Firefox crashes (mozillaZine KB)</a></strong></em>\n</p>",
  "text": "We understand how frustrating it is when Firefox crashes (closes or quits unexpectedly). When Firefox crashes, the Mozilla Crash Reporter will allow you to submit a crash to us, so we can continue making improvements to Firefox. Here are also some things to try to get Firefox up and running optimally. Before getting started: If the page stops working because part of the page has crashed or stopped responding, try reloading the page to see if that fixes the problem. If Firefox is open but won't respond to any of your actions, then this is a hang , not a crash. See Firefox hangs or is not responding - How to fix for solutions. If Firefox crashes at startup: Check to see if the crash happens in Troubleshoot Mode (see below). Try a clean reinstall (see Firefox keeps crashing at startup ). Otherwise, follow the steps below in order. Table of Contents 1 Update your software 1.1 Update Firefox 1.2 Update Windows 1.3 Update macOS 1.4 Update Linux 1.5 Update your drivers 1.6 Update your Internet Security software 2 Check for viruses or spyware 3 Check for third-party modules 4 Check to see if the crash happens in Troubleshoot Mode 4.1 The crash still happens in Troubleshoot Mode 4.2 The crash doesn't happen in Troubleshoot Mode 5 Check your hardware 5.1 Check your RAM for errors 6 Get help fixing this crash 6.1 Ask for help in the Community Support forum Update your software The crash you're experiencing may have already been fixed in a new version! Update Firefox Every Firefox release includes a number of fixes for crashes that people have reported. Making sure you have the latest version may fix your crash. See Update Firefox to the latest release for details. Update Windows Make sure you have all of the latest security and stability fixes. Update macOS Make sure your Mac has all of the latest security and stability fixes. Update Linux Make sure you have all of the latest security and stability fixes. Update your drivers Check if your graphics drivers are up-to-date. For more information, see Upgrade your graphics drivers to use hardware acceleration and WebGL . If your crash happens while printing, check that your printer driver is up-to-date by going to your printer manufacturer's support website. The Fix printing problems in Firefox article may also help. Update your Internet Security software Make sure you have the latest version of your Internet security software (including firewalls, antivirus programs, anti-spyware programs, and more). Check for viruses or spyware A number of different viruses and spyware are known to crash Firefox. For more information, see Troubleshoot Firefox issues caused by malware . Check for third-party modules Third-party applications (such as antivirus software, archiving software, and other tools) may load modules into Firefox. Sometimes, these applications load harmful modules that cause Firefox crashes, reduced performance, or compatibility issues. You may not notice that a malicious or unexpected module has been loaded, and it may cause problems that appear to be Firefox issues. For more information, see Identify problems caused by third-party modules in Firefox for Windows . Check to see if the crash happens in Troubleshoot Mode If updating software didn't work or if Firefox crashes on startup, use the steps below to test whether the crash happens in Firefox Troubleshoot Mode or not and then follow the instructions in the recommended articles. Click the menu button , click Help , select Troubleshoot Mode… and click Restart in the Restart Firefox in Troubleshoot Mode? dialog. Note: You can also start Firefox in Troubleshoot Mode by holding down the Shift key while starting Firefox. holding down the option key while starting Firefox. quitting Firefox and then going to your Terminal and running: firefox -safe-mode You may need to specify the Firefox installation path (e.g. /usr/lib/firefox ). When the Open Firefox in Troubleshoot Mode? window appears, press the Open button. After Firefox starts in Troubleshoot Mode, test for your problem. Note: The Refresh Firefox feature can fix many issues by restoring Firefox to its default state while saving your essential information. Consider using it before going through a lengthy troubleshooting process. The crash still happens in Troubleshoot Mode If your crash still happens in Troubleshoot Mode, it is not being caused by an extension, theme, or hardware acceleration. Try to get help with your crash ID (see below). The crash doesn't happen in Troubleshoot Mode If your crash doesn't happen in Troubleshoot Mode, it is most likely because an extension, theme, or hardware acceleration is causing the crash. Follow the steps in Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems to determine the cause. Check your hardware Check your RAM for errors If Firefox crashes repeatedly, check your RAM for errors using for instance the following tool, Memtest86+ Rember . Get help fixing this crash Figuring out the cause of a crash can be difficult. If you've tried the steps above and can't get Firefox to stop crashing, the instructions below will show you how to get the crash Report IDs for your most recent submitted crash reports, so our volunteers can help you. If you can open Firefox, at least in Troubleshoot Mode: In the Firefox address bar, type about:crashes and hit Enter Return . A page listing submitted crash reports (and unsubmitted crash reports, if any) will appear. If you have recent, unsubmitted crash reports: Click the Submit button for each recent unsubmitted report and then reload the about:crashes page. You should copy the Report IDs for submitted crash reports (they start with bp- ) to your support question in the Community Support forum. Note: If you can't open Firefox because it crashes at startup even in Troubleshoot Mode, use these alternative instructions to locate Report IDs: Press + R on the keyboard. Type in \"%APPDATA%\\Mozilla\\Firefox\\Crash Reports\\submitted\" (including the quotation marks) and click OK . Click the Finder icon in the dock. On the menu bar, click the Go menu, hold down the option or alt key and select Library . A window will open containing your Library folder. Then open the “Application Support” folder, the “Firefox” folder, the “Crash Reports” folder and finally the “submitted” folder. Go to ~/.mozilla/firefox/Crash Reports/submitted . In the resulting folder, there will be a text file for each crash report you have submitted. Using the View menu, arrange them by date to find out which is the newest file and double-click on it to open it. Ask for help in the Community Support forum Click this link to ask for help with your crash on the Firefox Community Support forum (see Get community support for other support resources). You may need to create an account or log in to your existing account during the “ask a question” process. On the Ask your question form, enter a subject and topic, then fill out the next section with as much information you have about the crash. Include any of the steps you completed above, like updating Firefox or testing for the crash in Troubleshoot Mode. Copy the long Report ID number you've got above for the latest crashes ( bp-… ) and paste it into your question. Finally, click the Submit button. We know that providing all this information is time-consuming, but it will make it much easier for our volunteers to help you. Based on information from Firefox crashes (mozillaZine KB)",
  "products": [
    "firefox"
  ],
  "topics": [
    "crashing-and-slow-performance",
    "performance-and-connectivity"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 14656,
    "text_bytes": 7487,
    "word_count": 1232,
    "downloaded_at": "2025-08-26T11:03:12.883436"
  }
}