{
  "slug": "troubleshoot-issues-related-to-add-ons",
  "title": "Troubleshoot issues related to add-ons",
  "summary": "Add-ons can cause issues in Firefox. This article provides more information on how you can troubleshoot Firefox issues related to add-ons.",
  "url": "https://support.mozilla.org/en-US/kb/troubleshoot-issues-related-to-add-ons",
  "html": "<p>Sometimes, add-ons can break your settings. This article explains how to troubleshoot issues related to add-ons in Firefox.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_how-do-i-know-if-my-problem-is-related-to-add-ons\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">How do I know if my problem is related to add-ons?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-can-i-fix-this-problem\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How can I fix this problem?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_if-youre-reporting-this-issue-for-the-first-time-in-the-forums\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">If you're reporting this issue for the first time in the forums</span></a></li><li class=\"toclevel-2\"><a href=\"#w_if-you-have-already-filed-a-question-on-the-forum\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">If you have already filed a question on the forum</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-avoid-this-problem\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How do I avoid this problem?</span></a></li></ul></div>\n<h1 id=\"w_how-do-i-know-if-my-problem-is-related-to-add-ons\">How do I know if my problem is related to add-ons?</h1>\n<p>Here are a few examples of add-ons affecting or breaking Firefox:\n</p>\n<ul><li>Your default search has changed unexpectedly.\n</li><li>Your home page or browser settings have changed.\n</li><li>Changes in behavior when searching or browsing (such as unexpected redirects to a different website or search provider).\n</li><li>Unexpected changes on web pages.\n</li></ul>\n<h1 id=\"w_how-can-i-fix-this-problem\">How can I fix this problem?</h1>\n<p>As a first step, you could restart Firefox with add-ons disabled (see <a href=\"/en-US/kb/diagnose-firefox-issues-using-troubleshoot-mode\">Diagnose Firefox issues using Troubleshoot Mode</a> to learn how). If the issue goes away, restart Firefox with add-ons enabled, then selectively disable add-ons until you figure out which add-on is causing the problem and either <a href=\"/en-US/kb/disable-or-remove-add-ons\">disable or remove the add-on</a>.\n</p><p>If you need more help, you can file a question in our support forum to find out more about the issue you're experiencing.\n</p>\n<ol><li>Go to the <a href=\"https://support.mozilla.org/questions/new\">Ask the Community</a> page in Mozilla Support.\n</li><li>Select the product you need help with.\n</li><li>Search for existing solutions in the knowledge base or forums.\n</li><li>If you don't find any, or they don't help you solve the problem, click the <span class=\"button\">Ask Now</span> button to file a new question.\n</li></ol>\n<h2 id=\"w_if-youre-reporting-this-issue-for-the-first-time-in-the-forums\">If you're reporting this issue for the first time in the forums</h2>\n<p>When you create a new question, go to the <em>Troubleshooting Information</em> section of the Ask a Question form and click the <span class=\"button\">Share Data</span> button.  (Only available for Firefox Desktop.) This fills in a field in the form with detailed information about the internal workings of your browser that will help answer your question.\n</p><p>If it doesn't automatically gather your information, you can manually copy the data as follows:\n</p>\n<ol><li>Click the Firefox menu button <span class=\"for\" data-for=\"fx89\"><img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"not fx89\"><img alt=\"Fx57Menu\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2017-10-22-15-37-15-18c775.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>, click <span class=\"for\" data-for=\"not fx89\"><img alt=\"Fx57Help\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2018-04-30-13-36-30-8d298a.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"menu\">Help</span> and select <span class=\"for\" data-for=\"not fx88\"><span class=\"menu\">Troubleshooting Information</span></span><span class=\"for\" data-for=\"fx88\"><span class=\"menu\">More Troubleshooting Information</span></span>.\n<dl><dt>The Troubleshooting Information page with the address <strong>about:support</strong>  will open in a new tab. \n</dt></dl>\n</li><li>Click <span class=\"button\">Copy text to clipboard</span>. \n</li><li>Go back to the Ask a Question form and paste the data into the text field under the <em>Troubleshooting Information</em> section.\n</li><li>Complete the form and post your question.\n</li></ol>\n<h2 id=\"w_if-you-have-already-filed-a-question-on-the-forum\">If you have already filed a question on the forum</h2>\n<p>Go to your support question, which is accessible from your Mozilla Support user profile page, to add detailed information about the internal workings of your browser.\n</p>\n<ol><li>Go to the <a href=\"https://support.mozilla.org\">Mozilla Support</a> page, hover over your name at the top of the page and click <strong>My Questions</strong> in the profile section.\n</li><li>Click the question title.\n</li><li>Click <span class=\"menu\">Edit this question</span> on the right sidebar.\n</li><li>Follow the steps in the previous section for using the <span class=\"button\">Share Data</span> button.\n</li></ol>\n<h1 id=\"w_how-do-i-avoid-this-problem\">How do I avoid this problem?</h1>\n<p>To make sure that you use add-ons that are safe, install extensions from the <a href=\"/en-US/kb/recommended-extensions-program\">Recommended Extensions program</a>. These extensions are thoroughly evaluated by the team for safety before they receive the <em>Recommended</em> status.\n</p>",
  "text": "Sometimes, add-ons can break your settings. This article explains how to troubleshoot issues related to add-ons in Firefox. Table of Contents 1 How do I know if my problem is related to add-ons? 2 How can I fix this problem? 2.1 If you're reporting this issue for the first time in the forums 2.2 If you have already filed a question on the forum 3 How do I avoid this problem? How do I know if my problem is related to add-ons? Here are a few examples of add-ons affecting or breaking Firefox: Your default search has changed unexpectedly. Your home page or browser settings have changed. Changes in behavior when searching or browsing (such as unexpected redirects to a different website or search provider). Unexpected changes on web pages. How can I fix this problem? As a first step, you could restart Firefox with add-ons disabled (see Diagnose Firefox issues using Troubleshoot Mode to learn how). If the issue goes away, restart Firefox with add-ons enabled, then selectively disable add-ons until you figure out which add-on is causing the problem and either disable or remove the add-on . If you need more help, you can file a question in our support forum to find out more about the issue you're experiencing. Go to the Ask the Community page in Mozilla Support. Select the product you need help with. Search for existing solutions in the knowledge base or forums. If you don't find any, or they don't help you solve the problem, click the Ask Now button to file a new question. If you're reporting this issue for the first time in the forums When you create a new question, go to the Troubleshooting Information section of the Ask a Question form and click the Share Data button. (Only available for Firefox Desktop.) This fills in a field in the form with detailed information about the internal workings of your browser that will help answer your question. If it doesn't automatically gather your information, you can manually copy the data as follows: Click the Firefox menu button , click Help and select Troubleshooting Information More Troubleshooting Information . The Troubleshooting Information page with the address about:support will open in a new tab. Click Copy text to clipboard . Go back to the Ask a Question form and paste the data into the text field under the Troubleshooting Information section. Complete the form and post your question. If you have already filed a question on the forum Go to your support question, which is accessible from your Mozilla Support user profile page, to add detailed information about the internal workings of your browser. Go to the Mozilla Support page, hover over your name at the top of the page and click My Questions in the profile section. Click the question title. Click Edit this question on the right sidebar. Follow the steps in the previous section for using the Share Data button. How do I avoid this problem? To make sure that you use add-ons that are safe, install extensions from the Recommended Extensions program . These extensions are thoroughly evaluated by the team for safety before they receive the Recommended status.",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "site-breakages"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6111,
    "text_bytes": 3104,
    "word_count": 531,
    "downloaded_at": "2025-08-26T10:53:51.094964"
  }
}