{
  "slug": "unable-install-add-ons-extensions-or-themes",
  "title": "Unable to install add-ons (extensions or themes)",
  "summary": "This article describes various reasons why you are not able to install a Firefox add-on and possible ways to fix the problem.",
  "url": "https://support.mozilla.org/en-US/kb/unable-install-add-ons-extensions-or-themes",
  "html": "<p>An inability to install an extension can be the result of problems with the extension, Firefox preferences, or the version of Firefox you are using. This article describes various causes of install problems and what you can do to address them.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_add-on-is-not-compatible\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Add-on is not compatible</span></a></li><li class=\"toclevel-1\"><a href=\"#w_firefox-has-prevented-this-site-from-installing-an-unverified-add-on\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Firefox has prevented this site from installing an unverified add-on</span></a></li><li class=\"toclevel-1\"><a href=\"#w_add-on-has-a-high-risk-of-causing-stability-or-security-problems-and-cant-be-installed\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Add-on has a high risk of causing stability or security problems and can't be installed</span></a></li><li class=\"toclevel-1\"><a href=\"#w_firefox-prevented-the-site-from-asking-you-to-install-software\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Firefox prevented the site from asking you to install software</span></a></li><li class=\"toclevel-1\"><a href=\"#w_you-are-asked-to-download-the-add-on-rather-than-installing-it\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">You are asked to download the add-on, rather than installing it</span></a></li><li class=\"toclevel-1\"><a href=\"#w_nothing-happens-when-you-click-the-install-link\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Nothing happens when you click the install link</span></a></li><li class=\"toclevel-1\"><a href=\"#w_corrupt-extension-files\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">Corrupt extension files</span></a></li><li class=\"toclevel-1\"><a href=\"#w_conflict-with-other-extensions\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">Conflict with other extensions</span></a></li></ul></div>\n<h1 id=\"w_add-on-is-not-compatible\">Add-on is not compatible</h1>\n<p>An internal file in each add-on indicates the range of Firefox versions with which the extension is compatible. In the <a href=\"https://addons.mozilla.org/\">Firefox Add-ons</a> area of Mozilla, you can review version compatibility information on the page for each available extension.\n</p><p>If your installed version of Firefox does not fit within that range, installing the add-on results in an error, indicating that the add-on is not compatible. If your version of Firefox is incompatible with the add-on, you can:\n</p>\n<ul><li> Update to the latest version of Firefox. For more information, see <a href=\"/en-US/kb/update-firefox-latest-release\">Update Firefox to the latest release</a>.\n</li><li> Find a version of the add-on that is compatible with your version of Firefox. The <a href=\"https://addons.mozilla.org/\">Firefox Add-ons</a> website usually has the most up to date version of each add-on.\n</li><li> Use a different extension. For many extensions, there are similar extensions that provide the same functionality. For more information, see <a href=\"https://addons.mozilla.org/\">Firefox Add-ons</a>.\n</li><li> Contact the author of the add-on at the support site listed on its add-on page. (Note: posting a review is not effective and will not reach the author.)\n</li></ul>\n<h1 id=\"w_firefox-has-prevented-this-site-from-installing-an-unverified-add-on\">Firefox has prevented this site from installing an unverified add-on</h1>\n<p>Firefox protects you against malware and browser hijackers by blocking third-party add-ons that are not digitally signed and verified by Mozilla. For more information, see <a href=\"/en-US/kb/add-on-signing-in-firefox\">Add-on signing in Firefox</a>.\n</p>\n<h1 id=\"w_add-on-has-a-high-risk-of-causing-stability-or-security-problems-and-cant-be-installed\">Add-on has a high risk of causing stability or security problems and can't be installed</h1>\n<p>Certain add-ons have been blocklisted by Mozilla for being unsafe.  For more information, see <a href=\"/en-US/kb/add-ons-cause-issues-are-on-blocklist\">Why does Mozilla disable some add-ons from running in Firefox?</a>.\n</p>\n<h1 id=\"w_firefox-prevented-the-site-from-asking-you-to-install-software\">Firefox prevented the site from asking you to install software</h1>\n<p>By default, Firefox permits you to install add-ons only from trusted websites. If the website from which you are installing add-on is not on the trusted websites list, a yellow bar appears across the top of the web page with a message similar to the following:\n</p>\n<div class=\"note\">Firefox prevented this site (www.example.com) from asking you to install software on your computer.</div>\n<p>To allow the site, click <span class=\"button\">Allow</span> in the yellow bar.\n</p><p>To add the site to the trusted sites list:\n</p>\n<ol><li> <span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li> Select the <span class=\"menu\">Privacy &amp; Security</span> panel and go down to the <em>Permissions</em> section.\n</li><li> At the right of <em>Warn you when sites try to install add-ons</em>, click <span class=\"button\">Exceptions…</span>.\n</li><li> In the <strong>Allowed Websites - Add-ons Installation</strong> dialog, the list of permitted sites is displayed. The current site URL is inserted into the text field. \n</li><li> To allow the site, click <span class=\"button\">Allow</span>. Then, click <span class=\"button\">Save Changes</span>.\n</li><li>Close the <span class=\"menu\">Settings</span> page. Any changes you've made will automatically be saved.\n\n</li></ol>\n<h1 id=\"w_you-are-asked-to-download-the-add-on-rather-than-installing-it\">You are asked to download the add-on, rather than installing it</h1>\n<p>Some websites serve add-ons as downloads, requiring you to download the file to your computer, before installing it. \n</p>\n<ul><li> These files are usually <span class=\"filepath\"><a href=\"http://en.wikipedia.org/wiki/XPInstall\">.xpi</a></span> or <span class=\"filepath\"><a href=\"http://en.wikipedia.org/wiki/JAR_%28file_format%29\">.jar</a></span> files. \n</li></ul>\n<ol><li> Download the file to your local computer.\n</li><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"for\" data-for=\"not fx140\"><span class=\"menu\">Add-ons and themes</span></span><span class=\"for\" data-for=\"fx140\"><span class=\"menu\">Extensions and themes</span></span> and select <span class=\"menu\">Extensions</span>.\n\n</li><li> To add the downloaded add-on to the list of available add-ons, drag and drop the file into the Add-ons window. The add-on is added to the list.\n</li><li>  The installation process should begin.\n</li></ol>\n<h1 id=\"w_nothing-happens-when-you-click-the-install-link\">Nothing happens when you click the install link</h1>\n<p>If you click an install link and nothing happens, you should verify that JavaScript is enabled. For more information, see <a href=\"/en-US/kb/javascript-settings-for-interactive-web-pages\">JavaScript settings and preferences for interactive web pages</a>.\n</p>\n<h1 id=\"w_corrupt-extension-files\">Corrupt extension files</h1>\n<p>Corrupt extension configuration files can cause problems when trying to install an extension. Deleting these files will make Firefox recreate them (removing any corruption) the next time it starts. You won't lose your extensions or their settings by deleting these files.\n</p>\n<ol><li> <p>Open your profile folder: \n</p><ul><li><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"menu\">Help</span> and select <span class=\"menu\">More Troubleshooting Information</span>.</span><span class=\"for\" data-for=\"mac\">From the <span class=\"menu\">Help</span> menu, select <span class=\"menu\">More Troubleshooting Information</span>.</span> The <strong>Troubleshooting Information</strong> tab will open.\n</li><li>Under the <strong>Application Basics</strong> section next to <em><span class=\"for\" data-for=\"not linux\">Profile Folder</span><span class=\"for\" data-for=\"linux\">Profile Directory</span></em>, click <span class=\"button\"><span class=\"for\" data-for=\"win\">Open Folder</span><span class=\"for\" data-for=\"mac\">Show in Finder</span><span class=\"for\" data-for=\"linux\">Open Directory</span></span>. <span class=\"for\" data-for=\"mac\">A window will open that contains your profile folder.</span><span class=\"for\" data-for=\"win\">Your profile folder will open.</span><span class=\"for\" data-for=\"linux\">Your profile directory will open.</span>\n</li></ul>\n<div class=\"note\"><strong>Note:</strong>  If<span class=\"for\" data-for=\"win10,win11\"> Firefox displays an error after clicking <span class=\"button\">Open Folder</span> or if</span> you are unable to open or use Firefox, follow the instructions in <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data#w_finding-your-profile-without-opening-firefox\">Finding your profile without opening Firefox</a>.</div>\n<p></p>\n</li><li> <span class=\"for\" data-for=\"win\">Click the Firefox menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Exit</span>.</span><span class=\"for\" data-for=\"mac\">Click the Firefox menu at the top of the screen and select <span class=\"menu\">Quit Firefox</span>.</span><span class=\"for\" data-for=\"linux\">Click the Firefox menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Quit</span>.</span>\n\n</li><li> Delete the following files:\n<ul><li> <span class=\"filepath\">extensions.sqlite</span>\n</li><li> <span class=\"filepath\">extensions.sqlite-journal</span> (if found) \n</li><li> <span class=\"filepath\">extensions.ini</span>\n</li><li> <span class=\"filepath\">extensions.json</span>\n</li></ul>\n</li><li> Restart Firefox.\n</li></ol>\n<h1 id=\"w_conflict-with-other-extensions\">Conflict with other extensions</h1>\n<p>Another installed extension may interfere with the installation of new extensions. Install the new extension in Firefox <a href=\"/en-US/kb/diagnose-firefox-issues-using-troubleshoot-mode\">Troubleshoot Mode</a> as a workaround. \n</p><p>\n<br><br>\n<em><strong>Based on information from <a href=\"http://kb.mozillazine.org/Unable_to_install_themes_or_extensions_-_Firefox\">Unable to install themes or extensions - Firefox (mozillaZine KB)</a></strong></em>🦊\n</p>",
  "text": "An inability to install an extension can be the result of problems with the extension, Firefox preferences, or the version of Firefox you are using. This article describes various causes of install problems and what you can do to address them. Table of Contents 1 Add-on is not compatible 2 Firefox has prevented this site from installing an unverified add-on 3 Add-on has a high risk of causing stability or security problems and can't be installed 4 Firefox prevented the site from asking you to install software 5 You are asked to download the add-on, rather than installing it 6 Nothing happens when you click the install link 7 Corrupt extension files 8 Conflict with other extensions Add-on is not compatible An internal file in each add-on indicates the range of Firefox versions with which the extension is compatible. In the Firefox Add-ons area of Mozilla, you can review version compatibility information on the page for each available extension. If your installed version of Firefox does not fit within that range, installing the add-on results in an error, indicating that the add-on is not compatible. If your version of Firefox is incompatible with the add-on, you can: Update to the latest version of Firefox. For more information, see Update Firefox to the latest release . Find a version of the add-on that is compatible with your version of Firefox. The Firefox Add-ons website usually has the most up to date version of each add-on. Use a different extension. For many extensions, there are similar extensions that provide the same functionality. For more information, see Firefox Add-ons . Contact the author of the add-on at the support site listed on its add-on page. (Note: posting a review is not effective and will not reach the author.) Firefox has prevented this site from installing an unverified add-on Firefox protects you against malware and browser hijackers by blocking third-party add-ons that are not digitally signed and verified by Mozilla. For more information, see Add-on signing in Firefox . Add-on has a high risk of causing stability or security problems and can't be installed Certain add-ons have been blocklisted by Mozilla for being unsafe. For more information, see Why does Mozilla disable some add-ons from running in Firefox? . Firefox prevented the site from asking you to install software By default, Firefox permits you to install add-ons only from trusted websites. If the website from which you are installing add-on is not on the trusted websites list, a yellow bar appears across the top of the web page with a message similar to the following: Firefox prevented this site (www.example.com) from asking you to install software on your computer. To allow the site, click Allow in the yellow bar. To add the site to the trusted sites list: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select the Privacy & Security panel and go down to the Permissions section. At the right of Warn you when sites try to install add-ons , click Exceptions… . In the Allowed Websites - Add-ons Installation dialog, the list of permitted sites is displayed. The current site URL is inserted into the text field. To allow the site, click Allow . Then, click Save Changes . Close the Settings page. Any changes you've made will automatically be saved. You are asked to download the add-on, rather than installing it Some websites serve add-ons as downloads, requiring you to download the file to your computer, before installing it. These files are usually .xpi or .jar files. Download the file to your local computer. Click the menu button , click Add-ons and themes Extensions and themes and select Extensions . To add the downloaded add-on to the list of available add-ons, drag and drop the file into the Add-ons window. The add-on is added to the list. The installation process should begin. Nothing happens when you click the install link If you click an install link and nothing happens, you should verify that JavaScript is enabled. For more information, see JavaScript settings and preferences for interactive web pages . Corrupt extension files Corrupt extension configuration files can cause problems when trying to install an extension. Deleting these files will make Firefox recreate them (removing any corruption) the next time it starts. You won't lose your extensions or their settings by deleting these files. Open your profile folder: Click the menu button , click Help and select More Troubleshooting Information . From the Help menu, select More Troubleshooting Information . The Troubleshooting Information tab will open. Under the Application Basics section next to Profile Folder Profile Directory , click Open Folder Show in Finder Open Directory . A window will open that contains your profile folder. Your profile folder will open. Your profile directory will open. Note: If Firefox displays an error after clicking Open Folder or if you are unable to open or use Firefox, follow the instructions in Finding your profile without opening Firefox . Click the Firefox menu and select Exit . Click the Firefox menu at the top of the screen and select Quit Firefox . Click the Firefox menu and select Quit . Delete the following files: extensions.sqlite extensions.sqlite-journal (if found) extensions.ini extensions.json Restart Firefox. Conflict with other extensions Another installed extension may interfere with the installation of new extensions. Install the new extension in Firefox Troubleshoot Mode as a workaround. Based on information from Unable to install themes or extensions - Firefox (mozillaZine KB) 🦊",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 11905,
    "text_bytes": 5704,
    "word_count": 934,
    "downloaded_at": "2025-08-26T09:04:07.011753"
  }
}