{
  "slug": "understanding-risks-unlisted-extensions",
  "title": "Understanding the risks of installing self-hosted extensions",
  "summary": "Learn about the risks of installing extensions from third-parties and how to assess the trustworthiness of the source.",
  "url": "https://support.mozilla.org/en-US/kb/understanding-risks-unlisted-extensions",
  "html": "<p><a href=\"/en-US/kb/find-and-install-add-ons-add-features-to-firefox\">Extensions</a> enable you to add features to Firefox for a personalized browsing experience. \n</p><p>Extensions that are distributed by the developers themselves, rather than by Mozilla on <a href=\"http://addons.mozilla.org\">addons.mozilla.org</a> (AMO), are referred to as “self-hosted.” While users should exercise caution when installing extensions from any source—AMO included—users should take special care determining the trustworthiness of a self-hosted extension. Although most extensions are created by developers with the honest intent of providing great new browser features, some bad actors may use extensions to compromise your personal browsing data.\n</p>\n<h1 id=\"w_assess-the-trustworthiness-of-any-website-or-source-of-a-self-hosted-extension\">Assess the trustworthiness of any website or source of a self-hosted extension</h1>\n<p>There’s inherent risk associated with installing any third party software. Extensions are no different. When evaluating the trustworthiness of a self-hosted extension, consider the following questions:\n</p>\n<ul><li> <strong>Were you prompted by a website to install the extension?</strong> This isn’t necessarily a red flag, because there may be a legitimate reason for a website to promote an extension, but this is an indication that you should proceed carefully. \n</li><li> <strong>Are you familiar with the website or source of the self-hosted extension?</strong> If you’re unfamiliar and can’t establish trust, avoid installing the extension. (Keep in mind some malicious sites may mimic the look and feel of known, trustworthy brands.)\n</li><li> <strong>What can you learn about the extension and its developer from a quick internet search?</strong> Try searching the extension and developer’s name. What do you find? Do any concerning issues arise? \n</li><li> <strong>Does the extension provide a privacy policy?</strong> It’s not necessary for every extension to provide a privacy policy, but if the extension asks for powerful <a href=\"/en-US/kb/permission-request-messages-firefox-extensions\">permission requests</a>, it should provide a clear policy explaining how your data is treated. Make certain you’re comfortable with the privileges and permissions you grant. \n</li><li> <strong>Are you sure you need the extension?</strong> This may seem obvious, but it bears reinforcing—if you don’t really need or want the extension, consider avoiding it. Carefully review its features and services. Does the extension offer you a clear benefit? \n</li></ul>\n<p>These are just a few tips to help you assess the trustworthiness of a self-hosted extension, but it is by no means a comprehensive guide. Please use your best judgement when considering any third party software.\n</p>",
  "text": "Extensions enable you to add features to Firefox for a personalized browsing experience. Extensions that are distributed by the developers themselves, rather than by Mozilla on addons.mozilla.org (AMO), are referred to as “self-hosted.” While users should exercise caution when installing extensions from any source—AMO included—users should take special care determining the trustworthiness of a self-hosted extension. Although most extensions are created by developers with the honest intent of providing great new browser features, some bad actors may use extensions to compromise your personal browsing data. Assess the trustworthiness of any website or source of a self-hosted extension There’s inherent risk associated with installing any third party software. Extensions are no different. When evaluating the trustworthiness of a self-hosted extension, consider the following questions: Were you prompted by a website to install the extension? This isn’t necessarily a red flag, because there may be a legitimate reason for a website to promote an extension, but this is an indication that you should proceed carefully. Are you familiar with the website or source of the self-hosted extension? If you’re unfamiliar and can’t establish trust, avoid installing the extension. (Keep in mind some malicious sites may mimic the look and feel of known, trustworthy brands.) What can you learn about the extension and its developer from a quick internet search? Try searching the extension and developer’s name. What do you find? Do any concerning issues arise? Does the extension provide a privacy policy? It’s not necessary for every extension to provide a privacy policy, but if the extension asks for powerful permission requests , it should provide a clear policy explaining how your data is treated. Make certain you’re comfortable with the privileges and permissions you grant. Are you sure you need the extension? This may seem obvious, but it bears reinforcing—if you don’t really need or want the extension, consider avoiding it. Carefully review its features and services. Does the extension offer you a clear benefit? These are just a few tips to help you assess the trustworthiness of a self-hosted extension, but it is by no means a comprehensive guide. Please use your best judgement when considering any third party software.",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2800,
    "text_bytes": 2341,
    "word_count": 360,
    "downloaded_at": "2025-08-26T10:47:31.428403"
  }
}