{
  "slug": "what-if-im-locked-out-two-step-authentication",
  "title": "What if I'm locked out of Two-Step Authentication?",
  "summary": "Disable two-step authentication or use a backup authentication code to regain access to your account if you've been locked out of two-step authentication login.",
  "url": "https://support.mozilla.org/en-US/kb/what-if-im-locked-out-two-step-authentication",
  "html": "<p>This article explains what to do if you have been locked out of your Mozilla account <a href=\"/en-US/kb/secure-firefox-account-two-step-authentication\">two-step authentication</a> login.\n</p>\n<ul><li>If you received a message that your Mozilla account was locked because a confirmation email was returned, see the <a href=\"/en-US/kb/im-having-problems-confirming-my-firefox-account#w_your-mozilla-account-has-been-locked\">I'm having problems confirming my Mozilla account</a> article instead.\n</li></ul>\n<p>Two-step authentication adds extra security to your Mozilla account by making it harder for someone else to sign in to your account. If you’ve gotten locked out of your two-step authentication login, you can use one of your previously saved backup authentication codes to securely regain access to your account. Alternatively, if you have a device still signed in to your account, you can use that device to disable two-factor authentication, so you can sign in to your account without two-step authentication.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_i-have-my-two-step-authentication-device-but-it-says-invalid-code\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">I have my two-step authentication device but it says invalid code</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-lost-my-two-step-authentication-device-but-i-have-another-signed-in-device\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">I lost my two-step authentication device but I have another signed-in device</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-lost-my-two-step-authentication-device-but-i-have-a-backup-authentication-code\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">I lost my two-step authentication device but I have a backup authentication code</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-lost-my-two-step-authentication-device-but-i-have-a-recovery-phone\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">I lost my two-step authentication device but I have a recovery phone</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-lost-my-two-step-authentication-device-cant-find-my-backup-authentication-codes-and-dont-have-a-signed-in-device-but-i-did-previously-register-my-phone-number\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">I lost my two-step authentication device, can’t find my backup authentication codes and don’t have a signed-in device but I did previously register my phone number</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-lost-my-two-step-authentication-device-cant-find-my-backup-authentication-codes-and-dont-have-a-signed-in-device-can-i-request-to-delete-my-mozilla-account\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">I lost my two-step authentication device, can’t find my backup authentication codes and don’t have a signed-in device. Can I request to delete my Mozilla account?</span></a></li></ul></div>\n<h1 id=\"w_i-have-my-two-step-authentication-device-but-it-says-invalid-code\">I have my two-step authentication device but it says invalid code</h1>\n<ol><li>Ensure you’re using the correct authentication application. You may see a name on it such as “Firefox:”.\n</li><li>If you're using <em>Google Authenticator</em>, tap on the three-dot menu, go to <strong>Settings</strong>, select <strong>Time correction for codes</strong> and then <strong>Sync now</strong>.\n</li><li>Check your device clocks: Authentication apps rely on accurate time settings. Ensure that both your authentication device and the device you're logging into have the correct date and time settings. Consider enabling automatic time synchronization in your device settings.\n</li></ol>\n<h1 id=\"w_i-lost-my-two-step-authentication-device-but-i-have-another-signed-in-device\">I lost my two-step authentication device but I have another signed-in device</h1>\n<p>If you're locked out of your account but have a device still signed in via two-step authentication, you can use that device to disable two-step authentication:\n</p>\n<ol><li>Go to <a href=\"https://accounts.firefox.com\">https://accounts.firefox.com</a> and sign in.\n</li><li>Under <em>Security</em>, click the <span class=\"button\">Disable</span> button next to <strong>Two-step authentication</strong>.\n</li><li>Click the <span class=\"button\">Disable</span> button in the <em>Disable two-step authentication?</em> prompt.\n</li></ol>\n<p>If you don't have access to your signed-in devices and lost your two-step authentication devices, continue to the sections below.\n</p>\n<h1 id=\"w_i-lost-my-two-step-authentication-device-but-i-have-a-backup-authentication-code\">I lost my two-step authentication device but I have a backup authentication code</h1>\n<ol><li>Go to <a href=\"https://accounts.firefox.com\">https://accounts.firefox.com</a> and sign in.\n</li><li>If you are prompted for a two-step authentication code, click <strong>Trouble entering code?</strong>\n</li><li>If you are prompted with a choice between <strong>Recovery phone</strong> and <strong>Backup authentication code</strong>, choose <strong>Backup authentication code</strong>.\n</li><li>Enter one of your previously saved backup authentication codes.\n<ul><li>If you don't remember saving your backup authentication codes, search your device or cloud storage for a file named <strong>&lt;your_email&gt; backup authentication codes.txt</strong> or <strong>&lt;your_email&gt; Firefox backup authentication codes.txt</strong>.\n</li></ul>\n</li><li>Go to <em>Security</em> and click the <span class=\"button\">Disable</span> button next to <strong>Two-step authentication</strong>.\n</li></ol>\n<h1 id=\"w_i-lost-my-two-step-authentication-device-but-i-have-a-recovery-phone\">I lost my two-step authentication device but I have a recovery phone</h1>\n<p>After you enter your account’s password to sign in, the login process will request the code from your authenticator app. If you lose access to your authenticator app, you can request a code via SMS to regain access to your Mozilla account, as long as you have previously set up your recovery phone number.\n</p>\n<ol><li>Go to <a href=\"https://accounts.firefox.com\">https://accounts.firefox.com</a> and sign in.\n</li><li>If you are prompted for a two-step authentication code, click <strong>Trouble entering code?</strong>\n</li><li>Choose the recovery phone option to receive the text message.\n</li><li>Enter the six-digit code that you received via SMS.\n</li><li>Go to <em>Security</em> and click the <span class=\"button\">Disable</span> button next to <strong>Two-step authentication</strong>.\n</li></ol>\n<h1 id=\"w_i-lost-my-two-step-authentication-device-cant-find-my-backup-authentication-codes-and-dont-have-a-signed-in-device-but-i-did-previously-register-my-phone-number\">I lost my two-step authentication device, can’t find my backup authentication codes and don’t have a signed-in device but I did previously register my phone number</h1>\n<p>If you have set up a recovery phone and can transfer that number to another sim card or device, you will be able to receive your one-time password as long as you have previously saved your recovery phone number.\n</p><p>If you don’t have a recovery phone number, unfortunately, deactivation by Mozilla of two-step authentication is not supported, and you will not be able to access your existing Sync data. For more information, see <a href=\"/en-US/kb/sync\">Sync Firefox data</a>. You can however create a new account with a different email address to begin syncing again and reach out to our support team to cancel any active subscription.\n</p>\n<div class=\"note\"><strong>Note:</strong> If you are an Add-on developer user who lost access to their Mozilla account, Two-step authentication and/or phone recovery number, please contact our support team for further assistance.</div>\n<h1 id=\"w_i-lost-my-two-step-authentication-device-cant-find-my-backup-authentication-codes-and-dont-have-a-signed-in-device-can-i-request-to-delete-my-mozilla-account\">I lost my two-step authentication device, can’t find my backup authentication codes and don’t have a signed-in device. Can I request to delete my Mozilla account?</h1>\n<p>In this case, it is currently not possible to delete your Mozilla account, since we don't have a way to verify your identity and ownership of that account. We recommend creating a new Mozilla account to use Firefox Sync and other services that require a Mozilla account.\n</p>",
  "text": "This article explains what to do if you have been locked out of your Mozilla account two-step authentication login. If you received a message that your Mozilla account was locked because a confirmation email was returned, see the I'm having problems confirming my Mozilla account article instead. Two-step authentication adds extra security to your Mozilla account by making it harder for someone else to sign in to your account. If you’ve gotten locked out of your two-step authentication login, you can use one of your previously saved backup authentication codes to securely regain access to your account. Alternatively, if you have a device still signed in to your account, you can use that device to disable two-factor authentication, so you can sign in to your account without two-step authentication. Table of Contents 1 I have my two-step authentication device but it says invalid code 2 I lost my two-step authentication device but I have another signed-in device 3 I lost my two-step authentication device but I have a backup authentication code 4 I lost my two-step authentication device but I have a recovery phone 5 I lost my two-step authentication device, can’t find my backup authentication codes and don’t have a signed-in device but I did previously register my phone number 6 I lost my two-step authentication device, can’t find my backup authentication codes and don’t have a signed-in device. Can I request to delete my Mozilla account? I have my two-step authentication device but it says invalid code Ensure you’re using the correct authentication application. You may see a name on it such as “Firefox:”. If you're using Google Authenticator , tap on the three-dot menu, go to Settings , select Time correction for codes and then Sync now . Check your device clocks: Authentication apps rely on accurate time settings. Ensure that both your authentication device and the device you're logging into have the correct date and time settings. Consider enabling automatic time synchronization in your device settings. I lost my two-step authentication device but I have another signed-in device If you're locked out of your account but have a device still signed in via two-step authentication, you can use that device to disable two-step authentication: Go to https://accounts.firefox.com and sign in. Under Security , click the Disable button next to Two-step authentication . Click the Disable button in the Disable two-step authentication? prompt. If you don't have access to your signed-in devices and lost your two-step authentication devices, continue to the sections below. I lost my two-step authentication device but I have a backup authentication code Go to https://accounts.firefox.com and sign in. If you are prompted for a two-step authentication code, click Trouble entering code? If you are prompted with a choice between Recovery phone and Backup authentication code , choose Backup authentication code . Enter one of your previously saved backup authentication codes. If you don't remember saving your backup authentication codes, search your device or cloud storage for a file named <your_email> backup authentication codes.txt or <your_email> Firefox backup authentication codes.txt . Go to Security and click the Disable button next to Two-step authentication . I lost my two-step authentication device but I have a recovery phone After you enter your account’s password to sign in, the login process will request the code from your authenticator app. If you lose access to your authenticator app, you can request a code via SMS to regain access to your Mozilla account, as long as you have previously set up your recovery phone number. Go to https://accounts.firefox.com and sign in. If you are prompted for a two-step authentication code, click Trouble entering code? Choose the recovery phone option to receive the text message. Enter the six-digit code that you received via SMS. Go to Security and click the Disable button next to Two-step authentication . I lost my two-step authentication device, can’t find my backup authentication codes and don’t have a signed-in device but I did previously register my phone number If you have set up a recovery phone and can transfer that number to another sim card or device, you will be able to receive your one-time password as long as you have previously saved your recovery phone number. If you don’t have a recovery phone number, unfortunately, deactivation by Mozilla of two-step authentication is not supported, and you will not be able to access your existing Sync data. For more information, see Sync Firefox data . You can however create a new account with a different email address to begin syncing again and reach out to our support team to cancel any active subscription. Note: If you are an Add-on developer user who lost access to their Mozilla account, Two-step authentication and/or phone recovery number, please contact our support team for further assistance. I lost my two-step authentication device, can’t find my backup authentication codes and don’t have a signed-in device. Can I request to delete my Mozilla account? In this case, it is currently not possible to delete your Mozilla account, since we don't have a way to verify your identity and ownership of that account. We recommend creating a new Mozilla account to use Firefox Sync and other services that require a Mozilla account.",
  "products": [
    "firefox",
    "mozilla-account"
  ],
  "topics": [
    "accounts",
    "passwords-and-sign-in",
    "two-factor-authentication"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 8426,
    "text_bytes": 5398,
    "word_count": 870,
    "downloaded_at": "2025-08-26T10:47:07.181497"
  }
}