{
  "slug": "where-are-my-logins-stored",
  "title": "Where are my logins stored?",
  "summary": "Learn about password management in Firefox, how websites save login information and how to control what logins get entered automatically.",
  "url": "https://support.mozilla.org/en-US/kb/where-are-my-logins-stored",
  "html": "<p>\nDid Firefox save my logins? Did this website save them? How do I control what logins are entered automatically on websites? We'll explain how to store your logins so you can control what happens automatically.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_how-to-tell-where-your-login-will-be-stored\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">How to tell where your login will be stored</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_firefox-password-management\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Firefox password management</span></a></li><li class=\"toclevel-2\"><a href=\"#w_cookies\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Cookies</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_strategies-for-saving-your-login-information\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Strategies for saving your login information</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_use-phrases-to-create-easy-to-remember-passwords\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Use phrases to create easy to remember passwords</span></a></li><li class=\"toclevel-2\"><a href=\"#w_use-firefox-to-manage-logins-with-a-primary-password\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">Use Firefox to manage logins with a Primary Password</span></a></li><li class=\"toclevel-2\"><a href=\"#w_use-firefox-to-manage-logins-without-a-primary-password\"><span class=\"tocnumber\">2.3</span> <span class=\"toctext\">Use Firefox to manage logins without a Primary Password</span></a></li><li class=\"toclevel-2\"><a href=\"#w_store-your-logins-with-both-firefox-password-management-and-cookies\"><span class=\"tocnumber\">2.4</span> <span class=\"toctext\">Store your logins with both Firefox password management and cookies</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_how-to-manage-your-logins\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How to manage your logins</span></a></li><li class=\"toclevel-1\"><a href=\"#w_additional-password-management-software\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Additional password management software</span></a></li></ul></div>\n<h1 id=\"w_how-to-tell-where-your-login-will-be-stored\">How to tell where your login will be stored</h1>\n<p>Your logins may be stored using the Firefox password management feature and also in cookies. See below for the pros and cons of each method.\n</p>\n<h2 id=\"w_firefox-password-management\">Firefox password management</h2>\n<p><a href=\"/en-US/kb/password-manager-remember-delete-edit-logins\">Firefox password management</a> securely stores the usernames and passwords you use to access websites and then automatically fills them in for you the next time you visit. \n</p><p>When you enter a username and password Firefox hasn't already stored for a website, Firefox's Remember Password prompt will ask if you want Firefox to remember them. When you click Remember Password, the next time you visit the website, Firefox will automatically log you in to the website.\nOne advantage of using Firefox password management is that it stores all your logins - your usernames and passwords - in one single place. You can find your logins in Firefox and not worry about forgetting where they are.\n</p><p>On the other hand, putting all your logins in one place, unprotected, can be risky. Theoretically, someone who has access to your computer could open and view your logins in Firefox and go on an Amazon shopping spree! Fortunately, Firefox lets you use a <a href=\"/en-US/kb/use-primary-password-protect-stored-logins\">Primary Password</a> to prevent others from accessing your logins without your permission. \n</p>\n<h2 id=\"w_cookies\">Cookies</h2>\n<p>A <a href=\"/en-US/kb/cookies-information-websites-store-on-your-computer\">cookie</a> is a piece of information that a website stores on your computer. Some websites will save your login information on cookies.\n</p><p>When you visit a website and check a box that says something like, \"Remember me\", the website will save your login information, such as your username and password or just your username, on a cookie. The next time you visit the website, your computer will send your login cookie back to the website, and you'll be logged in automatically or required to enter your password but not your username to log in. \n</p><p>An advantage of using cookies is that they can keep you logged in a website so that you can skip the login page and quickly get to where you want. Facebook and Twitter's cookies will let you do this, for instance. \n</p><p>One disadvantage of using cookies is that they will lose your login information whenever you clear your computer's cookies and cache. This could happen by accident if you are trying to fix a problem between your computer and a website. So you would then need to re-enter your login information the next time you visited your favorite websites. \n</p>\n<h1 id=\"w_strategies-for-saving-your-login-information\">Strategies for saving your login information</h1>\n<h2 id=\"w_use-phrases-to-create-easy-to-remember-passwords\">Use phrases to create easy to remember passwords</h2>\n<p>If you want the most secure method for storing your login information, then you should rely on your memory. It's easier than you think. Choose a different login for every website and memorize them. See <a href=\"/en-US/kb/password-strength\">Choose a strong password</a> for details.\n</p>\n<h2 id=\"w_use-firefox-to-manage-logins-with-a-primary-password\">Use Firefox to manage logins with a Primary Password</h2>\n<p>Maybe you need some help remembering all of those logins. The next most secure method is to <a href=\"/en-US/kb/password-strength\">choose a different login for every website</a>, save them in Firefox when prompted and then secure everything with a <a href=\"/en-US/kb/use-primary-password-protect-stored-logins\">Primary Password</a>. \n</p>\n<h2 id=\"w_use-firefox-to-manage-logins-without-a-primary-password\">Use Firefox to manage logins without a Primary Password</h2>\n<p>Perhaps the risk of someone accessing websites with your logins is low — your computer doesn't leave the house, it's connected to a secure network and the people who use it are trusted. In that case, you can just <a href=\"/en-US/kb/password-strength\">choose a different login for every website</a>, save those logins with the <a href=\"/en-US/kb/password-manager-remember-delete-edit-logins\">Firefox password management</a> feature and skip the Primary password. \n</p>\n<h2 id=\"w_store-your-logins-with-both-firefox-password-management-and-cookies\">Store your logins with both Firefox password management and cookies</h2>\n<p>Maybe what you are really looking for is speed - you want to skip those login pages you might otherwise have to visit many times a day. If your computer is in safe hands and the websites are low risk (ones not connected to a credit card), you can store your logins with both password management and cookies. \n</p>\n<div class=\"note\"><strong>Note:</strong> No matter what method you use to sign in, you should always make sure you sign in on a secure page. To learn more about how to do this, see the article, <a href=\"/en-US/kb/how-do-i-tell-if-my-connection-is-secure\">How do I tell if my connection to a website is secure?</a></div>\n<h1 id=\"w_how-to-manage-your-logins\">How to manage your logins</h1>\n<p>If you would like to change or delete your usernames, passwords or cookies, you can easily do so and here are some articles to show you how:\n</p>\n<ul><li> <a href=\"/en-US/kb/password-manager-remember-delete-edit-logins\">Password Manager - Remember, delete and edit logins and passwords in Firefox</a>\n</li><li> <a href=\"/en-US/kb/edit-or-delete-login-firefox-password-manager\">Edit or delete a login with the Firefox Password Manager</a>\n</li><li> <a href=\"/en-US/kb/clear-cookies-and-site-data-firefox\">Clear cookies and site data in Firefox</a>\n</li></ul>\n<h1 id=\"w_additional-password-management-software\">Additional password management software</h1>\n<p>Here are some password management tools that have extra features and work across multiple browsers, operating systems, and mobile devices:\n</p>\n<ul><li><a href=\"https://www.roboform.com/\">RoboForm</a> completely automates password entering and form filling with one click, which is very efficient for companies and their employees. \n</li><li><a href=\"https://1password.com/\">1Password</a> works exceptionally well with all browsers and stores more than just passwords, such as credit card numbers, bank information, software licenses and user id information.\n</li><li><a href=\"https://www.lastpass.com/\">Lastpass</a> is free and is available for just about every commonly used computing platform, including mobile devices.\n</li></ul>",
  "text": "Did Firefox save my logins? Did this website save them? How do I control what logins are entered automatically on websites? We'll explain how to store your logins so you can control what happens automatically. Table of Contents 1 How to tell where your login will be stored 1.1 Firefox password management 1.2 Cookies 2 Strategies for saving your login information 2.1 Use phrases to create easy to remember passwords 2.2 Use Firefox to manage logins with a Primary Password 2.3 Use Firefox to manage logins without a Primary Password 2.4 Store your logins with both Firefox password management and cookies 3 How to manage your logins 4 Additional password management software How to tell where your login will be stored Your logins may be stored using the Firefox password management feature and also in cookies. See below for the pros and cons of each method. Firefox password management Firefox password management securely stores the usernames and passwords you use to access websites and then automatically fills them in for you the next time you visit. When you enter a username and password Firefox hasn't already stored for a website, Firefox's Remember Password prompt will ask if you want Firefox to remember them. When you click Remember Password, the next time you visit the website, Firefox will automatically log you in to the website. One advantage of using Firefox password management is that it stores all your logins - your usernames and passwords - in one single place. You can find your logins in Firefox and not worry about forgetting where they are. On the other hand, putting all your logins in one place, unprotected, can be risky. Theoretically, someone who has access to your computer could open and view your logins in Firefox and go on an Amazon shopping spree! Fortunately, Firefox lets you use a Primary Password to prevent others from accessing your logins without your permission. Cookies A cookie is a piece of information that a website stores on your computer. Some websites will save your login information on cookies. When you visit a website and check a box that says something like, \"Remember me\", the website will save your login information, such as your username and password or just your username, on a cookie. The next time you visit the website, your computer will send your login cookie back to the website, and you'll be logged in automatically or required to enter your password but not your username to log in. An advantage of using cookies is that they can keep you logged in a website so that you can skip the login page and quickly get to where you want. Facebook and Twitter's cookies will let you do this, for instance. One disadvantage of using cookies is that they will lose your login information whenever you clear your computer's cookies and cache. This could happen by accident if you are trying to fix a problem between your computer and a website. So you would then need to re-enter your login information the next time you visited your favorite websites. Strategies for saving your login information Use phrases to create easy to remember passwords If you want the most secure method for storing your login information, then you should rely on your memory. It's easier than you think. Choose a different login for every website and memorize them. See Choose a strong password for details. Use Firefox to manage logins with a Primary Password Maybe you need some help remembering all of those logins. The next most secure method is to choose a different login for every website , save them in Firefox when prompted and then secure everything with a Primary Password . Use Firefox to manage logins without a Primary Password Perhaps the risk of someone accessing websites with your logins is low — your computer doesn't leave the house, it's connected to a secure network and the people who use it are trusted. In that case, you can just choose a different login for every website , save those logins with the Firefox password management feature and skip the Primary password. Store your logins with both Firefox password management and cookies Maybe what you are really looking for is speed - you want to skip those login pages you might otherwise have to visit many times a day. If your computer is in safe hands and the websites are low risk (ones not connected to a credit card), you can store your logins with both password management and cookies. Note: No matter what method you use to sign in, you should always make sure you sign in on a secure page. To learn more about how to do this, see the article, How do I tell if my connection to a website is secure? How to manage your logins If you would like to change or delete your usernames, passwords or cookies, you can easily do so and here are some articles to show you how: Password Manager - Remember, delete and edit logins and passwords in Firefox Edit or delete a login with the Firefox Password Manager Clear cookies and site data in Firefox Additional password management software Here are some password management tools that have extra features and work across multiple browsers, operating systems, and mobile devices: RoboForm completely automates password entering and form filling with one click, which is very efficient for companies and their employees. 1Password works exceptionally well with all browsers and stores more than just passwords, such as credit card numbers, bank information, software licenses and user id information. Lastpass is free and is available for just about every commonly used computing platform, including mobile devices.",
  "products": [
    "firefox"
  ],
  "topics": [
    "account-management",
    "accounts",
    "passwords-and-sign-in",
    "save-passwords"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 8766,
    "text_bytes": 5581,
    "word_count": 949,
    "downloaded_at": "2025-08-26T10:35:40.306863"
  }
}