{
  "slug": "xframe-neterror-page",
  "title": "Fix error “Website will not allow Firefox to display the page.”",
  "summary": "Learn why Firefox may block a page embedded by another site, and what you can do to open it.",
  "url": "https://support.mozilla.org/en-US/kb/xframe-neterror-page",
  "html": "<p>Some websites don’t allow their content to appear inside another website. If a site tries to embed a page that blocks this, Firefox will show an error that it cannot open the page:\n</p>\n<div class=\"warning\"><strong>“To protect your security, <em>[website]</em> will not allow Firefox to display the page if another site has embedded it.”</strong></div>\n<p>This is a security feature on the website being embedded. It prevents <a href=\"https://en.wikipedia.org/wiki/Clickjacking\">clickjacking</a>, where a site tries to load another site without permission, often to trick users into clicking something they didn’t intend.\n</p><p>This error is not caused by Firefox. It’s a choice made by the website owner.\n</p>\n<h1 id=\"w_why-does-this-happen\">Why does this happen?</h1>\n<p>Websites can control how their content is used. They may block it from being shown inside another site using special security settings like:\n</p>\n<ul><li><a href=\"https://developer.mozilla.org/docs/Web/HTTP/Headers/X-Frame-Options\">X-Frame options headers</a>\n</li><li><a href=\"https://developer.mozilla.org/docs/Web/HTTP/CSP\">Content security policy rules</a>\n</li></ul>\n<p>These settings are common for banking sites, schools, government services and others that need tight security.\n</p>\n<h1 id=\"w_what-can-i-do\">What can I do?</h1>\n<p>You can still view the blocked content by opening it directly.\n</p>\n<h2 id=\"w_on-desktop\">On desktop</h2>\n<ol><li>Right-click the link or embedded area.\n</li><li>Select <span class=\"button\">Open Link in New Tab</span> or <span class=\"button\">Open Link in New Window</span>.\n</li><li>If you can’t right-click, try copying the link (long-press on Mac trackpads) and pasting it into a new tab.\n</li></ol>\n<div class=\"note\"><strong>Tip:</strong> You can also drag the link into a new tab if using Firefox on desktop.</div>\n<h2 id=\"w_on-mobile-phone-or-tablet\">On mobile (phone or tablet)</h2>\n<ol><li>Tap and hold the link or embedded area (where the content should appear).\n</li><li>Choose <span class=\"button\">Open in New Tab</span> from the menu.\n</li><li>If that doesn’t work, try copying the link (if visible) and pasting it into a new tab manually.\n</li></ol>\n<div class=\"warning\"><strong>Warning:</strong> On mobile, this may be harder to do if the embedded content doesn’t show clearly. Look for a blank or gray box on the page.</div>\n<h1 id=\"w_what-if-i-need-to-use-the-original-page\">What if I need to use the original page?</h1>\n<p>Sometimes the website that’s embedding the content depends on that embedded page to work properly (for example, a school login system or internal portal).\n</p><p>If that’s the case:\n</p>\n<ul><li>Try opening the embedded page directly (as described above).\n</li><li>If that doesn’t help, you may need to contact the site owner and explain the issue.\n</li></ul>\n<h1 id=\"w_need-help-understanding-this-error\">Need help understanding this error?</h1>\n<p>If you're unsure what the page is trying to load or can’t figure out where to click:\n</p>\n<ul><li>Look for a blank box or missing content; that’s likely where the blocked page should appear.\n</li><li>If you're on mobile, try rotating your device or zooming out to better view hidden content.\n</li><li>Still stuck? Copy the page link and share it with your IT support, teacher or website admin.\n</li></ul>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/firefox-stuck-troubleshoot-mode\">Firefox is stuck in Troubleshoot Mode</a>\n</li><li><a href=\"/en-US/kb/websites-look-wrong-or-appear-differently\">Websites look wrong or appear differently than they should</a>\n</li><li><a href=\"/en-US/kb/site-permissions-panel\">Site Permissions panel</a>\n</li></ul>",
  "text": "Some websites don’t allow their content to appear inside another website. If a site tries to embed a page that blocks this, Firefox will show an error that it cannot open the page: “To protect your security, [website] will not allow Firefox to display the page if another site has embedded it.” This is a security feature on the website being embedded. It prevents clickjacking , where a site tries to load another site without permission, often to trick users into clicking something they didn’t intend. This error is not caused by Firefox. It’s a choice made by the website owner. Why does this happen? Websites can control how their content is used. They may block it from being shown inside another site using special security settings like: X-Frame options headers Content security policy rules These settings are common for banking sites, schools, government services and others that need tight security. What can I do? You can still view the blocked content by opening it directly. On desktop Right-click the link or embedded area. Select Open Link in New Tab or Open Link in New Window . If you can’t right-click, try copying the link (long-press on Mac trackpads) and pasting it into a new tab. Tip: You can also drag the link into a new tab if using Firefox on desktop. On mobile (phone or tablet) Tap and hold the link or embedded area (where the content should appear). Choose Open in New Tab from the menu. If that doesn’t work, try copying the link (if visible) and pasting it into a new tab manually. Warning: On mobile, this may be harder to do if the embedded content doesn’t show clearly. Look for a blank or gray box on the page. What if I need to use the original page? Sometimes the website that’s embedding the content depends on that embedded page to work properly (for example, a school login system or internal portal). If that’s the case: Try opening the embedded page directly (as described above). If that doesn’t help, you may need to contact the site owner and explain the issue. Need help understanding this error? If you're unsure what the page is trying to load or can’t figure out where to click: Look for a blank box or missing content; that’s likely where the blocked page should appear. If you're on mobile, try rotating your device or zooming out to better view hidden content. Still stuck? Copy the page link and share it with your IT support, teacher or website admin. Related articles Firefox is stuck in Troubleshoot Mode Websites look wrong or appear differently than they should Site Permissions panel",
  "products": [
    "firefox",
    "mobile"
  ],
  "topics": [
    "error-codes",
    "performance-and-connectivity",
    "site-breakages"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3685,
    "text_bytes": 2545,
    "word_count": 445,
    "downloaded_at": "2025-08-26T10:53:10.407196"
  }
}