{
  "slug": "about-picture-picture-firefox",
  "title": "About Picture-in-Picture in Firefox",
  "summary": "The Picture-in-Picture feature allows you to pop videos out of their webpage, so you can watch while continuing to work in other tabs.",
  "url": "https://support.mozilla.org/en-US/kb/about-picture-picture-firefox",
  "html": "<p>With Picture-in-Picture, you can effortlessly detach videos from their webpages and enjoy them in floating, always-on-top windows. This lets you continue working in other tabs while still keeping an eye on your videos.\n</p><p>Picture-in-Picture offers incredible flexibility – you can open multiple video windows and easily adjust their positions and sizes to match your preferences. Whether you're learning from educational content, enjoying entertainment, or following online tutorials, Picture-in-Picture simplifies video playback with essential controls like play, pause, mute, skip and full-screen options – all accessible without leaving your current tab. Seamlessly multitask with Picture-in-Picture in Firefox, enhancing productivity and engagement. This article will guide you through its various functionalities and usage, empowering you to optimize your video viewing experience.\n</p>\n<dl><dt><img alt=\"PiP_video\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-05-25-06-31-32-22233c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_how-to-use-picture-in-picture\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">How to use Picture-in-Picture</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_on-screen-video-toggle\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">On-screen video toggle</span></a><ul><li class=\"toclevel-3\"><a href=\"#w_change-the-position-of-the-toggle\"><span class=\"tocnumber\">1.1.1</span> <span class=\"toctext\">Change the position of the toggle</span></a></li></ul></li><li class=\"toclevel-2\"><a href=\"#w_launch-picture-in-picture-from-the-address-bar\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Launch Picture-in-Picture from the address bar</span></a></li><li class=\"toclevel-2\"><a href=\"#w_launch-picture-in-picture-from-the-right-click-menu\"><span class=\"tocnumber\">1.3</span> <span class=\"toctext\">Launch Picture-in-Picture from the right-click menu</span></a></li><li class=\"toclevel-2\"><a href=\"#w_subtitles-and-captions\"><span class=\"tocnumber\">1.4</span> <span class=\"toctext\">Subtitles and captions</span></a></li><li class=\"toclevel-2\"><a href=\"#w_keyboard-shortcuts\"><span class=\"tocnumber\">1.5</span> <span class=\"toctext\">Keyboard shortcuts</span></a></li><li class=\"toclevel-2\"><a href=\"#w_common-questions\"><span class=\"tocnumber\">1.6</span> <span class=\"toctext\">Common Questions</span></a><ul><li class=\"toclevel-3\"><a href=\"#w_how-do-i-disable-picture-in-picture\"><span class=\"tocnumber\">1.6.1</span> <span class=\"toctext\">How do I disable Picture-in-Picture?</span></a></li><li class=\"toclevel-3\"><a href=\"#w_why-dont-i-see-the-picture-in-picture-toggle\"><span class=\"tocnumber\">1.6.2</span> <span class=\"toctext\">Why don't I see the Picture-in-Picture toggle?</span></a></li></ul></li></ul></li></ul></div>\n<h1 id=\"w_how-to-use-picture-in-picture\">How to use Picture-in-Picture</h1>\n<h2 id=\"w_on-screen-video-toggle\">On-screen video toggle</h2>\n<p>The Picture-in-Picture toggle becomes visible when you hover your mouse cursor over videos.\n</p><p>Picture-in-picture toggle before your first click on it:\n</p>\n<dl><dt><img alt=\"PiP_video_toggle\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-05-25-06-33-33-a48e1f.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>And after your first click on it:\n</p>\n<dl><dt><img alt=\"PiP_video_toggle_icon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-05-25-06-34-56-3eda1a.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>By clicking the toggle, the underlying video will open in the Picture-in-Picture player window, providing you with a seamless viewing experience.\n</p>\n<h3 id=\"w_change-the-position-of-the-toggle\">Change the position of the toggle</h3>\n<p>Right-click the icon and then click <span class=\"menu\">Move Picture-in-Picture Toggle to Left Side</span> to move the icon to the opposite side of the video.\n</p>\n<div class=\"note\"><strong>Note:</strong> The toggle doesn't appear when a video is on full screen.</div>\n<h2 id=\"w_launch-picture-in-picture-from-the-address-bar\">Launch Picture-in-Picture from the address bar</h2>\n<p>Starting in <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 116, you can easily launch Picture-in-Picture when visiting pages with a single video. Simply locate the icon positioned on the right-hand side of the address bar to activate this feature. This icon works hand in hand with the on-screen video toggle, and you'll find it exclusively on pages containing one video. For pages with multiple or no videos, the icon remains hidden.\n</p>\n<dl><dt><img alt=\"Pip in address bar\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-07-26-13-22-06-943359.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<h2 id=\"w_launch-picture-in-picture-from-the-right-click-menu\">Launch Picture-in-Picture from the right-click menu</h2>\n<p>Another way to access Picture-in-Picture is via the right-click menu. Simply right-click a video for option to play, mute, speed and more.\n</p>\n<dl><dt><img alt=\"PiP_contextMenu\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-05-25-06-37-59-4d7491.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div class=\"note\">\n<p><strong>Note:</strong> Some sites might make it challenging to access the context menu for web videos. For instance, YouTube overrides the default context menu with its own custom options.\n</p><p><strong>Tip:</strong> To reach the default native context menu, you have two options. You can either hold down the <span class=\"key\">Shift</span> key while right-clicking, or you can perform a double right-click.\n</p>\n</div>\n<p>Additionally, when a video is in full-screen mode, the Picture-in-Picture menu item won't be available in the context menu. To switch to Picture-in-Picture, you'll need to exit full screen and use either the toggle or the context menu. Remember, the keyboard shortcut for Picture-in-Picture still functions even in full-screen mode.\n</p>\n<h2 id=\"w_subtitles-and-captions\">Subtitles and captions</h2>\n<p>If you are using subtitles and captions while watching videos on the supported websites, they will also be viewable in Picture-in-Picture. Just turn on the subtitles or captions on the in-page video player before launching the Picture-in-Picture option, so they can appear automatically.\n</p>\n<div class=\"note\"><strong>Note:</strong> Subtitles and captions for Picture-in-Picture are available on: YouTube, Netflix, Disney+, Amazon Prime Video, Funimation, Dailymotion, Khan Academy, BBC.co.uk, Washington Post, Nebula, Tubi, Hotstar and SonyLIV – plus websites that support <a href=\"https://www.w3.org/TR/webvtt1\">WebVTT format</a> like Coursera and Twitter. We’re working to expand the feature to more sites.</div>\n<h2 id=\"w_keyboard-shortcuts\">Keyboard shortcuts</h2>\n<p><span class=\"for\" data-for=\"win,linux\">To access via the keyboard, press the combination <span class=\"key\">Ctrl</span> + <span class=\"key\">Shift</span> + <span class=\"key\">]</span>. Firefox will attempt to launch the most relevant video on the page into a Picture-in-Picture window, or will close it if already open.</span><span class=\"for\" data-for=\"mac\">To access via the keyboard, press the combination <span class=\"key\">Command</span> + <span class=\"key\">Shift</span> + <span class=\"key\">Option</span> + <span class=\"key\">]</span>. Firefox will attempt to launch the most relevant video on the page into a Picture-in-Picture window.</span>\n</p><p>The following shortcuts are available for playback and volume controls:\n</p>\n<ul><li><span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Ctrl</span> + <span class=\"key\">↓</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Command</span> + <span class=\"key\">↓</span></span>: Mute\n</li><li><span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Ctrl</span> + <span class=\"key\">↑</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Command</span> + <span class=\"key\">↑</span></span>: Unmute\n</li><li><span class=\"key\">↓</span>: Volume decrease\n</li><li><span class=\"key\">↑</span>: Volume increase\n</li><li><span class=\"key\">←</span>: Seek back 5 seconds\n</li><li><span class=\"key\">→</span>: Seek forward 5 seconds\n</li><li><span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Ctrl</span> + <span class=\"key\">←</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Command</span> + <span class=\"key\">←</span></span>: Seek back 10%\n</li><li><span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Ctrl</span> + <span class=\"key\">→</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Command</span> + <span class=\"key\">→</span></span>: Seek forward 10%\n</li><li><span class=\"key\">Home</span>: Seek to beginning of video\n</li><li><span class=\"key\">End</span>: Seek to end of video\n</li><li><span class=\"key\">Space</span>: Pause/Continue\n</li><li>Double-click or <span class=\"key\">F</span>: Enter or exit full-screen mode\n</li><li><span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Ctrl</span> + <span class=\"key\">W</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Command</span> + <span class=\"key\">W</span></span>: Close Picture-in-Picture window\n</li></ul>\n<h2 id=\"w_common-questions\">Common Questions</h2>\n<h3 id=\"w_how-do-i-disable-picture-in-picture\">How do I disable Picture-in-Picture?</h3>\n<p>You can tailor your Picture-in-Picture experience by disabling the toggle from appearing over videos. This can be done either through the Picture-in-Picture toggle directly or by making changes in the settings.\n</p>\n<ul><li><strong>Enabling/disabling from the toggle:</strong>\n<ol><li>Find a video where you can see the Picture-in-Picture toggle.\n</li><li>Right-click the toggle.\n</li><li>Click <span class=\"menu\">Hide Picture-in-Picture Toggle</span> in the menu that appears.\n<dl><dt><img alt=\"hidePiP_button\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-05-25-06-44-57-17af37.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n</li><li><strong>Enabling/disabling from the Settings panel:</strong><br>If you don’t want to see the controls while hovering, you can hide that option in Firefox Settings. (Note: You can still turn on Picture-in-Picture by right-clicking on a video.) You can also use this to re-enable the control when you want to use it again.\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>In the <span class=\"menu\">General</span> panel, scroll down to the <em>Browsing</em> section.\n</li><li>Uncheck the box next to <strong>Enable picture-in-picture video controls</strong>.\n<dl><dt><img alt=\"Fx115settings-TurnOffPIP\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-08-20-15-44-28-fea951.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n</li></ul>\n<p>If you want to re-enable the controls later, simply add back the check mark.\n</p>\n<h3 id=\"w_why-dont-i-see-the-picture-in-picture-toggle\">Why don't I see the Picture-in-Picture toggle?</h3>\n<ul><li>The toggle only appears for videos that are longer than 45 seconds and that include an audio track.\n</li><li>The toggle doesn't appear when a video is on full screen.\n</li><li>Developers can also opt to exclude the Picture-in-Picture button from videos hosted on their domains and inform users that the Picture-in-Picture experience might not be the best fit for their website. In such cases, Firefox will display a notification indicating that Picture-in-Picture is not recommended for that particular website. However, you retain full control and can override this recommendation by activating the <strong>Enable anyway</strong> option. This empowers you to choose to use Picture-in-Picture, even if the developer discourages it.\n<dl><dt><img alt=\"Pip disabled disclaimer (no typo)\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-05-05-00-49-04-643fd3.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"350\">\n</dt></dl>\n</li></ul>\n<p>\n</p>",
  "text": "With Picture-in-Picture, you can effortlessly detach videos from their webpages and enjoy them in floating, always-on-top windows. This lets you continue working in other tabs while still keeping an eye on your videos. Picture-in-Picture offers incredible flexibility – you can open multiple video windows and easily adjust their positions and sizes to match your preferences. Whether you're learning from educational content, enjoying entertainment, or following online tutorials, Picture-in-Picture simplifies video playback with essential controls like play, pause, mute, skip and full-screen options – all accessible without leaving your current tab. Seamlessly multitask with Picture-in-Picture in Firefox, enhancing productivity and engagement. This article will guide you through its various functionalities and usage, empowering you to optimize your video viewing experience. Table of Contents 1 How to use Picture-in-Picture 1.1 On-screen video toggle 1.1.1 Change the position of the toggle 1.2 Launch Picture-in-Picture from the address bar 1.3 Launch Picture-in-Picture from the right-click menu 1.4 Subtitles and captions 1.5 Keyboard shortcuts 1.6 Common Questions 1.6.1 How do I disable Picture-in-Picture? 1.6.2 Why don't I see the Picture-in-Picture toggle? How to use Picture-in-Picture On-screen video toggle The Picture-in-Picture toggle becomes visible when you hover your mouse cursor over videos. Picture-in-picture toggle before your first click on it: And after your first click on it: By clicking the toggle, the underlying video will open in the Picture-in-Picture player window, providing you with a seamless viewing experience. Change the position of the toggle Right-click the icon and then click Move Picture-in-Picture Toggle to Left Side to move the icon to the opposite side of the video. Note: The toggle doesn't appear when a video is on full screen. Launch Picture-in-Picture from the address bar Starting in Firefox version 116, you can easily launch Picture-in-Picture when visiting pages with a single video. Simply locate the icon positioned on the right-hand side of the address bar to activate this feature. This icon works hand in hand with the on-screen video toggle, and you'll find it exclusively on pages containing one video. For pages with multiple or no videos, the icon remains hidden. Launch Picture-in-Picture from the right-click menu Another way to access Picture-in-Picture is via the right-click menu. Simply right-click a video for option to play, mute, speed and more. Note: Some sites might make it challenging to access the context menu for web videos. For instance, YouTube overrides the default context menu with its own custom options. Tip: To reach the default native context menu, you have two options. You can either hold down the Shift key while right-clicking, or you can perform a double right-click. Additionally, when a video is in full-screen mode, the Picture-in-Picture menu item won't be available in the context menu. To switch to Picture-in-Picture, you'll need to exit full screen and use either the toggle or the context menu. Remember, the keyboard shortcut for Picture-in-Picture still functions even in full-screen mode. Subtitles and captions If you are using subtitles and captions while watching videos on the supported websites, they will also be viewable in Picture-in-Picture. Just turn on the subtitles or captions on the in-page video player before launching the Picture-in-Picture option, so they can appear automatically. Note: Subtitles and captions for Picture-in-Picture are available on: YouTube, Netflix, Disney+, Amazon Prime Video, Funimation, Dailymotion, Khan Academy, BBC.co.uk, Washington Post, Nebula, Tubi, Hotstar and SonyLIV – plus websites that support WebVTT format like Coursera and Twitter. We’re working to expand the feature to more sites. Keyboard shortcuts To access via the keyboard, press the combination Ctrl + Shift + ] . Firefox will attempt to launch the most relevant video on the page into a Picture-in-Picture window, or will close it if already open. To access via the keyboard, press the combination Command + Shift + Option + ] . Firefox will attempt to launch the most relevant video on the page into a Picture-in-Picture window. The following shortcuts are available for playback and volume controls: Ctrl + ↓ Command + ↓ : Mute Ctrl + ↑ Command + ↑ : Unmute ↓ : Volume decrease ↑ : Volume increase ← : Seek back 5 seconds → : Seek forward 5 seconds Ctrl + ← Command + ← : Seek back 10% Ctrl + → Command + → : Seek forward 10% Home : Seek to beginning of video End : Seek to end of video Space : Pause/Continue Double-click or F : Enter or exit full-screen mode Ctrl + W Command + W : Close Picture-in-Picture window Common Questions How do I disable Picture-in-Picture? You can tailor your Picture-in-Picture experience by disabling the toggle from appearing over videos. This can be done either through the Picture-in-Picture toggle directly or by making changes in the settings. Enabling/disabling from the toggle: Find a video where you can see the Picture-in-Picture toggle. Right-click the toggle. Click Hide Picture-in-Picture Toggle in the menu that appears. Enabling/disabling from the Settings panel: If you don’t want to see the controls while hovering, you can hide that option in Firefox Settings. (Note: You can still turn on Picture-in-Picture by right-clicking on a video.) You can also use this to re-enable the control when you want to use it again. In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the General panel, scroll down to the Browsing section. Uncheck the box next to Enable picture-in-picture video controls . If you want to re-enable the controls later, simply add back the check mark. Why don't I see the Picture-in-Picture toggle? The toggle only appears for videos that are longer than 45 seconds and that include an audio track. The toggle doesn't appear when a video is on full screen. Developers can also opt to exclude the Picture-in-Picture button from videos hosted on their domains and inform users that the Picture-in-Picture experience might not be the best fit for their website. In such cases, Firefox will display a notification indicating that Picture-in-Picture is not recommended for that particular website. However, you retain full control and can override this recommendation by activating the Enable anyway option. This empowers you to choose to use Picture-in-Picture, even if the developer discourages it.",
  "products": [
    "firefox"
  ],
  "topics": [
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 13845,
    "text_bytes": 6620,
    "word_count": 1042,
    "downloaded_at": "2025-08-26T10:52:54.828783"
  }
}