{
  "slug": "access-toolbar-functions-using-keyboard",
  "title": "Access toolbar functions using the keyboard",
  "summary": "Use your keyboard to access add-on buttons on the toolbar, as well as perform other toolbar functions not previously available via the keyboard.",
  "url": "https://support.mozilla.org/en-US/kb/access-toolbar-functions-using-keyboard",
  "html": "<p>In Firefox, you can use the keyboard to access your add-on buttons on the toolbar, as well as perform other toolbar functions that were not previously available via your keyboard.\n</p>\n<h1 id=\"w_to-access-toolbar-buttons\">To access toolbar buttons</h1>\n<ol><li> Press the <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Control</span> + <span class=\"key\">L</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">command</span> + <span class=\"key\">L</span></span> keys to move to the address bar. \n</li><li> Use the <span class=\"key\">Tab</span> and <span class=\"key\">Shift</span> + <span class=\"key\">Tab</span> keys to move between various major groups of buttons in the toolbars<span class=\"for\" data-for=\"fx103\">, including the tab bar</span>.\n</li><li>Once you reach the desired group, you can use the right and left arrow keys to move through the buttons in that group. This allows you to quickly and efficiently find the button that you want.\n</li><li> Press the <span class=\"key\">Space</span> or <span class=\"key\">Enter</span> key to activate the desired toolbar button once you reach it.\n</li><li> Press the <span class=\"key\">F6</span> key to quickly return to the web page from the toolbar.\n</li></ol>\n<div class=\"for\" data-for=\"win\"><div class=\"note\"><strong>Windows tip:</strong> Alternatively, you can press the menu key or <span class=\"key\">Shift</span> + <span class=\"key\">F10</span> to access the context menu for the button, which is equivalent to clicking the right button on your mouse.</div></div>\n<h1 id=\"w_disabling-this-feature\">Disabling this feature</h1>\n<p>If you have become accustomed to using <span class=\"key\">Tab</span> to move between the URL bar and Search bar, skipping over buttons in between, you can restore the earlier behavior through the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a>. </p><div class=\"warning\"><strong>Warning:</strong> These instructions are for experienced Firefox users. Changing settings in the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a> (<em>about:config</em>) can have serious effects on your browser’s stability, security and performance.\n<br><strong>Only proceed if you are comfortable with advanced settings and understand the potential impacts</strong>.</div>\n<p></p>\n<h2 id=\"w_to-restore-the-earlier-tab-key-behavior\">To restore the earlier Tab key behavior</h2>\n<ol><li> Type <strong>about:config</strong> in the <a href=\"/en-US/kb/search-firefox-address-bar\">address bar</a> and press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>.<br>A warning page may appear. Click <span class=\"button\">Accept the Risk and Continue</span> to go to the <em>about:config</em> page.\n\n</li><li> Search for <span class=\"pref\">browser.toolbars.keyboard_navigation</span>.\n</li><li> Click the <em>Toggle</em> <img alt=\"Fx71aboutconfig-ToggleButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-29-08-56-36-b0ab10.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button next to the preference to switch its value to <span class=\"pref\">false</span>.\n</li><li> Close the <em>about:config</em> tab.\n</li></ol>",
  "text": "In Firefox, you can use the keyboard to access your add-on buttons on the toolbar, as well as perform other toolbar functions that were not previously available via your keyboard. To access toolbar buttons Press the Control + L command + L keys to move to the address bar. Use the Tab and Shift + Tab keys to move between various major groups of buttons in the toolbars , including the tab bar . Once you reach the desired group, you can use the right and left arrow keys to move through the buttons in that group. This allows you to quickly and efficiently find the button that you want. Press the Space or Enter key to activate the desired toolbar button once you reach it. Press the F6 key to quickly return to the web page from the toolbar. Windows tip: Alternatively, you can press the menu key or Shift + F10 to access the context menu for the button, which is equivalent to clicking the right button on your mouse. Disabling this feature If you have become accustomed to using Tab to move between the URL bar and Search bar, skipping over buttons in between, you can restore the earlier behavior through the Configuration Editor . Warning: These instructions are for experienced Firefox users. Changing settings in the Configuration Editor ( about:config ) can have serious effects on your browser’s stability, security and performance. Only proceed if you are comfortable with advanced settings and understand the potential impacts . To restore the earlier Tab key behavior Type about:config in the address bar and press Enter Return . A warning page may appear. Click Accept the Risk and Continue to go to the about:config page. Search for browser.toolbars.keyboard_navigation . Click the Toggle button next to the preference to switch its value to false . Close the about:config tab.",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3393,
    "text_bytes": 1793,
    "word_count": 309,
    "downloaded_at": "2025-08-26T10:47:33.609347"
  }
}