{
  "slug": "addons-restricted-domains",
  "title": "Why aren’t my add-ons working on some websites?",
  "summary": "Learn why some Firefox extensions have been disabled on certain websites, how to manage these limits, and explore alternative solutions.",
  "url": "https://support.mozilla.org/en-US/kb/addons-restricted-domains",
  "html": "<p>Certain Firefox users may come across a desktop notification indicating that their add-ons have been disabled for particular websites. In <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox versions</a> 113, 114 and <a href=\"/en-US/kb/firefox-esr-release-cycle\">ESR</a>, we have introduced a system add-on developed by Mozilla that disables extensions on specific websites for various reasons, including security concerns.\n</p><p>Our team is working continuously to develop this functionality and to provide users the ability to manage these restrictions for each individual add-on in the future.\n</p>\n<h2 id=\"w_how-can-i-re-enable-the-add-ons-that-have-been-disabled\">How can I re-enable the add-ons that have been disabled?</h2>\n<p>We understand that installing add-ons is a user choice and, as with your security, we also take this matter very seriously. If you are aware of the associated risk and still wish to re-enable the add-ons that have been disabled for a website, you can do it from the <a href=\"/en-US/kb/about-config-editor-firefox\">configuration editor</a>:\n</p><div class=\"warning\"><strong>Warning:</strong> These instructions are for experienced Firefox users. Changing settings in the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a> (<em>about:config</em>) can have serious effects on your browser’s stability, security and performance.\n<br><strong>Only proceed if you are comfortable with advanced settings and understand the potential impacts</strong>.</div>\n<p></p>\n<ol><li>Type <strong>about:config</strong> in the <a href=\"/en-US/kb/search-firefox-address-bar\">address bar</a> and press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>.<br>A warning page may appear. Click <span class=\"button\">Accept the Risk and Continue</span> to go to the <em>about:config</em> page.\n\n</li><li>Type <span class=\"pref\">extensions.webextensions.addons-restricted-domains@mozilla.com.disabled</span> in the Search bar.\n</li><li>In the type of pref section, select <strong>Boolean</strong>.\n</li><li>Click the <span class=\"button\">+</span> sign next to the pref to create it.\n</li><li>Set the value of the pref to <span class=\"pref\">True</span>.\n</li><li>Restart Firefox.\n</li></ol>\n<h2 id=\"w_related-content\">Related content</h2>\n<ul><li><a href=\"/en-US/kb/quarantined-domains\">Why are some add-ons not allowed on sites restricted by Mozilla?</a>\n</li></ul>",
  "text": "Certain Firefox users may come across a desktop notification indicating that their add-ons have been disabled for particular websites. In Firefox versions 113, 114 and ESR , we have introduced a system add-on developed by Mozilla that disables extensions on specific websites for various reasons, including security concerns. Our team is working continuously to develop this functionality and to provide users the ability to manage these restrictions for each individual add-on in the future. How can I re-enable the add-ons that have been disabled? We understand that installing add-ons is a user choice and, as with your security, we also take this matter very seriously. If you are aware of the associated risk and still wish to re-enable the add-ons that have been disabled for a website, you can do it from the configuration editor : Warning: These instructions are for experienced Firefox users. Changing settings in the Configuration Editor ( about:config ) can have serious effects on your browser’s stability, security and performance. Only proceed if you are comfortable with advanced settings and understand the potential impacts . Type about:config in the address bar and press Enter Return . A warning page may appear. Click Accept the Risk and Continue to go to the about:config page. Type extensions.webextensions.addons-restricted-domains@mozilla.com.disabled in the Search bar. In the type of pref section, select Boolean . Click the + sign next to the pref to create it. Set the value of the pref to True . Restart Firefox. Related content Why are some add-ons not allowed on sites restricted by Mozilla?",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2508,
    "text_bytes": 1622,
    "word_count": 257,
    "downloaded_at": "2025-08-26T10:56:00.992461"
  }
}