{
  "slug": "assign-shortcuts-search-engines",
  "title": "Assign shortcuts to search engines",
  "summary": "How to search faster with search shortcuts.",
  "url": "https://support.mozilla.org/en-US/kb/assign-shortcuts-search-engines",
  "html": "<p>In addition to performing general web searches using your default search engine, you can also easily search specific websites directly from the Firefox address bar. You can assign a keyword shortcut to your favorite search engines to make it easier to perform a search.\n</p><p>For example, you might assign <strong>@shopping</strong> to your built-in Amazon search or an abbreviated search engine name:\n</p>\n<dl><dt><img alt=\"search shortcut populate\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2018-11-26-16-11-31-41e2c7.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div class=\"note\">Popular search engine shortcuts will appear on your new tab page as a tile with a magnifying glass. Clicking on these tiles has the same effect as typing the search shortcut keyword and a space into your address bar.</div>\n<h1 id=\"w_assign-search-shortcuts\">Assign search shortcuts</h1>\n<p>You can assign search shortcuts to your favorite search engines:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Click <span class=\"menu\">Search</span> on the left panel.\n</li><li>Scroll down to <em>Search Shortcuts</em>.\n</li><li>Double-click on the <strong>Keyword</strong> column for the search engine you want to assign a shortcut to.\n</li><li>Enter your search shortcut keyword; for example, <em>youtube</em> (it does not have to begin with <em>@</em>).\n</li><li>Press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>.\n<dl><dt><img alt=\"Fx102AddSearchShortcutKeyword\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-05-28-12-22-30-806f21.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<div class=\"note\"><strong>Note:</strong> Some of the search engines featured above are regionally bound and may not be accessible from every location. To ensure a smooth experience, make sure the search engine you are interested in adding or using is compatible with your region.</div>\n<p>Search shortcut keywords are already included for default search engines, but you can add additional keywords, or you can assign search shortcut keywords to <a href=\"/en-US/kb/add-or-remove-search-engine-firefox\">search engines added to Firefox</a>.\n</p>",
  "text": "In addition to performing general web searches using your default search engine, you can also easily search specific websites directly from the Firefox address bar. You can assign a keyword shortcut to your favorite search engines to make it easier to perform a search. For example, you might assign @shopping to your built-in Amazon search or an abbreviated search engine name: Popular search engine shortcuts will appear on your new tab page as a tile with a magnifying glass. Clicking on these tiles has the same effect as typing the search shortcut keyword and a space into your address bar. Assign search shortcuts You can assign search shortcuts to your favorite search engines: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Click Search on the left panel. Scroll down to Search Shortcuts . Double-click on the Keyword column for the search engine you want to assign a shortcut to. Enter your search shortcut keyword; for example, youtube (it does not have to begin with @ ). Press Enter Return . Note: Some of the search engines featured above are regionally bound and may not be accessible from every location. To ensure a smooth experience, make sure the search engine you are interested in adding or using is compatible with your region. Search shortcut keywords are already included for default search engines, but you can add additional keywords, or you can assign search shortcut keywords to search engines added to Firefox .",
  "products": [
    "firefox"
  ],
  "topics": [
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3202,
    "text_bytes": 1567,
    "word_count": 265,
    "downloaded_at": "2025-08-26T10:46:59.701494"
  }
}