{
  "slug": "avoid-and-report-mozilla-tech-support-scams",
  "title": "Avoid and report Mozilla tech support scams",
  "summary": "Mozilla does not provide telephone support and does not charge for software downloads, upgrades or technical help. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/avoid-and-report-mozilla-tech-support-scams",
  "html": "<p>Mozilla does not provide telephone support, does not charge for downloads, upgrades or technical support and does not endorse any company that does. Companies that ask for payment or personal information for installing, updating or providing support for Firefox or Thunderbird are not affiliated with Mozilla and should be avoided.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_common-technical-support-scams\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Common technical support scams</span></a></li><li class=\"toclevel-1\"><a href=\"#w_protect-yourself-from-scams\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Protect yourself from scams</span></a></li><li class=\"toclevel-1\"><a href=\"#w_report-trademark-violations\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Report trademark violations</span></a></li></ul></div>\n<h1 id=\"w_common-technical-support-scams\">Common technical support scams</h1>\n<ul><li>Virus warnings that tell you to call a phone number, download software or allow a virus scan.\n</li></ul>\n<ul><li>Companies that use Mozilla brand names and logos to charge you for installing, fixing and updating Firefox or Thunderbird.\n</li></ul>\n<ul><li>Phone calls from \"Mozilla representatives\" pressuring you into paying for a service or granting access to your computer.\n</li></ul>\n<p>If you encounter any of these scams, visit the <a href=\"https://www.consumer.ftc.gov/articles/0346-tech-support-scams\">Federal Trade Commission (USA)</a> or <a href=\"https://www.econsumer.gov/\">Econsumer.gov (international)</a>. \n</p>\n<h1 id=\"w_protect-yourself-from-scams\">Protect yourself from scams</h1>\n<ul><li>Visit the official Mozilla Support site (<a href=\"https://support.mozilla.org\">https://support.mozilla.org</a>) or <a href=\"/en-US/kb/get-community-support\">other recognized resources</a> for all technical support issues. <strong>There are no other Mozilla-endorsed technical support agencies</strong> and any that use the Mozilla name or logos to claim affiliation with Mozilla should be reported <a href=\"https://www.mozilla.org/about/legal/fraud-report/\">here</a>. External links in the support forums on <a href=\"https://support.mozilla.org\">https://support.mozilla.org</a> are vetted by moderators and are safe to visit.\n</li></ul>\n<ul><li>Mozilla does not offer telephone support. Do not call or give information to agents claiming to represent Mozilla.\n</li></ul>\n<ul><li>Download Mozilla software from official sources only. \n<ul><li><a href=\"https://www.mozilla.org/firefox/new/\">Official Firefox download page</a>\n</li><li><a href=\"https://www.thunderbird.net/\">Official Thunderbird download page</a>\n</li><li>When downloading anything with the Firefox logo on your phone or tablet, check the developer information and make sure it really is released by Mozilla.\n</li></ul>\n</li></ul>\n<h1 id=\"w_report-trademark-violations\">Report trademark violations</h1>\n<p>Help stop scammers. If you see others using the Firefox or Thunderbird name or logo to represent Mozilla, <a href=\"https://www.mozilla.org/about/legal/fraud-report/\">submit a fraud report</a>.\n</p>",
  "text": "Mozilla does not provide telephone support, does not charge for downloads, upgrades or technical support and does not endorse any company that does. Companies that ask for payment or personal information for installing, updating or providing support for Firefox or Thunderbird are not affiliated with Mozilla and should be avoided. Table of Contents 1 Common technical support scams 2 Protect yourself from scams 3 Report trademark violations Common technical support scams Virus warnings that tell you to call a phone number, download software or allow a virus scan. Companies that use Mozilla brand names and logos to charge you for installing, fixing and updating Firefox or Thunderbird. Phone calls from \"Mozilla representatives\" pressuring you into paying for a service or granting access to your computer. If you encounter any of these scams, visit the Federal Trade Commission (USA) or Econsumer.gov (international) . Protect yourself from scams Visit the official Mozilla Support site ( https://support.mozilla.org ) or other recognized resources for all technical support issues. There are no other Mozilla-endorsed technical support agencies and any that use the Mozilla name or logos to claim affiliation with Mozilla should be reported here . External links in the support forums on https://support.mozilla.org are vetted by moderators and are safe to visit. Mozilla does not offer telephone support. Do not call or give information to agents claiming to represent Mozilla. Download Mozilla software from official sources only. Official Firefox download page Official Thunderbird download page When downloading anything with the Firefox logo on your phone or tablet, check the developer information and make sure it really is released by Mozilla. Report trademark violations Help stop scammers. If you see others using the Firefox or Thunderbird name or logo to represent Mozilla, submit a fraud report .",
  "products": [
    "firefox",
    "mobile",
    "ios",
    "thunderbird"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3146,
    "text_bytes": 1916,
    "word_count": 292,
    "downloaded_at": "2025-08-26T10:36:35.937728"
  }
}