{
  "slug": "back-your-firefox-installation-folder",
  "title": "Back up your Firefox installation folder",
  "summary": "Learn the steps to back up your Firefox installation folder, if you need to do so.",
  "url": "https://support.mozilla.org/en-US/kb/back-your-firefox-installation-folder",
  "html": "<p>Here’s how to back up your Firefox installation folder on different operating systems, if you need to do so:\n</p>\n<div class=\"note\"><strong>Note:</strong> Backing up your Firefox installation folder is normally not necessary, since your user data and settings are stored in a separate <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile folder</a> location.</div> \n<h1 id=\"w_windows\">Windows</h1>\n<ol><li>Locate your Firefox installation folder. The default location is usually one of the following:\n<ul><li><strong><code>C:\\Program Files\\Mozilla Firefox\\</code></strong><br>for 32-bit Firefox on 32-bit Windows or 64-bit Firefox on 64-bit Windows\n</li><li><strong><code>C:\\Program Files (x86)\\Mozilla Firefox\\</code></strong><br>for 32-bit Firefox on 64-bit Windows\n</li></ul>\n</li><li>Copy your installation folder:\n<dl><dt><ul><li>Ensure Firefox is closed to avoid any file conflicts.\n</li><li>Navigate to the installation folder.\n</li><li>Right-click the Mozilla Firefox folder, and select <span class=\"menu\">Copy</span>.\n</li><li>Paste the folder to a safe location, such as an external drive or cloud storage.\n</li></ul>\n</dt></dl>\n</li></ol>\n<h1 id=\"w_macos\">macOS</h1>\n<ol><li>Locate your Firefox installation folder:\n<dl><dt><ul><li>Open the Applications folder.\n</li><li>Locate the <strong><code>Firefox.app</code></strong> file.\n</li></ul>\n</dt></dl>\n</li><li>Copy your installation folder:\n<dl><dt><ul><li>Ensure Firefox is closed.\n</li><li>Hold the <span class=\"key\">Option</span> key, click and drag <strong><code>Firefox.app</code></strong> to your backup location (for example, an external drive or another folder). Holding <span class=\"key\">Option</span> ensures the app is copied and not moved.\n</li></ul>\n</dt></dl>\n</li></ol>\n<h1 id=\"w_linux\">Linux</h1>\n<ol><li>Locate your Firefox installation folder:\n<dl><dt><ul><li>The installation directory can typically be found in <strong><code>/usr/lib/firefox/</code></strong> or <strong><code>/opt/firefox/</code></strong>. Use the terminal command <strong><code>whereis firefox</code></strong> to confirm the exact location.\n</li></ul>\n</dt></dl>\n</li><li>Copy your installation folder:\n<dl><dt><ul><li>Ensure Firefox is closed.\n</li><li>Use the command line or a file manager with superuser privileges to copy the directory:\n</li></ul>\n</dt></dl>\n<dl><dt><strong><code>sudo cp -r /usr/lib/firefox /path/to/backup/location/</code></strong>\n</dt></dl>\n<dl><dt><ul><li>Replace <strong><code>/usr/lib/firefox</code></strong> with the actual path if it differs on your system and <strong><code>/path/to/backup/location/</code></strong> with your desired backup location.\n</li></ul>\n</dt></dl>\n</li></ol>\n<div class=\"note\">This method will back up the installation files of Firefox, but it won’t include your user profile data, which is stored separately. If you want to restore your exact browser setup – including bookmarks, settings, extensions and other personal data – you’ll also need to back up your Firefox profiles. Refer to <a href=\"/en-US/kb/back-and-restore-information-firefox-profiles\">this article</a> for instructions on backing up your Firefox profile.</div>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/profile-manager-create-remove-switch-firefox-profiles\">Profile Manager - Create, remove or switch Firefox profiles</a>\n</li><li><a href=\"/en-US/kb/uninstall-firefox-from-your-computer\">Uninstall Firefox from your computer</a>\n</li></ul>\n<div class=\"for\" data-for=\"win\">\n<ul><li><a href=\"/en-US/kb/how-install-firefox-windows\">How to install Firefox on Windows</a>\n</li><li><a href=\"/en-US/kb/custom-installation-firefox-on-windows\">Custom installation of Firefox on Windows</a>\n</li></ul>\n</div><div class=\"for\" data-for=\"mac\">\n<ul><li><a href=\"/en-US/kb/how-download-and-install-firefox-mac\">How to download and install Firefox on Mac</a>\n</li></ul>\n</div><div class=\"for\" data-for=\"linux\">\n<ul><li><a href=\"/en-US/kb/install-firefox-linux\">Install Firefox on Linux</a>\n</li></ul>\n</div>",
  "text": "Here’s how to back up your Firefox installation folder on different operating systems, if you need to do so: Note: Backing up your Firefox installation folder is normally not necessary, since your user data and settings are stored in a separate profile folder location. Windows Locate your Firefox installation folder. The default location is usually one of the following: C:\\Program Files\\Mozilla Firefox\\ for 32-bit Firefox on 32-bit Windows or 64-bit Firefox on 64-bit Windows C:\\Program Files (x86)\\Mozilla Firefox\\ for 32-bit Firefox on 64-bit Windows Copy your installation folder: Ensure Firefox is closed to avoid any file conflicts. Navigate to the installation folder. Right-click the Mozilla Firefox folder, and select Copy . Paste the folder to a safe location, such as an external drive or cloud storage. macOS Locate your Firefox installation folder: Open the Applications folder. Locate the Firefox.app file. Copy your installation folder: Ensure Firefox is closed. Hold the Option key, click and drag Firefox.app to your backup location (for example, an external drive or another folder). Holding Option ensures the app is copied and not moved. Linux Locate your Firefox installation folder: The installation directory can typically be found in /usr/lib/firefox/ or /opt/firefox/ . Use the terminal command whereis firefox to confirm the exact location. Copy your installation folder: Ensure Firefox is closed. Use the command line or a file manager with superuser privileges to copy the directory: sudo cp -r /usr/lib/firefox /path/to/backup/location/ Replace /usr/lib/firefox with the actual path if it differs on your system and /path/to/backup/location/ with your desired backup location. This method will back up the installation files of Firefox, but it won’t include your user profile data, which is stored separately. If you want to restore your exact browser setup – including bookmarks, settings, extensions and other personal data – you’ll also need to back up your Firefox profiles. Refer to this article for instructions on backing up your Firefox profile. Related articles Profile Manager - Create, remove or switch Firefox profiles Uninstall Firefox from your computer How to install Firefox on Windows Custom installation of Firefox on Windows How to download and install Firefox on Mac Install Firefox on Linux",
  "products": [
    "firefox"
  ],
  "topics": [
    "backup-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4020,
    "text_bytes": 2343,
    "word_count": 356,
    "downloaded_at": "2025-08-26T10:57:01.939089"
  }
}