{
  "slug": "block-and-unblock-websites-parental-controls-firef",
  "title": "Block and unblock websites with parental controls on Firefox",
  "summary": "This article explains how to block websites or filter website content in Firefox that may be offensive or inappropriate for children.",
  "url": "https://support.mozilla.org/en-US/kb/block-and-unblock-websites-parental-controls-firef",
  "html": "<p>This article explains how to <span class=\"for\" data-for=\"win\">prevent children from using Firefox,</span> block websites or filter website content in Firefox that may be offensive or inappropriate for children.\n</p>\n<h1 id=\"w_parental-controls-and-web-filtering-software\">Parental controls and web filtering software</h1>\n<div class=\"for\" data-for=\"mac,win\"><p>Firefox checks the parental controls on your computer and sets itself to <em>Prefer:Safe</em> mode. This automatically turns on the safety feature on each website your child visits, as long as you have the parental controls active on your computer. \n</p><p>This feature can be turned off only through your password-protected parental settings on your operating system, so your child will not be able to deactivate this feature through the browser.\n</p><p>To turn on parental controls on your computer, please see the support documentation for your operating system or see the following:\n</p><div class=\"for\" data-for=\"win11\">\n<ul><li><a href=\"https://support.microsoft.com/en-us/account-billing/getting-started-with-microsoft-family-safety-b6280c9d-38d7-82ff-0e4f-a6cb7e659344\">Getting started with Microsoft Family Safety</a> at microsoft.com.\n</li></ul>\n</div><div class=\"for\" data-for=\"win10\">\n<ul><li><a href=\"https://support.microsoft.com/help/10551/microsoft-account-set-up-family-after-upgrade=windows-10\">Set up family features on Windows 10</a> at microsoft.com.\n</li></ul>\n</div><div class=\"for\" data-for=\"win8\">\n<ul><li><a href=\"https://support.microsoft.com/kb/2782156\">Set up Family Safety</a> at microsoft.com.\n</li></ul>\n</div><div class=\"for\" data-for=\"win7\">\n<ul><li><a href=\"https://www.howtogeek.com/howto/10524/how-to-use-parental-controls-in-windows-7/\">How To Use Parental Controls in Windows 7</a> at howtogeek.com and <a href=\"https://blogs.msdn.microsoft.com/e7/2009/05/26/safeguarding-windows-7-parental-controls/\">Safeguarding Windows 7 – Parental Controls</a> at microsoft.com.\n</li></ul>\n</div><div class=\"for\" data-for=\"mac\">\n<ul><li><a href=\"https://support.apple.com/guide/mac-help/set-up-family-sharing-mh3d6eb198/12.0/mac/12.0\">Set up Family Sharing on Mac</a> and <a href=\"https://support.apple.com/guide/mac-help/set-up-content-and-privacy-restrictions-mchl8490d51e/mac\">Set up content and privacy restrictions in Screen Time on Mac</a> at apple.com.\n</li></ul>\n</div></div><p><span class=\"for\" data-for=\"win,mac\">In addition to parental controls built into your operating system, third-party software is also available. </span>For a list of web filtering software, see <a href=\"https://wikipedia.org/wiki/Comparison_of_content-control_software_and_providers\">Comparison of content-control software and providers</a> at wikipedia.org.\n</p>\n<h1 id=\"w_web-filtering-extensions-for-firefox\">Web filtering extensions for Firefox</h1>\n<p>This <a href=\"https://addons.mozilla.org/firefox/search?q=parental+control&amp;cat=all\">addons.mozilla.org search for parental control</a> lists several extensions that can provide content blocking.\n</p>\n<div class=\"note\"><strong>Note:</strong> Extensions can be easily disabled by a knowledgeable user and don't work in other browsers.</div>\n<p>\n<br> <br>\n<em><strong>Based on information from <a href=\"http://kb.mozillazine.org/Parental_controls\">Parental controls (mozillaZine KB)</a></strong></em>\n</p>",
  "text": "This article explains how to prevent children from using Firefox, block websites or filter website content in Firefox that may be offensive or inappropriate for children. Parental controls and web filtering software Firefox checks the parental controls on your computer and sets itself to Prefer:Safe mode. This automatically turns on the safety feature on each website your child visits, as long as you have the parental controls active on your computer. This feature can be turned off only through your password-protected parental settings on your operating system, so your child will not be able to deactivate this feature through the browser. To turn on parental controls on your computer, please see the support documentation for your operating system or see the following: Getting started with Microsoft Family Safety at microsoft.com. Set up family features on Windows 10 at microsoft.com. Set up Family Safety at microsoft.com. How To Use Parental Controls in Windows 7 at howtogeek.com and Safeguarding Windows 7 – Parental Controls at microsoft.com. Set up Family Sharing on Mac and Set up content and privacy restrictions in Screen Time on Mac at apple.com. In addition to parental controls built into your operating system, third-party software is also available. For a list of web filtering software, see Comparison of content-control software and providers at wikipedia.org. Web filtering extensions for Firefox This addons.mozilla.org search for parental control lists several extensions that can provide content blocking. Note: Extensions can be easily disabled by a knowledgeable user and don't work in other browsers. Based on information from Parental controls (mozillaZine KB)",
  "products": [
    "firefox"
  ],
  "topics": [
    "customization",
    "privacy-and-security",
    "security",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3339,
    "text_bytes": 1696,
    "word_count": 258,
    "downloaded_at": "2025-08-26T09:04:03.854190"
  }
}