{
  "slug": "block-deceptive-content-and-dangerous-downloads-firefox",
  "title": "Block deceptive content and dangerous downloads in Firefox",
  "summary": "Make sure these settings are enabled to prevent unwanted downloads and block suspicious content on your children's sessions.",
  "url": "https://support.mozilla.org/en-US/kb/block-deceptive-content-and-dangerous-downloads-firefox",
  "html": "<p>Websites you or your children visit may sometimes try to download and install <a href=\"/en-US/kb/troubleshoot-firefox-issues-caused-malware\">malicious software</a> on your computer without your approval. Firefox warns you of these attacks so you can take action against them and block suspicious content before it’s downloaded to your disk. To make sure this protection is enabled visit your Security settings:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Select the <span class=\"menu\">Privacy &amp; Security</span> panel.\n</li><li>Go down to the <em>Security</em> section.\n<dl><dt><img alt=\"Fx89Security-DeceptiveContent\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-07-12-02-36-07-8bccb6.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>Under <em>Deceptive Content and Dangerous Software Protection</em>, make sure the following boxes are checked:\n<ul><li><strong>Block dangerous and deceptive content</strong>: Check this box to block potential malware or content that can trick you into downloading malware or unintentionally entering information.\n<ul><li><strong>Block dangerous downloads</strong>: Blocks potential viruses and other malware.\n</li><li><strong>Warn you about unwanted and uncommon software</strong>: Lets you know if you're about to download potentially unwanted software or uncommon software that may contain a virus or make unexpected changes to your computer.\n</li></ul>\n</li></ul>\n</li></ol>\n<p>When Firefox detects you've entered a suspicious site, it will display a warning in the address bar. If an unwanted, potentially harmful download is detected, a warning message will display in the Downloads panel and Firefox will block the download. To learn more, see <a href=\"/en-US/kb/how-does-phishing-and-malware-protection-work\">How does built-in Phishing and Malware Protection work?</a> and <a href=\"/en-US/kb/where-find-and-manage-downloaded-files-firefox#w_download-protection\">Download protection for downloaded files in Firefox</a>.\n</p>",
  "text": "Websites you or your children visit may sometimes try to download and install malicious software on your computer without your approval. Firefox warns you of these attacks so you can take action against them and block suspicious content before it’s downloaded to your disk. To make sure this protection is enabled visit your Security settings: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select the Privacy & Security panel. Go down to the Security section. Under Deceptive Content and Dangerous Software Protection , make sure the following boxes are checked: Block dangerous and deceptive content : Check this box to block potential malware or content that can trick you into downloading malware or unintentionally entering information. Block dangerous downloads : Blocks potential viruses and other malware. Warn you about unwanted and uncommon software : Lets you know if you're about to download potentially unwanted software or uncommon software that may contain a virus or make unexpected changes to your computer. When Firefox detects you've entered a suspicious site, it will display a warning in the address bar. If an unwanted, potentially harmful download is detected, a warning message will display in the Downloads panel and Firefox will block the download. To learn more, see How does built-in Phishing and Malware Protection work? and Download protection for downloaded files in Firefox .",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2794,
    "text_bytes": 1535,
    "word_count": 245,
    "downloaded_at": "2025-08-26T10:55:27.353143"
  }
}