{
  "slug": "change-program-used-open-email-links",
  "title": "Change the program used to open email links",
  "summary": "Learn how to change the email program that Firefox opens when you click a “mailto” link, or use the “Email Link” and “Email Image” features.",
  "url": "https://support.mozilla.org/en-US/kb/change-program-used-open-email-links",
  "html": "<p>Firefox normally uses your operating system's default mail program to send an email message. This article explains how you can change the program that is launched when you click on:\n</p><div class=\"for\" data-for=\"win,linux\">\n<ul><li> The <span class=\"menu\">Email link…</span> menu item in the Firefox Menu bar <span class=\"menu\">File</span> menu (if the <a href=\"/en-US/kb/restore-menu-bar-firefox\">Menu bar is enabled</a>).\n</li></ul>\n</div><div class=\"for\" data-for=\"mac\">\n<ul><li> The <span class=\"menu\">Mail</span> menu item in the Firefox Menu bar <span class=\"menu\">File</span> menu <span class=\"menu\">Share</span> submenu.\n</li></ul>\n</div>\n<ul><li> The <span class=\"button\">Email Link…</span> toolbar button (if you <a href=\"/en-US/kb/customize-firefox-controls-buttons-and-toolbars\">customize Firefox controls, buttons and toolbars</a>).\n</li><li> The <span class=\"menu\">Email Image…</span> (right-click) context menu item for an image on a web page.\n</li><li> A “mailto” or email link on a web page (such as <strong><a href=\"mailto:email@example.com\">email@example.com</a></strong>).\n</li></ul>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_setting-the-mail-client-used-by-firefox\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Setting the mail client used by Firefox</span></a></li><li class=\"toclevel-1\"><a href=\"#w_setting-your-operating-systems-default-mail-program\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Setting your operating system's default mail program</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_gnome\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Gnome</span></a></li><li class=\"toclevel-2\"><a href=\"#w_kde\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">KDE</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_using-webmail-services\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Using webmail services</span></a></li></ul></div>\n<h1 id=\"w_setting-the-mail-client-used-by-firefox\">Setting the mail client used by Firefox</h1>\n<ol><li> <span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li> In the <span class=\"menu\">General</span> panel, go to the <strong>Applications</strong> section.\n</li><li> Search for the Content Type <strong>mailto</strong> and select it.\n</li><li> Click on the Action column in the mailto row to change the action.\n<dl><dt><img alt=\"Fx100settings-mailto\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-05-26-04-00-33-df18fe.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<ul><li> <strong>Always ask</strong> will prompt you each time you use a mail function for which program or service to use.\n</li><li> <strong>Use &lt;Program&gt; (default)</strong> will automatically launch your operating system's email program (for example, Thunderbird,<span class=\"for\" data-for=\"win,mac\"> Outlook,</span><span class=\"for\" data-for=\"winxp,win7\"> Windows Live Mail</span><span class=\"for\" data-for=\"win8,win10,win11\"> Windows Mail</span><span class=\"for\" data-for=\"mac\"> Mail</span><span class=\"for\" data-for=\"linux\"> Evolution, KMail</span>) to its message composition window. For instructions on how to change your operating system's default e-mail program, see the <a href=\"#w_setting-your-operating-systems-default-mail-program\">next section</a> of this article.\n</li><li> <strong>Use &lt;Webmail&gt;</strong> will open the message composition page for your webmail service (such as Gmail) inside Firefox. For more information about using webmail services, see the <a href=\"#w_using-webmail-services\">Using webmail services</a> section of this article.\n</li><li> <strong>Use other…</strong> will let you specify an external program for Firefox to launch.\n</li><li> <strong>Application Details…</strong> will let you view information about or remove the webmail services that Firefox can use.\n</li></ul>\n</li><li> Close the <span class=\"menu\">Settings</span> page. Any changes you've made will automatically be saved.\n\n</li></ol>\n<div class=\"note\"><strong>Note:</strong> If the <strong>mailto</strong> Content Type is missing, or if action items such as <strong>Use Gmail</strong> are missing, a Firefox Refresh will restore all Content Types and actions to default settings. However, this will remove all customizations, including settings for other content types. See <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">Refresh Firefox - reset add-ons and settings</a> and <a href=\"/en-US/kb/change-firefox-behavior-when-open-file\">Manage file types and download actions in Firefox</a> for more information.</div>\n<h1 id=\"w_setting-your-operating-systems-default-mail-program\">Setting your operating system's default mail program</h1>\n<p>By default, Firefox will use your system's default mail client to send email for the actions listed above. For Thunderbird, see the <a href=\"/en-US/kb/make-thunderbird-default-mail-client\">Make Thunderbird the Default Mail Client</a> article for steps you can take to make it the default mail program. Check the online or in-product documentation for other mail programs.\n</p><p>In general, you can change the default mail program by following these instructions:\n</p><div class=\"for\" data-for=\"win8\">\n<ol><li>Open the <strong>PC Settings</strong> application (press and release the Windows Start button, then click the gear icon).\n</li><li>Select <span class=\"menu\">Search and apps</span> from the sidebar.\n</li><li>Select <span class=\"menu\">Defaults</span> from the sidebar.\n</li><li>Click the icon under the heading <em>Email</em> to show your choices.\n</li><li>Select the email program you want to use.\n</li></ol>\n</div><div class=\"for\" data-for=\"win10\">\n<ol><li>Click the Windows <em>Start</em> button, then click <span class=\"menu\">Settings</span>.\n</li><li>Click the <span class=\"menu\">Apps</span> icon, then click <span class=\"menu\">Default Apps</span> in the list.\n</li><li>Click the icon under the heading <em>Email</em> to show your choices.\n</li><li>Select the email program you want to use.\n</li></ol>\n</div><div class=\"for\" data-for=\"win11\"><p>\n</p>\n<ol><li>Right-click the Windows <em>Start</em> button, then click <span class=\"menu\">Settings</span>.\n</li><li>Click <span class=\"menu\">Apps</span> from the options to the left, then click <span class=\"menu\">Default apps</span>.\n</li><li>Find the email program you want to use in the list of applications and click on it.\n<ul><li>A <em>Set default file types or link types</em> settings page will appear.\n</li></ul>\n</li><li>Underneath a file or link type (for example, <strong>.eml</strong> or <strong>MAILTO</strong>) click on the entry and select the email program you wish to use as the new default.\n</li><li>Do the same for the other file or link type entries.\n</li></ol>\n</div><div class=\"for\" data-for=\"win7\">\n<ol><li> Click the Windows <em>Start</em> button, then click the <strong>Default Programs</strong> item.\n</li><li> Click on <strong>Set your default programs</strong>.\n</li><li> Under <em>Programs</em>, click the email program you'd like to use (e.g., Thunderbird, Windows Live Mail, Outlook).\n</li><li> Click <strong>Set this program as default</strong>.\n</li><li> Click <span class=\"button\">OK</span> at the bottom of the window.\n</li></ol>\n</div><div class=\"for\" data-for=\"winxp\">\n<ol><li> Click the Windows <em>Start</em> button, then click on the <strong>Control Panel</strong> icon to open the <em>Windows Control Panel</em>.\n</li><li> Click the <strong>Add or Remove Programs</strong> icon to open the <em>Add or Remove Programs</em> applet.\n</li><li> On the left side of the window, click the <strong>Set Program Access and Defaults</strong> icon.\n</li><li> In the <em>Access and Defaults</em> window, click on the <strong>Custom</strong> radio button to expand the Custom category.\n</li><li> Underneath <em>Choose a default e-mail program</em>, click the radio button next to the program you want to use (e.g., Thunderbird, Windows Live Mail, Outlook).\n</li><li> Click <span class=\"button\">OK</span> at the bottom of the window.\n</li></ol>\n</div><div class=\"for\" data-for=\"mac\">\n<ol><li> Open the <strong>Mail</strong> application from the <em>Applications</em> folder.\n</li><li> Click on the <span class=\"menu\">Mail</span> menu and select <span class=\"menu\">Preferences</span>.\n</li><li> Click the <span class=\"button\">General</span> button.\n</li><li> Select a new default mail program (e.g., Thunderbird, Outlook).\n</li></ol>\n</div><div class=\"for\" data-for=\"linux\">\n<div class=\"note\"><strong>Note: These instructions are for some common Linux distributions. Your distribution may use a different interface.</strong></div>\n<h2 id=\"w_gnome\">Gnome</h2>\n<p>Distributions that use the Gnome Desktop Environment by default include Ubuntu, openSUSE, Fedora, Red Hat Enterprise Linux and more.\n</p>\n<ol><li> Open the Default Applications (formerly: Preferred Applications) window. The Default (Preferred) Applications window can be opened by:\n<ul><li> <strong>(Ubuntu)</strong> Clicking on the <span class=\"menu\">System</span> menu, selecting <span class=\"menu\">Preferences</span>, and then selecting <span class=\"menu\">Default Applications</span>.\n<ul><li> As of 2018, in <strong>openSUSE</strong> (<strong>GNOME 3.28</strong>) it's under <span class=\"menu\">System</span> menu &gt; <span class=\"menu\">Settings</span> &gt; <span class=\"menu\">Details</span> &gt; <span class=\"menu\">Default Applications</span>.\n</li></ul>\n</li><li> Clicking on the <span class=\"menu\">Applications</span> menu, selecting <span class=\"menu\">Desktop Preferences</span>, then selecting <span class=\"menu\">Advanced</span>, and then selecting <span class=\"menu\">Default Applications</span>.\n</li></ul>\n</li><li> Underneath <em>Mail Reader</em>, use the dropdown menu to select a mail application (e.g., Thunderbird, Evolution).\n</li><li> Click <span class=\"button\">Close</span> to close the <em>Default Applications</em> window.\n</li></ol>\n<h2 id=\"w_kde\">KDE</h2>\n<p>Distributions that use the K Desktop Environment by default include Kubuntu, Mandriva Linux, PCLinuxOS and more.\n</p>\n<ol><li> Open the KDE Control Center by clicking on <span class=\"button\">K</span> and selecting <span class=\"menu\">Control Center</span>.\n</li><li> In the Control Center window, click to expand <strong>KDE Components</strong>.\n</li><li> Click to select <strong>Component Chooser</strong>.\n</li><li> Click to select <strong>Email Client</strong>.\n</li><li> Click to select the <strong>Use a different email client</strong> radio button.\n</li><li> Type the full path to your e-mail client (e.g., <span class=\"filepath\">/usr/bin/thunderbird</span>).\n</li><li> Click <span class=\"button\">Apply</span> to close the <em>Control Center</em> window and save your changes.\n</li></ol>\n</div>\n<h1 id=\"w_using-webmail-services\">Using webmail services</h1>\n<p>Firefox allows you to use a webmail service such as Gmail (called <em>Google Mail</em> in some locales) for Firefox's mail functions. Use the instructions in the <a href=\"#w_setting-the-mail-client-used-by-firefox\">Setting the mail client used by Firefox</a> section above to use a webmail service in Firefox for mailto links or the <em>Email link…</em> feature.\n</p><p>\nIf the webmail service you want to use is not available in your Firefox Settings <span class=\"menu\">General</span> panel's <em>Applications</em> section as a <em>mailto</em> choice, you can try to find an extension that supports it, either by searching <a href=\"https://addons.mozilla.org\">addons.mozilla.org</a> for the specific webmail service or by doing a <a href=\"https://addons.mozilla.org/firefox/search?q=webmail\"><strong>webmail search</strong></a> or a <a href=\"https://addons.mozilla.org/firefox/search?q=mailto\"><strong>mailto search</strong></a> and browsing through the results.\n</p><p>\n<br> <br>\n<em><strong>Based on information from <a href=\"http://kb.mozillazine.org/Default_mail_client\">Default mail client (mozillaZine KB)</a>, <a href=\"http://support.apple.com/kb/HT1637\">How to change the default web browser or email application (Apple.com Support)</a>, <a href=\"http://docs.kde.org/stable/en/kdebase-runtime/userguide/control-center.html\">The KDE Control Center (KDE.org)</a>, <a href=\"http://www.debianadmin.com/select-preferred-applications-in-ubuntu.html\">Select Preferred Applications in Ubuntu (DebianAdmin.com)</a> and <a href=\"https://www.howtogeek.com/770923/how-to-set-your-default-email-app-in-windows-11/\">How to Set Your Default Email App in Windows 11 (howtogeek.com)</a>.</strong></em>\n</p>",
  "text": "Firefox normally uses your operating system's default mail program to send an email message. This article explains how you can change the program that is launched when you click on: The Email link… menu item in the Firefox Menu bar File menu (if the Menu bar is enabled ). The Mail menu item in the Firefox Menu bar File menu Share submenu. The Email Link… toolbar button (if you customize Firefox controls, buttons and toolbars ). The Email Image… (right-click) context menu item for an image on a web page. A “mailto” or email link on a web page (such as email@example.com ). Table of Contents 1 Setting the mail client used by Firefox 2 Setting your operating system's default mail program 2.1 Gnome 2.2 KDE 3 Using webmail services Setting the mail client used by Firefox In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the General panel, go to the Applications section. Search for the Content Type mailto and select it. Click on the Action column in the mailto row to change the action. Always ask will prompt you each time you use a mail function for which program or service to use. Use <Program> (default) will automatically launch your operating system's email program (for example, Thunderbird, Outlook, Windows Live Mail Windows Mail Mail Evolution, KMail ) to its message composition window. For instructions on how to change your operating system's default e-mail program, see the next section of this article. Use <Webmail> will open the message composition page for your webmail service (such as Gmail) inside Firefox. For more information about using webmail services, see the Using webmail services section of this article. Use other… will let you specify an external program for Firefox to launch. Application Details… will let you view information about or remove the webmail services that Firefox can use. Close the Settings page. Any changes you've made will automatically be saved. Note: If the mailto Content Type is missing, or if action items such as Use Gmail are missing, a Firefox Refresh will restore all Content Types and actions to default settings. However, this will remove all customizations, including settings for other content types. See Refresh Firefox - reset add-ons and settings and Manage file types and download actions in Firefox for more information. Setting your operating system's default mail program By default, Firefox will use your system's default mail client to send email for the actions listed above. For Thunderbird, see the Make Thunderbird the Default Mail Client article for steps you can take to make it the default mail program. Check the online or in-product documentation for other mail programs. In general, you can change the default mail program by following these instructions: Open the PC Settings application (press and release the Windows Start button, then click the gear icon). Select Search and apps from the sidebar. Select Defaults from the sidebar. Click the icon under the heading Email to show your choices. Select the email program you want to use. Click the Windows Start button, then click Settings . Click the Apps icon, then click Default Apps in the list. Click the icon under the heading Email to show your choices. Select the email program you want to use. Right-click the Windows Start button, then click Settings . Click Apps from the options to the left, then click Default apps . Find the email program you want to use in the list of applications and click on it. A Set default file types or link types settings page will appear. Underneath a file or link type (for example, .eml or MAILTO ) click on the entry and select the email program you wish to use as the new default. Do the same for the other file or link type entries. Click the Windows Start button, then click the Default Programs item. Click on Set your default programs . Under Programs , click the email program you'd like to use (e.g., Thunderbird, Windows Live Mail, Outlook). Click Set this program as default . Click OK at the bottom of the window. Click the Windows Start button, then click on the Control Panel icon to open the Windows Control Panel . Click the Add or Remove Programs icon to open the Add or Remove Programs applet. On the left side of the window, click the Set Program Access and Defaults icon. In the Access and Defaults window, click on the Custom radio button to expand the Custom category. Underneath Choose a default e-mail program , click the radio button next to the program you want to use (e.g., Thunderbird, Windows Live Mail, Outlook). Click OK at the bottom of the window. Open the Mail application from the Applications folder. Click on the Mail menu and select Preferences . Click the General button. Select a new default mail program (e.g., Thunderbird, Outlook). Note: These instructions are for some common Linux distributions. Your distribution may use a different interface. Gnome Distributions that use the Gnome Desktop Environment by default include Ubuntu, openSUSE, Fedora, Red Hat Enterprise Linux and more. Open the Default Applications (formerly: Preferred Applications) window. The Default (Preferred) Applications window can be opened by: (Ubuntu) Clicking on the System menu, selecting Preferences , and then selecting Default Applications . As of 2018, in openSUSE ( GNOME 3.28 ) it's under System menu > Settings > Details > Default Applications . Clicking on the Applications menu, selecting Desktop Preferences , then selecting Advanced , and then selecting Default Applications . Underneath Mail Reader , use the dropdown menu to select a mail application (e.g., Thunderbird, Evolution). Click Close to close the Default Applications window. KDE Distributions that use the K Desktop Environment by default include Kubuntu, Mandriva Linux, PCLinuxOS and more. Open the KDE Control Center by clicking on K and selecting Control Center . In the Control Center window, click to expand KDE Components . Click to select Component Chooser . Click to select Email Client . Click to select the Use a different email client radio button. Type the full path to your e-mail client (e.g., /usr/bin/thunderbird ). Click Apply to close the Control Center window and save your changes. Using webmail services Firefox allows you to use a webmail service such as Gmail (called Google Mail in some locales) for Firefox's mail functions. Use the instructions in the Setting the mail client used by Firefox section above to use a webmail service in Firefox for mailto links or the Email link… feature. If the webmail service you want to use is not available in your Firefox Settings General panel's Applications section as a mailto choice, you can try to find an extension that supports it, either by searching addons.mozilla.org for the specific webmail service or by doing a webmail search or a mailto search and browsing through the results. Based on information from Default mail client (mozillaZine KB) , How to change the default web browser or email application (Apple.com Support) , The KDE Control Center (KDE.org) , Select Preferred Applications in Ubuntu (DebianAdmin.com) and How to Set Your Default Email App in Windows 11 (howtogeek.com) .",
  "products": [
    "firefox"
  ],
  "topics": [
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 13279,
    "text_bytes": 7276,
    "word_count": 1211,
    "downloaded_at": "2025-08-26T09:04:23.311361"
  }
}