{
  "slug": "change-your-location-specific-website",
  "title": "Change your location for a specific website",
  "summary": "The Mozilla VPN extension allows you to set a particular location through which you want to access a given website. Learn about this feature here.",
  "url": "https://support.mozilla.org/en-US/kb/change-your-location-specific-website",
  "html": "<p>With the Mozilla VPN extension, you can set a particular location through which you want to access a given website. This can be useful when visiting websites whose content depends on the country in which you appear to be located, such as news websites.\n</p><p>When configured, the chosen location will override your default VPN location set in the Mozilla VPN client. Follow this guide to learn how to do this.\n</p>\n<div class=\"note\"><strong>Note:</strong> If you have set a preference to always turn off the VPN for a specific website, ensure that the checkbox next to <em>Always turn off VPN is</em> unchecked. Otherwise, you will not be able to edit your preferences for that website.</div>\n<h1 id=\"w_set-a-specific-location-for-a-website\">Set a specific location for a website</h1>\n<ol><li>Navigate to the desired website on Mozilla Firefox.\n</li><li>In the top right corner of the browser, locate and click the Mozilla VPN extension icon.\n</li><li>Click the arrow under <strong>Select site location</strong> to expand the location selection screen.\n<dl><dt><img alt=\"Select site location option\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-09-11-42-45-f9b935.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"350\">\n</dt></dl>\n</li><li>Browse through the list of available server locations. You can use the search bar at the top to quickly find a specific country or city. Click the location to select it.\n<dl><dt><img alt=\"Location list\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-09-11-43-55-cb9763.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"350\">\n</dt></dl>\n</li><li>The new location will be displayed under <em>Select site location</em>, along with the label <em>In Use</em>, to help highlight that this location will override the currently selected location in the Mozilla VPN client.\n<dl><dt><img alt=\"New location selected\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-09-11-45-46-d90b08.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"350\">\n</dt></dl>\n</li><li>You can confirm the VPN location is set by checking the right-hand side of the URL bar, where the flag of the selected country will be displayed. When you turn on the Mozilla VPN extension from this point forward, it will connect through this location.\n</li></ol>\n<dl><dt><img alt=\"flag icon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-09-11-46-44-327a6c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>To change your current location to a different one, simply repeat the steps above and choose another location from the dropdown list.\n</p>\n<h1 id=\"w_reset-a-websites-location\">Reset a website's location</h1>\n<p>If you’ve set a custom server location for a specific website but no longer need it, resetting the location will revert the site to the default VPN settings. You can remove your stated location preference for a website through any of the following methods:\n</p>\n<h2 id=\"w_method-1-through-the-countrys-icon-in-the-url-bar\">Method 1: Through the country’s icon in the URL bar</h2>\n<ol><li>Go to the website whose preferred location you want to reset.\n</li><li>On the right-hand side of the URL bar, look for the country’s flag.\n<dl><dt><img alt=\"flag icon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-09-11-46-44-327a6c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>Click the flag icon and select <strong>Remove custom location</strong>.\n<dl><dt><img alt=\"Remove custom location url bar\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-09-11-48-31-89347d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"250\">\n</dt></dl>\n</li></ol>\n<h2 id=\"w_method-2-by-resetting-your-site-preferences\">Method 2: By resetting your site preferences</h2>\n<ol><li>Go to the website whose preferred location you want to reset.\n</li><li>In the top right corner of the Mozilla Firefox browser, open the Mozilla VPN extension.\n</li><li>Click <span class=\"button\">Reset site preferences</span>.\n<dl><dt><img alt=\"Reset preferences\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-09-11-50-01-145767.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"350\">\n</dt></dl>\n</li></ol>\n<h2 id=\"w_method-3-by-returning-to-the-default-mozilla-vpn-location\">Method 3: By returning to the default Mozilla VPN location</h2>\n<ol><li>Go to the website whose preferred location you want to reset.\n</li><li>In the top right corner of your Firefox browser, click the Mozilla VPN extension icon.\n</li><li>Under the <em>Select website location</em> section, click the arrow next to the current location.\n</li><li>On the <em>Select Location</em> screen, select the <strong>Use default Mozilla VPN location</strong> option.\n</li><li>By doing this, you are instructing the Mozilla VPN extension to no longer set a preferred location and instead use the location that is used for your entire device, as set by the Mozilla VPN client.\n<dl><dt><img alt=\"Default location\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-09-11-52-00-66f7d2.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"350\">\n</dt></dl>\n</li></ol>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/get-started-mozilla-vpn-extension\">Get started with the Mozilla VPN extension</a>\n</li><li><a href=\"/en-US/kb/disable-vpn-protection-specific-website\">Disable Mozilla VPN protection for a specific website</a>\n</li></ul>",
  "text": "With the Mozilla VPN extension, you can set a particular location through which you want to access a given website. This can be useful when visiting websites whose content depends on the country in which you appear to be located, such as news websites. When configured, the chosen location will override your default VPN location set in the Mozilla VPN client. Follow this guide to learn how to do this. Note: If you have set a preference to always turn off the VPN for a specific website, ensure that the checkbox next to Always turn off VPN is unchecked. Otherwise, you will not be able to edit your preferences for that website. Set a specific location for a website Navigate to the desired website on Mozilla Firefox. In the top right corner of the browser, locate and click the Mozilla VPN extension icon. Click the arrow under Select site location to expand the location selection screen. Browse through the list of available server locations. You can use the search bar at the top to quickly find a specific country or city. Click the location to select it. The new location will be displayed under Select site location , along with the label In Use , to help highlight that this location will override the currently selected location in the Mozilla VPN client. You can confirm the VPN location is set by checking the right-hand side of the URL bar, where the flag of the selected country will be displayed. When you turn on the Mozilla VPN extension from this point forward, it will connect through this location. To change your current location to a different one, simply repeat the steps above and choose another location from the dropdown list. Reset a website's location If you’ve set a custom server location for a specific website but no longer need it, resetting the location will revert the site to the default VPN settings. You can remove your stated location preference for a website through any of the following methods: Method 1: Through the country’s icon in the URL bar Go to the website whose preferred location you want to reset. On the right-hand side of the URL bar, look for the country’s flag. Click the flag icon and select Remove custom location . Method 2: By resetting your site preferences Go to the website whose preferred location you want to reset. In the top right corner of the Mozilla Firefox browser, open the Mozilla VPN extension. Click Reset site preferences . Method 3: By returning to the default Mozilla VPN location Go to the website whose preferred location you want to reset. In the top right corner of your Firefox browser, click the Mozilla VPN extension icon. Under the Select website location section, click the arrow next to the current location. On the Select Location screen, select the Use default Mozilla VPN location option. By doing this, you are instructing the Mozilla VPN extension to no longer set a preferred location and instead use the location that is used for your entire device, as set by the Mozilla VPN client. Related articles Get started with the Mozilla VPN extension Disable Mozilla VPN protection for a specific website",
  "products": [
    "firefox",
    "mozilla-vpn"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6576,
    "text_bytes": 3096,
    "word_count": 535,
    "downloaded_at": "2025-08-26T10:57:35.941413"
  }
}