{
  "slug": "change-website-appearance-settings-firefox",
  "title": "Change website appearance settings in Firefox",
  "summary": "Change Firefox settings to adjust the appearance of the websites you visit.",
  "url": "https://support.mozilla.org/en-US/kb/change-website-appearance-settings-firefox",
  "html": "<p>When you visit a website, its appearance changes to match your browser's theme. If you set a light theme for Firefox in your browser's preferences and then set a dark theme from the <a href=\"/en-US/kb/personalize-firefox-colorways\">colorways</a> palette, colorways will override the light theme and the websites appearance will adjust to match the new dark theme.\n</p><p>You can configure this behavior and choose the color scheme you would like to use for those websites. To access these settings, follow the steps below:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Go to the <span class=\"menu\">General</span> panel on the left.\n</li><li>Scroll down to <em>Language and Appearance</em>.\n</li><li>Select the color scheme you want to use for the websites you visit.\n<dl><dt><span class=\"for\" data-for=\"not fx138\"><img alt=\"gecko_dark_light mode_gif\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-11-05-13-06-55-911af7.gif\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"fx138\"><img alt=\"Fx138settings-LanguageAndAppearance\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-05-09-14-58-53-cf36b0.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</dt></dl>\n</li></ol>\n<p>You can choose from these color schemes:\n</p>\n<ul><li><strong>Automatic:</strong> this option makes websites match the Firefox theme you have selected, whether it's a third-party theme, Alpenglow, colorways, etc.\n</li><li><strong>Light:</strong> this option changes a website’s color scheme to light.\n</li><li><strong>Dark:</strong> this option changes a website's color scheme to dark.\n</li></ul>\n<div class=\"note\"><strong>Note:</strong> Some themes are developed to match light and dark schemes only. In these cases, the appearance of the websites will adjust to match your Firefox theme. However, since most <a href=\"https://addons.mozilla.org/firefox/collections/4757633/colorways/\">colorways themes</a> are not developed to match light or dark schemes specifically, when you select such colorways, the appearance of websites will adjust to match the color scheme of your operating system.</div>\n<h1 id=\"w_common-questions\">Common questions</h1>\n<h2 id=\"w_what-is-the-difference-between-the-operating-systems-appearance-website-appearance-and-browser-themes\">What is the difference between the operating system's appearance, website appearance and browser themes?</h2>\n<ul><li>Your operating system's appearance settings determine how your device's user interface is displayed.\n</li><li>Website appearance refers to the way in which the content of the web pages you visit from your browser is displayed.\n</li><li>Browser themes change the appearance of the browser; for example, the elements that are part of the browser (menus, buttons, tabs, etc.). To learn more, see <a href=\"/en-US/kb/use-themes-change-look-of-firefox\">Use themes to change the look of Firefox</a>.\n</li></ul>\n<h2 id=\"w_are-my-website-appearance-settings-updated-when-i-select-a-new-browser-colorway-or-system-theme\">Are my website appearance settings updated when I select a new browser colorway or system theme?</h2>\n<p>No. You can decide if you want the website appearance to match your Firefox theme, colorway, or operating system. These settings will not change regardless of the colorway or browser theme you select.\n</p>\n<h2 id=\"w_what-happens-if-i-select-custom-colors-in-my-preferences\">What happens if I select custom colors in my preferences?</h2>\n<p>You can also configure website appearance in the <span class=\"for\" data-for=\"not fx138\">Colors</span><span class=\"for\" data-for=\"fx138\">Contrast Control</span> section under <em>Language and Appearance</em> (see <a href=\"/en-US/kb/change-fonts-and-colors-websites-use\">Change the fonts and colors websites use</a> for details). Here you can configure elements such as the text color and background of a website. Some changes you make in this section may override your <em>Language and Appearance</em> settings. If this is the case, a warning notification will alert you of these changes.\n</p><p><img alt=\"Fx106settings-WebsiteAppearance-OverrideWarning\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-12-24-12-24-11-e5030b.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</p><div class=\"for\" data-for=\"not fx138\"><p><strong>This warning notification will only appear in the following cases:</strong>\n</p>\n<ul><li>You have selected <strong>Always</strong> or <strong>Only with High Contrast themes</strong> in the Colors panel and you are in <strong>Windows+HCM (high contrast mode)</strong>.\n</li><li>You have selected <strong>Always</strong> or <strong>Only with High Contrast themes</strong> in the Colors panel and you have unchecked the <strong>Use system colors</strong> checkbox.\n</li></ul>\n</div>\n<h2 id=\"w_how-are-my-website-appearance-settings-affected-when-i-use-my-operating-systems-high-contrast-mode\">How are my website appearance settings affected when I use my operating system's High Contrast mode?</h2>\n<p>High Contrast mode helps to reduce visual fatigue. For this reason, changes to website appearance or custom color settings will not affect the browser when High Contrast mode is enabled, except in the situations described above.\n</p>\n<h2 id=\"w_why-does-firefox-apply-my-selection-of-dark-to-internal-pages-but-websites-always-apply-light\">Why does Firefox apply my selection of Dark to internal pages, but websites always apply Light?</h2>\n<p>This can be caused by enabling the <span class=\"pref\">privacy.resistFingerprinting</span> preference in the <a href=\"/en-US/kb/about-config-editor-firefox\">Advanced Configuration Editor</a>. This feature reduces the ability of sites to detect some less common settings so that your browser appears to be less unique, but as a result, some site customization features can't work as intended. For more information, see <a href=\"/en-US/kb/firefox-protection-against-fingerprinting\">Firefox's protection against fingerprinting</a>.\n</p>",
  "text": "When you visit a website, its appearance changes to match your browser's theme. If you set a light theme for Firefox in your browser's preferences and then set a dark theme from the colorways palette, colorways will override the light theme and the websites appearance will adjust to match the new dark theme. You can configure this behavior and choose the color scheme you would like to use for those websites. To access these settings, follow the steps below: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Go to the General panel on the left. Scroll down to Language and Appearance . Select the color scheme you want to use for the websites you visit. You can choose from these color schemes: Automatic: this option makes websites match the Firefox theme you have selected, whether it's a third-party theme, Alpenglow, colorways, etc. Light: this option changes a website’s color scheme to light. Dark: this option changes a website's color scheme to dark. Note: Some themes are developed to match light and dark schemes only. In these cases, the appearance of the websites will adjust to match your Firefox theme. However, since most colorways themes are not developed to match light or dark schemes specifically, when you select such colorways, the appearance of websites will adjust to match the color scheme of your operating system. Common questions What is the difference between the operating system's appearance, website appearance and browser themes? Your operating system's appearance settings determine how your device's user interface is displayed. Website appearance refers to the way in which the content of the web pages you visit from your browser is displayed. Browser themes change the appearance of the browser; for example, the elements that are part of the browser (menus, buttons, tabs, etc.). To learn more, see Use themes to change the look of Firefox . Are my website appearance settings updated when I select a new browser colorway or system theme? No. You can decide if you want the website appearance to match your Firefox theme, colorway, or operating system. These settings will not change regardless of the colorway or browser theme you select. What happens if I select custom colors in my preferences? You can also configure website appearance in the Colors Contrast Control section under Language and Appearance (see Change the fonts and colors websites use for details). Here you can configure elements such as the text color and background of a website. Some changes you make in this section may override your Language and Appearance settings. If this is the case, a warning notification will alert you of these changes. This warning notification will only appear in the following cases: You have selected Always or Only with High Contrast themes in the Colors panel and you are in Windows+HCM (high contrast mode) . You have selected Always or Only with High Contrast themes in the Colors panel and you have unchecked the Use system colors checkbox. How are my website appearance settings affected when I use my operating system's High Contrast mode? High Contrast mode helps to reduce visual fatigue. For this reason, changes to website appearance or custom color settings will not affect the browser when High Contrast mode is enabled, except in the situations described above. Why does Firefox apply my selection of Dark to internal pages, but websites always apply Light? This can be caused by enabling the privacy.resistFingerprinting preference in the Advanced Configuration Editor . This feature reduces the ability of sites to detect some less common settings so that your browser appears to be less unique, but as a result, some site customization features can't work as intended. For more information, see Firefox's protection against fingerprinting .",
  "products": [
    "firefox"
  ],
  "topics": [
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 7061,
    "text_bytes": 3928,
    "word_count": 643,
    "downloaded_at": "2025-08-26T10:54:58.247681"
  }
}