{
  "slug": "configure-firewalls-so-firefox-can-access-internet",
  "title": "Configure firewalls so that Firefox can access the Internet",
  "summary": "A firewall controls what programs can access the Internet. Find information about configuring your firewall to allow Firefox access to the Internet.",
  "url": "https://support.mozilla.org/en-US/kb/configure-firewalls-so-firefox-can-access-internet",
  "html": "<p>A personal firewall is a security program that oversees all of your computer's connections to the Internet. It may be included as part of an Internet security suite, or it may be a freestanding program. Most personal firewalls will deny Internet access to any program, or a new version of any program, unless you have specifically allowed access. This article will help you find information about configuring your firewall to work with Firefox.\n</p>\n<div class=\"note\"><strong>Note:</strong> In some cases, disabling an Internet security program or firewall does not stop all of its parts from being active. A program that reports that it is disabled may still be able to block Firefox.</div>\n<div class=\"for\" data-for=\"win\">\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_find-out-which-firewall-is-installed\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Find out which firewall is installed</span></a></li><li class=\"toclevel-1\"><a href=\"#w_configuring-firewalls\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Configuring firewalls</span></a></li></ul></div>\n<h1 id=\"w_find-out-which-firewall-is-installed\">Find out which firewall is installed</h1>\n<p>If you know which firewall or Internet security suite you are running, skip to <a href=\"#w_configuring-firewalls\">the next section</a>.\n</p><p>Depending on your Windows version, do the following:\n</p>\n<ul><li> <strong>Windows 10</strong>: Find it in Windows Control Panel, Security and Maintenance under the Security section. \n</li><li> <strong>Windows 7/8</strong>: Find it under the Security section in Windows Action Center.\n</li></ul>\n<p>If you can't still detect your firewall with the above steps, try to run <strong>Enum Process</strong> (<em>not created by Mozilla</em>) that is an application that detects many common firewalls:\n</p>\n<ol><li> Download <a href=\"http://www.trolly.homepage.t-online.de/EnumProcess.exe\">Enum Process</a>.\n</li><li> After downloading, double-click <span class=\"filepath\">EnumProcess.exe</span>.\n</li><li> Select <span class=\"button\">Run</span>.\n</li><li> In the drop-down menu to the right, select <strong>Simple</strong>.<br> <br>The image \"simple_enumprocess.PNG\" does not exist.\n</li><li> Click <span class=\"button\">List Processes</span>.<br> <br>The image \"listprocesses_enumprocess.PNG\" does not exist.\n</li></ol>\n</div>\n<h1 id=\"w_configuring-firewalls\">Configuring firewalls</h1>\n<p><span class=\"for\" data-for=\"win\">For Windows Firewall, see <a href=\"/en-US/kb/configure-windows-firewall-allow-firefox-access\">How to let Firefox use the internet on your Windows computer</a>. Contact the software provider for other installed firewalls.\n</span></p><div class=\"for\" data-for=\"mac\"><p>Refer to the <a href=\"http://support.apple.com/kb/ht1810\">Apple documentation</a>.\n</p></div><div class=\"for\" data-for=\"linux\"><p>Go to your distribution's firewall documentation.\n</p></div>",
  "text": "A personal firewall is a security program that oversees all of your computer's connections to the Internet. It may be included as part of an Internet security suite, or it may be a freestanding program. Most personal firewalls will deny Internet access to any program, or a new version of any program, unless you have specifically allowed access. This article will help you find information about configuring your firewall to work with Firefox. Note: In some cases, disabling an Internet security program or firewall does not stop all of its parts from being active. A program that reports that it is disabled may still be able to block Firefox. Table of Contents 1 Find out which firewall is installed 2 Configuring firewalls Find out which firewall is installed If you know which firewall or Internet security suite you are running, skip to the next section . Depending on your Windows version, do the following: Windows 10 : Find it in Windows Control Panel, Security and Maintenance under the Security section. Windows 7/8 : Find it under the Security section in Windows Action Center. If you can't still detect your firewall with the above steps, try to run Enum Process ( not created by Mozilla ) that is an application that detects many common firewalls: Download Enum Process . After downloading, double-click EnumProcess.exe . Select Run . In the drop-down menu to the right, select Simple . The image \"simple_enumprocess.PNG\" does not exist. Click List Processes . The image \"listprocesses_enumprocess.PNG\" does not exist. Configuring firewalls For Windows Firewall, see How to let Firefox use the internet on your Windows computer . Contact the software provider for other installed firewalls. Refer to the Apple documentation . Go to your distribution's firewall documentation.",
  "products": [
    "firefox"
  ],
  "topics": [
    "site-breakages"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2924,
    "text_bytes": 1789,
    "word_count": 290,
    "downloaded_at": "2025-08-26T10:35:02.347664"
  }
}