{
  "slug": "connection-settings-firefox",
  "title": "Connection settings in Firefox",
  "summary": "Your organization or Internet Service Provider may offer or require you to use a proxy to connect to the Internet. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/connection-settings-firefox",
  "html": "<p>Your organization or Internet service provider may offer or require you to use a <a href=\"https://wikipedia.org/wiki/Proxy_server\">proxy</a>. A proxy acts as an intermediary between your computer and the Internet. It intercepts all requests to the Internet to see if it can fulfill the request using its cache. Proxies are used to improve performance, filter requests and hide your computer from the Internet to improve security. Proxies are often part of corporate firewalls.\n</p><p>Connection settings to use a proxy can be set in Firefox Settings\n as follows:\n</p>\n<ol><li> <span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li> In the <span class=\"menu\">General</span> panel, go to the <em>Network Settings</em> section.\n</li><li> Click <span class=\"button\">Settings…</span> The <em>Connection Settings</em> dialog will open.\n<dl><dt><span class=\"for\" data-for=\"not fx128\"><img alt=\"Fx114NetworkSettings-ConnectionSettings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-06-09-13-00-45-15514e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"fx128\"><img alt=\"Fx128ConnectionSettings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-09-30-10-57-05-a191f2.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</dt></dl>\n</li></ol>\n<ul><li> <strong>No proxy</strong>:  Choose this if you don't want to use a proxy.\n</li><li> <strong>Auto-detect proxy settings for this network</strong>: Choose this if you want Firefox to automatically detect the proxy settings for your network.\n</li><li> <strong>Use system proxy settings</strong>:  Choose this if you want to use the proxy settings configured for your operating system.\n</li><li> <strong>Manual proxy configuration</strong>: Choose this if you have a list of one or more proxy servers. Ask your system administrator for the configuration information. Each proxy requires a hostname and a port number.\n<ul><li> If the same proxy name and port number are used for all protocols, check <strong>Also use this proxy for HTTPS</strong>.\n</li></ul>\n</li><li> <strong>Automatic proxy configuration URL</strong>: Choose this if you have a <a href=\"http://en.wikipedia.org/wiki/Proxy_auto-config\">proxy configuration</a> (<code>.pac</code>) file. Enter the URL and click okay to save changes and load the proxy configuration. <em>file:</em> and <em>data:</em> schemes can also be used here (for example, <strong><code>file:///c:/proxy.pac</code></strong> or <strong><code>data:,function FindProxyForURL(){return \"HTTPS example.com:3443\";}</code></strong>).\n<ul><li> <span class=\"button\">Reload</span>: The reload button will load the currently available proxy configuration.\n</li></ul>\n</li><li> <strong>No Proxy For</strong>: List of hostnames or IP addresses that will not be proxied. Use <strong>&lt;local&gt;</strong> to bypass proxying for all hostnames which do not contain periods.\n</li></ul>\n<div class=\"note\"><strong>Note:</strong> The <em>Connection Settings</em> dialog will also show extensions that control how Firefox connects to the internet. You can disable these extensions by clicking <span class=\"button\">Disable Extension</span>.</div>\n<h1 id=\"w_related-content\">Related content</h1>\n<p>To configure <a href=\"/en-US/kb/firefox-dns-over-https\">DNS over HTTPs (DoH)</a> connection settings, see <a href=\"/en-US/kb/dns-over-https\">Configure DNS over HTTPS protection levels in Firefox</a>.\n</p>",
  "text": "Your organization or Internet service provider may offer or require you to use a proxy . A proxy acts as an intermediary between your computer and the Internet. It intercepts all requests to the Internet to see if it can fulfill the request using its cache. Proxies are used to improve performance, filter requests and hide your computer from the Internet to improve security. Proxies are often part of corporate firewalls. Connection settings to use a proxy can be set in Firefox Settings as follows: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the General panel, go to the Network Settings section. Click Settings… The Connection Settings dialog will open. No proxy : Choose this if you don't want to use a proxy. Auto-detect proxy settings for this network : Choose this if you want Firefox to automatically detect the proxy settings for your network. Use system proxy settings : Choose this if you want to use the proxy settings configured for your operating system. Manual proxy configuration : Choose this if you have a list of one or more proxy servers. Ask your system administrator for the configuration information. Each proxy requires a hostname and a port number. If the same proxy name and port number are used for all protocols, check Also use this proxy for HTTPS . Automatic proxy configuration URL : Choose this if you have a proxy configuration ( .pac ) file. Enter the URL and click okay to save changes and load the proxy configuration. file: and data: schemes can also be used here (for example, file:///c:/proxy.pac or data:,function FindProxyForURL(){return \"HTTPS example.com:3443\";} ). Reload : The reload button will load the currently available proxy configuration. No Proxy For : List of hostnames or IP addresses that will not be proxied. Use <local> to bypass proxying for all hostnames which do not contain periods. Note: The Connection Settings dialog will also show extensions that control how Firefox connects to the internet. You can disable these extensions by clicking Disable Extension . Related content To configure DNS over HTTPs (DoH) connection settings, see Configure DNS over HTTPS protection levels in Firefox .",
  "products": [
    "firefox"
  ],
  "topics": [
    "performance-and-connectivity",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4330,
    "text_bytes": 2290,
    "word_count": 381,
    "downloaded_at": "2025-08-26T10:38:14.006155"
  }
}