{
  "slug": "control-audio-or-video-playback-your-keyboard",
  "title": "Control audio or video playback with your keyboard",
  "summary": "This page explains the technical documentation on how to control media in Firefox by using the Media Session API.",
  "url": "https://support.mozilla.org/en-US/kb/control-audio-or-video-playback-your-keyboard",
  "html": "<p>This article describes the media control feature for audio or video playback in  Firefox.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-is-the-media-control-feature\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What is the media control feature?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-platform-supports-this-feature\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">What platform supports this feature?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-is-media-control-supported\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How is media control supported?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-kinds-of-media-can-be-controlled-by-this-feature\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">What kinds of media can be controlled by this feature?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-kinds-of-media-can-not-be-controlled-by-this-feature\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">What kinds of media can NOT be controlled by this feature?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_if-i-have-multiple-tabs-playing-media-which-tab-would-be-controlled\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">If I have multiple tabs playing media, which tab would be controlled?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_why-sometimes-when-i-press-media-control-keys-it-controls-other-apps-but-not-firefox-or-other-apps-are-also-being-controlled-at-the-same-time\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">Why sometimes when I press media control keys, it controls other apps but not Firefox? Or, other apps are also being controlled at the same time?</span></a></li></ul></div>\n<h1 id=\"w_what-is-the-media-control-feature\">What is the media control feature?</h1>\n<p>You control media (audio or video) playback inside Firefox without clicking on the video or audio itself. You can now control it by pressing the hardware control buttons on a keyboard or headset, pressing the button on the virtual control interface or by sending commands via specific protocol, such as <a href=\"https://specifications.freedesktop.org/mpris-spec/latest/\">MPRIS</a>.\n</p>\n<div class=\"note\">This depends on website developers using the <a href=\"https://w3c.github.io/mediasession/\">MediaSession API</a>.</div>\n<h1 id=\"w_what-platform-supports-this-feature\">What platform supports this feature?</h1>\n<p>You can use this feature on macOS (version 10.12.1 or above), Windows (Windows 8.1 or above), and Linux (gtk-based distributions).\n</p>\n<h1 id=\"w_how-is-media-control-supported\">How is media control supported?</h1>\n<ul><li>Physical hardware media control keys.\n</li><li>Virtual media control keys, each platform has different virtual controller interfaces, which are implemented by different platform frameworks:\n<ul><li><a href=\"https://bug1615665.bmoattachments.org/attachment.cgi?id=9129321\">Interface on Windows</a> (using <a href=\"https://docs.microsoft.com/en-us/uwp/api/windows.media.systemmediatransportcontrols\">SMTC</a>)\n</li><li><a href=\"https://web.archive.org/web/20220602181144/https://user-media-prod-cdn.itsre-sumo.mozilla.net/uploads/gallery/images/2020-10-27-11-53-36-8ebdd3.png\">Interface on Linux</a> (using <a href=\"https://specifications.freedesktop.org/mpris-spec/2.2/\">MPRIS</a>) \n</li><li><a href=\"https://media.idownloadblog.com/wp-content/uploads/2016/10/MacBook-Pro-Touch-Bar-Control-Strip-005.jpg\">Interface on MacOS touch bar</a> (using <a href=\"https://developer.apple.com/documentation/mediaplayer\">MediaPlayer</a>)\n</li></ul>\n</li><li>Using an app which uses platform specific API to involve controlling media.\n</li></ul>\n<h1 id=\"w_what-kinds-of-media-can-be-controlled-by-this-feature\">What kinds of media can be controlled by this feature?</h1>\n<p>Currently we only support controlling media playing from <strong>audio</strong> and <strong>video</strong>, so it <strong>cannot</strong> control media from web-audio and web-speech.\n</p>\n<ul><li>If an audible media is playing from audio and video, then it’s able to be controlled\n</li><li>If a playable media enters fullscreen\n</li><li>If a playable media enters picture-in-picture mode\n</li></ul>\n<h1 id=\"w_what-kinds-of-media-can-not-be-controlled-by-this-feature\">What kinds of media can NOT be controlled by this feature?</h1>\n<p>Media from <strong>web-audio</strong> and <strong>web-speech</strong> cannot be controlled. Also:\n</p>\n<ul><li>Inaudible media (silent videos that don't have an audio track, such as GIF-like images)\n</li><li>Notification sounds\n</li></ul>\n<h1 id=\"w_if-i-have-multiple-tabs-playing-media-which-tab-would-be-controlled\">If I have multiple tabs playing media, which tab would be controlled?</h1>\n<p>If there are multiple tabs playing at the same time, you could control the last tab playing media, unless you are playing in <a href=\"/en-US/kb/about-picture-picture-firefox\">Picture-in-Picture mode</a>. In this case, the tab the picture-in-picture video belongs to would always be the tab that is being controlled.\n</p>\n<h1 id=\"w_why-sometimes-when-i-press-media-control-keys-it-controls-other-apps-but-not-firefox-or-other-apps-are-also-being-controlled-at-the-same-time\">Why sometimes when I press media control keys, it controls other apps but not Firefox? Or, other apps are also being controlled at the same time?</h1>\n<p>Each platform has its own mechanism for which applications control audio. In some cases, multiple applications might try to control the media keys at the same time. If this happens, try to close any other apps that are trying to control your media control keys.\n</p>",
  "text": "This article describes the media control feature for audio or video playback in Firefox. Table of Contents 1 What is the media control feature? 2 What platform supports this feature? 3 How is media control supported? 4 What kinds of media can be controlled by this feature? 5 What kinds of media can NOT be controlled by this feature? 6 If I have multiple tabs playing media, which tab would be controlled? 7 Why sometimes when I press media control keys, it controls other apps but not Firefox? Or, other apps are also being controlled at the same time? What is the media control feature? You control media (audio or video) playback inside Firefox without clicking on the video or audio itself. You can now control it by pressing the hardware control buttons on a keyboard or headset, pressing the button on the virtual control interface or by sending commands via specific protocol, such as MPRIS . This depends on website developers using the MediaSession API . What platform supports this feature? You can use this feature on macOS (version 10.12.1 or above), Windows (Windows 8.1 or above), and Linux (gtk-based distributions). How is media control supported? Physical hardware media control keys. Virtual media control keys, each platform has different virtual controller interfaces, which are implemented by different platform frameworks: Interface on Windows (using SMTC ) Interface on Linux (using MPRIS ) Interface on MacOS touch bar (using MediaPlayer ) Using an app which uses platform specific API to involve controlling media. What kinds of media can be controlled by this feature? Currently we only support controlling media playing from audio and video , so it cannot control media from web-audio and web-speech. If an audible media is playing from audio and video, then it’s able to be controlled If a playable media enters fullscreen If a playable media enters picture-in-picture mode What kinds of media can NOT be controlled by this feature? Media from web-audio and web-speech cannot be controlled. Also: Inaudible media (silent videos that don't have an audio track, such as GIF-like images) Notification sounds If I have multiple tabs playing media, which tab would be controlled? If there are multiple tabs playing at the same time, you could control the last tab playing media, unless you are playing in Picture-in-Picture mode . In this case, the tab the picture-in-picture video belongs to would always be the tab that is being controlled. Why sometimes when I press media control keys, it controls other apps but not Firefox? Or, other apps are also being controlled at the same time? Each platform has its own mechanism for which applications control audio. In some cases, multiple applications might try to control the media keys at the same time. If this happens, try to close any other apps that are trying to control your media control keys.",
  "products": [
    "firefox"
  ],
  "topics": [
    "audio-and-video",
    "browse",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5665,
    "text_bytes": 2874,
    "word_count": 476,
    "downloaded_at": "2025-08-26T10:53:42.077627"
  }
}