{
  "slug": "data-loss-prevention",
  "title": "Data Loss Prevention",
  "summary": "Seeing the DLP icon in Firefox? Here’s what it means and how it helps protect your data.",
  "url": "https://support.mozilla.org/en-US/kb/data-loss-prevention",
  "html": "<div class=\"for\" data-for=\"not win\"><div class=\"warning\">This article only applies to Firefox desktop on Windows.</div></div>\n<p>Keeping sensitive data safe from unauthorized access, leaks or misuse is crucial for any organization. Data Loss Prevention (DLP) helps by controlling how data is handled, shared and accessed. <a href=\"/en-US/kb/firefox-enterprise-vs-normal-firefox\">Firefox for Enterprise</a> supports DLP by integrating with third-party software to detect accidental or inappropriate sharing of company data. When enabled, operations such as file uploads and pasting of data can be checked by DLP software.\n</p>\n<h1 id=\"w_dlp-icon\">DLP icon</h1>\n<p>When you see the DLP icon in the Firefox tab bar, it means Firefox is set up to work with an <a href=\"/en-US/kb/see-active-policies-firefox-enterprise\">Enterprise Policy</a> to share browsing data with third-party DLP software, which can potentially limit activities like uploading or sharing information.\n</p>\n<dl><dt><img alt=\"DLP icon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-07-09-06-35-20-3bfa56.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"800\">\n</dt></dl>\n<div class=\"note\">\n<p><strong>Note:</strong> Even when the DLP icon is not displayed, third-party software can be installed on your machine to monitor browsing activity using DLL injection. For details, see <a href=\"/en-US/kb/identify-problems-third-party-modules-firefox-windows\">Identify problems caused by third-party modules in Firefox for Windows</a>.\n</p>\n</div>\n<h1 id=\"w_can-i-disable-dlp\">Can I disable DLP?</h1>\n<p>DLP is typically used on managed computers set up by IT administrators in organizations and can be turned on or off by them. If you see the DLP icon on your personal computer, it might mean that third-party software was installed by mistake or an Enterprise Policy was applied incorrectly. If this applies to you, <a href=\"https://support.mozilla.org/questions/new/desktop/form\">ask a question</a> on the Firefox support forum to get help from the Mozilla Community.\n</p>\n<h1 id=\"w_check-the-path-of-connected-dlp-software\">Check the path of connected DLP software</h1>\n<p>When DLP is enabled and Firefox is connected to a DLP agent, information about the agent can be found on the <em>Troubleshooting Information</em> page under the heading <em>Content Analysis (DLP)</em>. To access the page:\n</p>\n<ol><li>At the top right, click the application menu button <img alt=\"IG main menu\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-04-08-05-37-01-6bf1c5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">.\n</li><li>From the dropdown, select <span class=\"menu\">Help</span> and then <span class=\"menu\">More Troubleshooting Information</span>.\n</li><li>Scroll down until you see the <em>Content Analysis (DLP)</em> section.\n<dl><dt><br><img alt=\"DLP details\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-07-09-06-35-49-8c3fa8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"800\">\n</dt></dl>\n</li></ol>\n<dl><dt>If the DLP icon is displayed, but there is no <em>Agent Path</em> listed, it indicates that Firefox has been configured to use DLP via an Enterprise Policy, but is not connected to any DLP agent software on the computer.\n</dt></dl>",
  "text": "This article only applies to Firefox desktop on Windows. Keeping sensitive data safe from unauthorized access, leaks or misuse is crucial for any organization. Data Loss Prevention (DLP) helps by controlling how data is handled, shared and accessed. Firefox for Enterprise supports DLP by integrating with third-party software to detect accidental or inappropriate sharing of company data. When enabled, operations such as file uploads and pasting of data can be checked by DLP software. DLP icon When you see the DLP icon in the Firefox tab bar, it means Firefox is set up to work with an Enterprise Policy to share browsing data with third-party DLP software, which can potentially limit activities like uploading or sharing information. Note: Even when the DLP icon is not displayed, third-party software can be installed on your machine to monitor browsing activity using DLL injection. For details, see Identify problems caused by third-party modules in Firefox for Windows . Can I disable DLP? DLP is typically used on managed computers set up by IT administrators in organizations and can be turned on or off by them. If you see the DLP icon on your personal computer, it might mean that third-party software was installed by mistake or an Enterprise Policy was applied incorrectly. If this applies to you, ask a question on the Firefox support forum to get help from the Mozilla Community. Check the path of connected DLP software When DLP is enabled and Firefox is connected to a DLP agent, information about the agent can be found on the Troubleshooting Information page under the heading Content Analysis (DLP) . To access the page: At the top right, click the application menu button . From the dropdown, select Help and then More Troubleshooting Information . Scroll down until you see the Content Analysis (DLP) section. If the DLP icon is displayed, but there is no Agent Path listed, it indicates that Firefox has been configured to use DLP via an Enterprise Policy, but is not connected to any DLP agent software on the computer.",
  "products": [
    "firefox",
    "firefox-enterprise"
  ],
  "topics": [
    "privacy-and-security",
    "security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3668,
    "text_bytes": 2046,
    "word_count": 341,
    "downloaded_at": "2025-08-26T10:56:45.861170"
  }
}