{
  "slug": "disable-firefox-sync",
  "title": "Disable Firefox Sync",
  "summary": "Learn how to turn off Firefox Sync if you’d like to use your Mozilla account without syncing data such as, bookmarks, history and tabs.",
  "url": "https://support.mozilla.org/en-US/kb/disable-firefox-sync",
  "html": "<p>Firefox Sync allows you to sync your bookmarks, logins and passwords, browsing history, tab settings and other items across various devices. See <a href=\"/en-US/kb/how-do-i-set-sync-my-computer\">How do I set up Sync on my computer?</a> to learn more about how to turn on Sync.\n</p><p>You can disable Sync, if you like, to avoid syncing your data across certain devices when creating or signing in to your Mozilla account. You'll remain signed in to your account even after Sync has been disabled, unless you decide to sign out. You can also disable Sync for devices that have been synced previously. For additional information, see <a href=\"/en-US/kb/remove-synced-device-firefox-accounts\">Remove a synced device from your Mozilla account</a>.\n</p>\n<div class=\"note\"><strong>Note:</strong> You can sign up for a <a href=\"/en-US/kb/how-do-i-set-sync-my-computer#w_create-a-mozilla-account\">Mozilla account</a> without having to enable Firefox Sync immediately.</div>\n<h1 id=\"w_disable-sync-for-previously-synced-devices\">Disable Sync for previously synced devices</h1>\n<p>To disable Sync for previously synced devices:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Click <strong>Sync </strong> from the menu options to open the Sync settings panel.\n</li><li>Click the <span class=\"button\">Manage Sync</span> button in the <em>Syncing: ON</em> subsection.\n<dl><dt>The <em>Choose What To Sync</em> pop-up will open.\n</dt><dt><img alt=\"Sync_proton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-04-12-15-17-45-ed2347.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>Click <span class=\"menu\">Disconnect…</span> A confirmation prompt will appear.\n<dl><dt><img alt=\"Sync_protonPrompt\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-04-12-15-18-31-25d72e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>Click the <span class=\"button\">Disconnect</span> button in the prompt.\n</li></ol>\n<p>This Firefox profile will stop syncing your account but won’t delete any data or settings. The <span class=\"menu\">Sync</span> panel of your Firefox Settings\n page will now show <em>Syncing: OFF</em>.\n</p>\n<dl><dt><img alt=\"Fx89SyncingOff\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-06-05-04-13-06-49f4bd.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div class=\"note\"><strong>Note:</strong> To turn syncing back on, click <span class=\"menu\">Turn on syncing…</span> in the <span class=\"menu\">Sync</span> panel of your Firefox Settings\n page.</div>",
  "text": "Firefox Sync allows you to sync your bookmarks, logins and passwords, browsing history, tab settings and other items across various devices. See How do I set up Sync on my computer? to learn more about how to turn on Sync. You can disable Sync, if you like, to avoid syncing your data across certain devices when creating or signing in to your Mozilla account. You'll remain signed in to your account even after Sync has been disabled, unless you decide to sign out. You can also disable Sync for devices that have been synced previously. For additional information, see Remove a synced device from your Mozilla account . Note: You can sign up for a Mozilla account without having to enable Firefox Sync immediately. Disable Sync for previously synced devices To disable Sync for previously synced devices: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Click Sync from the menu options to open the Sync settings panel. Click the Manage Sync button in the Syncing: ON subsection. The Choose What To Sync pop-up will open. Click Disconnect… A confirmation prompt will appear. Click the Disconnect button in the prompt. This Firefox profile will stop syncing your account but won’t delete any data or settings. The Sync panel of your Firefox Settings page will now show Syncing: OFF . Note: To turn syncing back on, click Turn on syncing… in the Sync panel of your Firefox Settings page.",
  "products": [
    "firefox",
    "mozilla-account"
  ],
  "topics": [
    "performance-and-connectivity",
    "privacy-and-security",
    "sync-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3604,
    "text_bytes": 1513,
    "word_count": 261,
    "downloaded_at": "2025-08-26T10:52:52.576370"
  }
}