{
  "slug": "does-firefox-share-my-location-websites",
  "title": "Does Firefox share my location with websites?",
  "summary": "Learn what information Firefox sends to websites about your location and how to use and manage location-aware features of your browser.",
  "url": "https://support.mozilla.org/en-US/kb/does-firefox-share-my-location-websites",
  "html": "<p>This article explains the location-aware features of Firefox and how to manage permissions for websites that ask you to share your location. \n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_location-aware-browsing\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Location-aware browsing</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-does-it-work\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How does it work?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_temporary-permissions\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Temporary permissions</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_what-information-is-being-sent-and-to-whom-how-is-my-privacy-protected\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">What information is being sent, and to whom? How is my privacy protected?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-undo-a-permission-granted-to-a-site\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">How do I undo a permission granted to a site?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-stop-all-sites-from-asking-to-access-my-location\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">How do I stop all sites from asking to access my location?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-can-i-add-support-for-geolocation-to-my-website\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">How can I add support for Geolocation to my website?</span></a></li></ul></div>\n<h1 id=\"w_location-aware-browsing\">Location-aware browsing</h1>\n<p>Websites using location-aware browsing will ask where you are located in order to enhance your browsing and searching experience. For example, sharing your location can help you find food near you faster or quickly get directions to places you want to go.\n</p><p>Websites using location-aware browsing signal to Firefox that they want to access your location. By default, Firefox asks you if you want to share your location with these websites.\n</p><p><strong>This service is optional.</strong> Firefox doesn’t share your location without your permission. Like all elements of Firefox, it is created using open standards to ease adoption by web developers.\n</p>\n<h1 id=\"w_how-does-it-work\">How does it work?</h1>\n<p>When you visit a location-aware website, Firefox will ask you if you want to share your location.\n</p>\n<dl><dt><span class=\"for\" data-for=\"not fx131\"><img alt=\"Fx98AllowLocationAccess\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-06-14-17-54-30-09bbbd.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\"></span><span class=\"for\" data-for=\"fx131\"><img alt=\"Location request panel\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-09-26-12-03-09-e38237.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\"></span>\n</dt></dl>\n<p>If you allow location access, Firefox gathers information about nearby wireless access points and your computer’s IP address. Firefox sends this information to the default geolocation service provider, Google Location Services, to get an estimate of your location. That location estimate is then shared with the requesting website.\n</p><p>If you do not allow access, Firefox will not take any action.\n</p><p>If you check the <span class=\"menu\">Remember this decision</span> box, Firefox will always allow or always block location access for that website without asking.\n</p><div class=\"for\" data-for=\"fx131\">\n<h2 id=\"w_temporary-permissions\">Temporary permissions</h2>\n<p>Firefox is able to temporarily remember when you grant permissions to websites (like geolocation). If you allow a website location access but you do not check the <span class=\"menu\">Remember this decision</span> box, Firefox will allow that permission on a temporary basis. Temporary permissions are automatically removed either after one hour or when the tab is closed. This provides control over shared data, ensuring that permissions are not retained longer than necessary.\n</p><p>To manage temporary permissions:\n</p>\n<ol><li>At the left side of the address bar, click the Permissions icon <img alt=\"Fx89PermissionsIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-10-05-34-30-47c30e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">.\n</li><li>A <a href=\"/en-US/kb/site-permissions-panel\">permissions panel</a> will appear, showing when the website last accessed your location.\n</li><li>If you want to remove the location-tracking permission, click the <span class=\"button\">✕</span> next to <span class=\"button\">Allowed Temporarily</span>.\n</li><li>Once removed, the website will no longer be able to access your location unless you grant permission again.\n</li></ol>\n<p><img alt=\"Temporary permissions\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-09-26-12-14-32-95ad23.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\"> \n</p></div>\n<h1 id=\"w_what-information-is-being-sent-and-to-whom-how-is-my-privacy-protected\">What information is being sent, and to whom? How is my privacy protected?</h1>\n<p>\nYour privacy is extremely important to us, and Firefox never shares your location without your permission. When you visit a page that requests your information, you’ll be asked before any information is shared with the requesting website and our third-party service provider.\n</p><p>By default, Firefox uses Google Location Services to determine your location by sending:\n</p>\n<ul><li> your computer’s IP address,\n</li><li> information about the nearby wireless access points, and\n</li><li> a random client identifier, which is assigned by Google, that expires every 2 weeks.\n</li></ul>\n<p>Google Location Services then returns your estimated geolocation. For a complete description of information collected and used by Google, please see the <a href=\"https://www.google.com/privacy/lsf.html\">Google Location Service in Mozilla Firefox Privacy Policy</a>.\n</p><p>The information is exchanged over an encrypted connection to protect your privacy. Once Firefox has your location information, it passes it to the website that requested it. The name and location of the website you are visiting are never shared with Google Location Services.\n</p><p>For a complete description of information collected and used by Firefox, please see the <a href=\"https://www.mozilla.org/privacy/firefox/\">Firefox Privacy Notice</a>.\n</p><p>For information about what the requesting website does with your location information, please refer to that website’s privacy policy.\n</p>\n<h1 id=\"w_how-do-i-undo-a-permission-granted-to-a-site\">How do I undo a permission granted to a site?</h1>\n<ol><li> <span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li> Use the Settings\n search box to search for <strong>location</strong> (or select the <span class=\"menu\">Privacy &amp; Security</span> panel and scroll down to the <em>Permissions</em> section).\n</li><li> Under <em>Permissions</em>, click the <span class=\"button\">Settings</span> button to the right of <strong>Location</strong>.\n<dl><dt><img alt=\"Fx98PreferencesSearchResultsLocation\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-06-14-17-56-21-f63b19.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"500\">\n</dt></dl>\n<ul><li>The <em>Settings - Location Permissions</em> dialog box will open.\n</li></ul>\n<dl><dt><img alt=\"Fx98LocationPermissions\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-06-14-17-57-57-12ad52.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"500\">\n</dt></dl>\n</li><li> Review or change the list of sites with allowed or denied location permission.\n</li></ol>\n<h1 id=\"w_how-do-i-stop-all-sites-from-asking-to-access-my-location\">How do I stop all sites from asking to access my location?</h1>\n<p>You can set Firefox to automatically deny new permission requests to all websites, without asking.\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li> Use the Settings\n search box to search for <strong>location</strong> (or select the <span class=\"menu\">Privacy &amp; Security</span> panel and scroll down to the <em>Permissions</em> section).  \n</li><li> Under <em>Permissions</em>, click the <span class=\"button\">Settings…</span> button to the right of <strong>Location</strong>.\n</li><li> In the <em>Settings - Location Permissions</em> box that opens, check-mark the box next to <span class=\"menu\">Block new requests asking to access your location</span>.\n</li><li> Click <span class=\"button\">Save Changes</span>.\n</li></ol>\n<p>This will prevent any websites from requesting new permission to access your location. Only the sites with permission granted in the Location Permissions settings box will have access.\n</p>\n<h1 id=\"w_how-can-i-add-support-for-geolocation-to-my-website\">How can I add support for Geolocation to my website?</h1>\n<p>You can integrate Geolocation support into your service by following <a href=\"https://developer.mozilla.org/docs/Web/API/Geolocation_API\">the Geolocation API guide at <em>MDN web docs</em></a>.\n</p>",
  "text": "This article explains the location-aware features of Firefox and how to manage permissions for websites that ask you to share your location. Table of Contents 1 Location-aware browsing 2 How does it work? 2.1 Temporary permissions 3 What information is being sent, and to whom? How is my privacy protected? 4 How do I undo a permission granted to a site? 5 How do I stop all sites from asking to access my location? 6 How can I add support for Geolocation to my website? Location-aware browsing Websites using location-aware browsing will ask where you are located in order to enhance your browsing and searching experience. For example, sharing your location can help you find food near you faster or quickly get directions to places you want to go. Websites using location-aware browsing signal to Firefox that they want to access your location. By default, Firefox asks you if you want to share your location with these websites. This service is optional. Firefox doesn’t share your location without your permission. Like all elements of Firefox, it is created using open standards to ease adoption by web developers. How does it work? When you visit a location-aware website, Firefox will ask you if you want to share your location. If you allow location access, Firefox gathers information about nearby wireless access points and your computer’s IP address. Firefox sends this information to the default geolocation service provider, Google Location Services, to get an estimate of your location. That location estimate is then shared with the requesting website. If you do not allow access, Firefox will not take any action. If you check the Remember this decision box, Firefox will always allow or always block location access for that website without asking. Temporary permissions Firefox is able to temporarily remember when you grant permissions to websites (like geolocation). If you allow a website location access but you do not check the Remember this decision box, Firefox will allow that permission on a temporary basis. Temporary permissions are automatically removed either after one hour or when the tab is closed. This provides control over shared data, ensuring that permissions are not retained longer than necessary. To manage temporary permissions: At the left side of the address bar, click the Permissions icon . A permissions panel will appear, showing when the website last accessed your location. If you want to remove the location-tracking permission, click the ✕ next to Allowed Temporarily . Once removed, the website will no longer be able to access your location unless you grant permission again. What information is being sent, and to whom? How is my privacy protected? Your privacy is extremely important to us, and Firefox never shares your location without your permission. When you visit a page that requests your information, you’ll be asked before any information is shared with the requesting website and our third-party service provider. By default, Firefox uses Google Location Services to determine your location by sending: your computer’s IP address, information about the nearby wireless access points, and a random client identifier, which is assigned by Google, that expires every 2 weeks. Google Location Services then returns your estimated geolocation. For a complete description of information collected and used by Google, please see the Google Location Service in Mozilla Firefox Privacy Policy . The information is exchanged over an encrypted connection to protect your privacy. Once Firefox has your location information, it passes it to the website that requested it. The name and location of the website you are visiting are never shared with Google Location Services. For a complete description of information collected and used by Firefox, please see the Firefox Privacy Notice . For information about what the requesting website does with your location information, please refer to that website’s privacy policy. How do I undo a permission granted to a site? In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Use the Settings search box to search for location (or select the Privacy & Security panel and scroll down to the Permissions section). Under Permissions , click the Settings button to the right of Location . The Settings - Location Permissions dialog box will open. Review or change the list of sites with allowed or denied location permission. How do I stop all sites from asking to access my location? You can set Firefox to automatically deny new permission requests to all websites, without asking. In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Use the Settings search box to search for location (or select the Privacy & Security panel and scroll down to the Permissions section). Under Permissions , click the Settings… button to the right of Location . In the Settings - Location Permissions box that opens, check-mark the box next to Block new requests asking to access your location . Click Save Changes . This will prevent any websites from requesting new permission to access your location. Only the sites with permission granted in the Location Permissions settings box will have access. How can I add support for Geolocation to my website? You can integrate Geolocation support into your service by following the Geolocation API guide at MDN web docs .",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 11124,
    "text_bytes": 5592,
    "word_count": 911,
    "downloaded_at": "2025-08-26T10:38:36.118293"
  }
}