{
  "slug": "enable-background-updates-firefox-windows",
  "title": "Enable background updates on Firefox for Windows when Firefox is not running",
  "summary": "On Windows, you can set Firefox to update in the background even when it isn't running, so you always have the latest version. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/enable-background-updates-firefox-windows",
  "html": "<div class=\"for\" data-for=\"not win\"><div class=\"for\" data-for=\"not win\"><div class=\"warning\">This article only applies to Firefox on Windows.</div></div></div>\n<p></p><p>Firefox includes a background updates feature for Windows that checks for, downloads, and installs Firefox updates in the background, even when Firefox is not running. This way, you will have the latest available version of Firefox, every time you open the browser.\n</p><p>The background updates feature adds a <strong>Firefox Background Update</strong> entry to the <em>Windows Task Scheduler</em> that, when enabled, will check for Firefox updates every 7 hours when the browser is not in use. On Windows, there will now be fewer interruptions because, when background updates are enabled, Firefox won’t prompt you for updates. Instead, a background agent will download and install updates even if Firefox is closed.\n</p><p>To enable or disable this functionality, follow the steps below:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>In the <span class=\"menu\">General</span> panel, go down to the <em>Firefox Updates</em> section.\n<dl><dt><span class=\"for\" data-for=\"not fx130\"><img alt=\"Fx128settings-AutomaticUpdates-win\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-10-01-01-56-52-46b2c1.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"fx130\"><img alt=\"Fx130settings-AutomaticUpdates-win\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-09-30-11-14-28-b71a84.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</dt></dl>\n</li><li>Select <strong>Automatically install updates (recommended)</strong> and, underneath that setting, check or uncheck the box next to <strong>When Firefox is not running</strong> to enable or disable background updates.\n</li></ol>\n<div class=\"note\"><strong>Note:</strong> You can also disable background updates by selecting <strong>Check for updates but let you choose to install them</strong>; however, this turns off automatic updates and is not recommended.</div>\n<p>The background updates feature has a few requirements to be able to run:\n</p>\n<ul><li>Firefox must have been installed with the installer (not, for example, from a ZIP file).\n</li><li>The <a href=\"/en-US/kb/what-mozilla-maintenance-service\">Mozilla Maintenance Service</a> must be usable (installed and not disabled). When installing with the Firefox installer, this is the default.\n</li><li>Firefox must have a default <a href=\"/en-US/kb/profile-manager-create-remove-switch-firefox-profiles\">profile</a>, and it must run using that profile at least once after the feature is enabled.\n</li><li>Firefox must not have a language pack installed.\n</li><li><a href=\"/en-US/kb/connection-settings-firefox\">Firefox connection settings</a> must be configured to use the system proxy (this is the default).\n</li></ul>\n<p>To learn more about this feature, see Mozilla's <a href=\"https://firefox-source-docs.mozilla.org/toolkit/mozapps/update/docs/BackgroundUpdates.html\">Background Updates</a> article in <em>Firefox Source Docs</em> documentation.\n</p>",
  "text": "This article only applies to Firefox on Windows. Firefox includes a background updates feature for Windows that checks for, downloads, and installs Firefox updates in the background, even when Firefox is not running. This way, you will have the latest available version of Firefox, every time you open the browser. The background updates feature adds a Firefox Background Update entry to the Windows Task Scheduler that, when enabled, will check for Firefox updates every 7 hours when the browser is not in use. On Windows, there will now be fewer interruptions because, when background updates are enabled, Firefox won’t prompt you for updates. Instead, a background agent will download and install updates even if Firefox is closed. To enable or disable this functionality, follow the steps below: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the General panel, go down to the Firefox Updates section. Select Automatically install updates (recommended) and, underneath that setting, check or uncheck the box next to When Firefox is not running to enable or disable background updates. Note: You can also disable background updates by selecting Check for updates but let you choose to install them ; however, this turns off automatic updates and is not recommended. The background updates feature has a few requirements to be able to run: Firefox must have been installed with the installer (not, for example, from a ZIP file). The Mozilla Maintenance Service must be usable (installed and not disabled). When installing with the Firefox installer, this is the default. Firefox must have a default profile , and it must run using that profile at least once after the feature is enabled. Firefox must not have a language pack installed. Firefox connection settings must be configured to use the system proxy (this is the default). To learn more about this feature, see Mozilla's Background Updates article in Firefox Source Docs documentation.",
  "products": [
    "firefox"
  ],
  "topics": [
    "installation-and-updates"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4016,
    "text_bytes": 2076,
    "word_count": 337,
    "downloaded_at": "2025-08-26T10:54:20.311456"
  }
}