{
  "slug": "extensions-private-browsing",
  "title": "Extensions in Private Browsing",
  "summary": "You can set which Firefox extensions can run in private windows and which can't, when you install the extension or later on. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/extensions-private-browsing",
  "html": "<p>This article explains how to set which <a href=\"/en-US/kb/find-and-install-add-ons-add-features-to-firefox#w_what-types-of-add-ons-can-i-install\">extensions</a> are allowed to run in <a href=\"/en-US/kb/private-browsing-use-firefox-without-history\">Private Browsing</a> windows.\n</p>\n<div class=\"note\"><strong>Note:</strong> Not all extensions can be allowed in private windows.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_extensions-in-private-windows\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Extensions in private windows</span></a></li><li class=\"toclevel-1\"><a href=\"#w_granting-permission-on-installation\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Granting permission on installation</span></a></li><li class=\"toclevel-1\"><a href=\"#w_enabling-or-disabling-extensions-in-private-windows\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Enabling or disabling extensions in private windows</span></a></li></ul></div>\n<h1 id=\"w_extensions-in-private-windows\">Extensions in private windows</h1>\n<p>An extension that runs in private browsing windows could be problematic if it has access to information you would rather keep private. Firefox lets you decide which extensions are allowed to run in private windows. Additionally, an extension is not enabled for private browsing by default. You must grant it permission, either during installation or later through the extension's settings.\n</p><p>If you do not give an extension permission to run in private browsing, it should still work normally in non-private browsing, unless the extension explicitly uses features that require private browsing access (like opening new tabs in a private window).\n</p>\n<h1 id=\"w_granting-permission-on-installation\">Granting permission on installation</h1>\n<div class=\"for\" data-for=\"fx129\"><p>When you install a new extension, you will see a prompt asking for permission to add the extension and whether to allow it to run in private windows.\n</p>\n<dl><dt><img alt=\"Add-on Run in Private Window permission\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-10-24-04-55-34-c2be5a.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<ul><li>If you would like the extension to work in private browsing, check the box next to <strong>Run in Private Windows</strong> and click on the <span class=\"button\">Add</span> button to confirm.\n</li><li>If you <strong>do not</strong> want the extension to have access to your data in private browsing windows, leave the box unchecked.\n</li></ul>\n</div><div class=\"for\" data-for=\"not fx129\"><p>After you install a new extension, you will see a prompt notifying you that the extension was added and asking whether to allow it to run in private windows.\n</p>\n<dl><dt><img alt=\"Fx128ExtensionAdded-PrivateWindowsPrompt\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-10-11-06-33-09-71cf37.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<ul><li>If you would like the extension to work in private browsing, click on the box next to <strong>Allow this extension to run in Private Windows</strong> to add a check mark and then click on the <span class=\"button\">Okay</span> button.\n</li><li>If you do not want the extension to have access to your data in private browsing windows, leave the box unchecked.\n</li></ul>\n</div>\n<h1 id=\"w_enabling-or-disabling-extensions-in-private-windows\">Enabling or disabling extensions in private windows</h1>\n<ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"for\" data-for=\"not fx140\"><span class=\"menu\">Add-ons and themes</span></span><span class=\"for\" data-for=\"fx140\"><span class=\"menu\">Extensions and themes</span></span> and select <span class=\"menu\">Extensions</span>.\n\n</li><li>Click on the extension that you would like to manage.\n<ul><li>This will open a panel where you can manage extension settings.\n</li></ul>\n<dl><dt><img alt=\"Manage extensions that can run in private windows\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-10-24-04-59-36-ef53b0.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>Next to <strong>Run in Private Windows</strong>, select <span class=\"menu\">Allow</span> to permit the extension to work in private browsing or select <span class=\"menu\">Don’t Allow</span> to disable it in private browsing.\n</li><li>Once you have made your choice, you can close the Add-ons Manager tab.\n</li></ol>",
  "text": "This article explains how to set which extensions are allowed to run in Private Browsing windows. Note: Not all extensions can be allowed in private windows. Table of Contents 1 Extensions in private windows 2 Granting permission on installation 3 Enabling or disabling extensions in private windows Extensions in private windows An extension that runs in private browsing windows could be problematic if it has access to information you would rather keep private. Firefox lets you decide which extensions are allowed to run in private windows. Additionally, an extension is not enabled for private browsing by default. You must grant it permission, either during installation or later through the extension's settings. If you do not give an extension permission to run in private browsing, it should still work normally in non-private browsing, unless the extension explicitly uses features that require private browsing access (like opening new tabs in a private window). Granting permission on installation When you install a new extension, you will see a prompt asking for permission to add the extension and whether to allow it to run in private windows. If you would like the extension to work in private browsing, check the box next to Run in Private Windows and click on the Add button to confirm. If you do not want the extension to have access to your data in private browsing windows, leave the box unchecked. After you install a new extension, you will see a prompt notifying you that the extension was added and asking whether to allow it to run in private windows. If you would like the extension to work in private browsing, click on the box next to Allow this extension to run in Private Windows to add a check mark and then click on the Okay button. If you do not want the extension to have access to your data in private browsing windows, leave the box unchecked. Enabling or disabling extensions in private windows Click the menu button , click Add-ons and themes Extensions and themes and select Extensions . Click on the extension that you would like to manage. This will open a panel where you can manage extension settings. Next to Run in Private Windows , select Allow to permit the extension to work in private browsing or select Don’t Allow to disable it in private browsing. Once you have made your choice, you can close the Add-ons Manager tab.",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "browse"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5162,
    "text_bytes": 2372,
    "word_count": 404,
    "downloaded_at": "2025-08-26T10:47:11.588488"
  }
}