{
  "slug": "faq-encrypted-client-hello",
  "title": "Encrypted Client Hello (ECH) - Frequently asked questions",
  "summary": "Encrypted Client Hello (ECH) is a security feature in major Web browsers, available in Firefox 118 and enabled by default in Firefox 119. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/faq-encrypted-client-hello",
  "html": "<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-is-encrypted-client-hello-ech-and-why-is-it-important\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What is Encrypted Client Hello (ECH), and why is it important?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-enable-ech-in-firefox\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How do I enable ECH in Firefox?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-know-ech-is-available-for-me\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How do I know ECH is available for me?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_does-ech-affect-my-internet-speed\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Does ECH affect my Internet speed?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_does-ech-affect-website-compatibility\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Does ECH affect website compatibility?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_can-i-use-ech-alongside-other-security-tools-like-ad-blockers\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Can I use ECH alongside other security tools like ad blockers?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_can-i-use-ech-alongside-other-security-tools-like-vpns\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">Can I use ECH alongside other security tools like VPNs?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_are-there-any-privacy-concerns-or-drawbacks-associated-with-ech\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">Are there any privacy concerns or drawbacks associated with ECH?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_can-enterprises-disable-ech\"><span class=\"tocnumber\">9</span> <span class=\"toctext\">Can Enterprises disable ECH?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_will-users-notice-any-changes-in-their-browsing-experience-as-a-result-of-this-encryption\"><span class=\"tocnumber\">10</span> <span class=\"toctext\">Will users notice any changes in their browsing experience as a result of this encryption?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-will-ech-impact-parental-controls\"><span class=\"tocnumber\">11</span> <span class=\"toctext\">How will ECH impact parental controls?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-will-ech-impact-enterprises-that-use-transparent-proxies\"><span class=\"tocnumber\">12</span> <span class=\"toctext\">How will ECH impact Enterprises that use transparent proxies?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_which-websites-can-use-ech\"><span class=\"tocnumber\">13</span> <span class=\"toctext\">Which websites can use ECH?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_why-cant-users-directly-control-ech\"><span class=\"tocnumber\">14</span> <span class=\"toctext\">Why can’t users directly control ECH?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-can-i-tell-if-ech-is-working-for-me\"><span class=\"tocnumber\">15</span> <span class=\"toctext\">How can I tell if ECH is working for me?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_learn-more\"><span class=\"tocnumber\">16</span> <span class=\"toctext\">Learn more</span></a></li></ul></div>\n<h1 id=\"w_what-is-encrypted-client-hello-ech-and-why-is-it-important\">What is Encrypted Client Hello (ECH), and why is it important?</h1>\n<p>ECH is a security feature available in Firefox and other major web browsers that plugs a gap in existing online privacy and security infrastructure that allows the websites a user is visiting to be accessible to intermediaries on a network, such as ISPs or other unauthorized parties.\n</p>\n<h1 id=\"w_how-do-i-enable-ech-in-firefox\">How do I enable ECH in Firefox?</h1>\n<p>ECH is enabled in Firefox by default since <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">version</a> 119. \n</p>\n<h1 id=\"w_how-do-i-know-ech-is-available-for-me\">How do I know ECH is available for me?</h1>\n<p>ECH is enabled in Firefox by default since <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">version</a> 119. It has the most privacy benefit if used in conjunction with DNS over HTTPS (DoH). See <a href=\"/en-US/kb/dns-over-https\">Configure DNS over HTTPS protection levels in Firefox</a> for details on how to enable DoH.\n</p>\n<h1 id=\"w_does-ech-affect-my-internet-speed\">Does ECH affect my Internet speed?</h1>\n<p>No. ECH requires fetching a very small additional amount of data whilst connecting to a website. This data is only a few hundred bytes in size and too small to have any effect on your internet speed. Firefox retrieves this data simultaneously with performing a DNS lookup when connecting to a website, ensuring there's no extra delay during the connection.\n</p>\n<h1 id=\"w_does-ech-affect-website-compatibility\">Does ECH affect website compatibility?</h1>\n<p>ECH has been carefully designed to interoperate with existing websites and servers. Existing standards require servers to ignore ECH if they don’t understand it, and Firefox understands how to continue the connection without any interruption to your browsing. We have carried a number of studies and tests to ensure that websites will continue to operate correctly.\n</p>\n<h1 id=\"w_can-i-use-ech-alongside-other-security-tools-like-ad-blockers\">Can I use ECH alongside other security tools like ad blockers?</h1>\n<p>Yes, ECH can be used in conjunction with ad blockers. Ad blockers which are integrated with Firefox as an extension will work automatically with ECH and don’t require any changes. DNS-based ad blockers also work with ECH, however users should ensure that their local DNS resolver is using an encrypted transport like DNS over HTTPS to avoid indirectly leaking their visited websites.\n</p>\n<h1 id=\"w_can-i-use-ech-alongside-other-security-tools-like-vpns\">Can I use ECH alongside other security tools like VPNs?</h1>\n<p>Yes, in fact, combining ECH with a VPN can provide an extra layer of privacy and security. ECH works over VPNs transparently with no additional configuration required. \n</p>\n<h1 id=\"w_are-there-any-privacy-concerns-or-drawbacks-associated-with-ech\">Are there any privacy concerns or drawbacks associated with ECH?</h1>\n<p>ECH is a valuable tool for bolstering your online privacy and security, as it encrypts your initial website connections. Nevertheless, it's important to note that many websites won’t support ECH right away, which means connections to those sites won’t benefit from the additional privacy ECH offers. To stay protected, ensure your Firefox browser <a href=\"/en-US/kb/update-firefox-latest-release\">stays up to date</a>, receiving the latest security enhancements, including ECH. Unlike technologies like VPNs, ECH doesn't redirect your browser traffic or involve third parties; it simply adds an extra layer of encryption to your standard connections.\n</p>\n<h1 id=\"w_can-enterprises-disable-ech\">Can Enterprises disable ECH?</h1>\n<p>Yes, ECH can be disabled by policy. For details, see <a href=\"https://mozilla.github.io/policy-templates/#DisableEncryptedClientHello\">Firefox Policy Templates</a>.\n</p>\n<h1 id=\"w_will-users-notice-any-changes-in-their-browsing-experience-as-a-result-of-this-encryption\">Will users notice any changes in their browsing experience as a result of this encryption?</h1>\n<p>Firefox users shouldn’t notice any difference to their usual browsing experience.\n</p>\n<h1 id=\"w_how-will-ech-impact-parental-controls\">How will ECH impact parental controls?</h1>\n<p>If parental controls are applied, ECH encryption is disabled in order to avoid interfering with parental controls.\n</p>\n<h1 id=\"w_how-will-ech-impact-enterprises-that-use-transparent-proxies\">How will ECH impact Enterprises that use transparent proxies?</h1>\n<p>ECH encryption is automatically disabled when proxies or middleboxes which are trusted by the browser are detected, so they remain unaffected.\n</p>\n<h1 id=\"w_which-websites-can-use-ech\">Which websites can use ECH?</h1>\n<p>Any website can employ ECH, as long as it is equipped with the necessary server-side support. Its optimal privacy is often achieved when multiple websites are hosted by a single web server, a common configuration in today's Internet ecosystem.\n</p>\n<h1 id=\"w_why-cant-users-directly-control-ech\">Why can’t users directly control ECH?</h1>\n<p>In line with our commitment to privacy and security by default, we aim to ship Firefox with a comprehensive set of protections enabled by default. Consequently, ECH is enabled by default but won’t be used if family safety software is used or Firefox has been configured as part of an enterprise. This is similar to other security and privacy technologies used in Firefox like TLS 1.3, which also isn’t exposed as a user setting.\n</p>\n<h1 id=\"w_how-can-i-tell-if-ech-is-working-for-me\">How can I tell if ECH is working for me?</h1>\n<p>ECH isn’t visible in the browser UI, but you can check if it's working for you using <a href=\"https://www.cloudflare.com/ssl/encrypted-sni/#esni-checker\">Cloudflare’s Browser Security Check</a>.\n</p>\n<h1 id=\"w_learn-more\">Learn more</h1>\n<ul><li><a href=\"/en-US/kb/understand-encrypted-client-hello\">Understand Encrypted Client Hello (ECH)</a>\n</li><li><a href=\"https://wiki.mozilla.org/Security/Encrypted_Client_Hello\">ECH Technical Article on Mozilla's Wiki (for expert users)</a>\n</li><li><a href=\"/en-US/kb/firefox-dns-over-https\">Firefox DNS over HTTPS</a>\n</li><li><a href=\"/en-US/kb/dns-over-https\">Configure DNS over HTTPS protection levels in Firefox</a>\n</li></ul>",
  "text": "Table of Contents 1 What is Encrypted Client Hello (ECH), and why is it important? 2 How do I enable ECH in Firefox? 3 How do I know ECH is available for me? 4 Does ECH affect my Internet speed? 5 Does ECH affect website compatibility? 6 Can I use ECH alongside other security tools like ad blockers? 7 Can I use ECH alongside other security tools like VPNs? 8 Are there any privacy concerns or drawbacks associated with ECH? 9 Can Enterprises disable ECH? 10 Will users notice any changes in their browsing experience as a result of this encryption? 11 How will ECH impact parental controls? 12 How will ECH impact Enterprises that use transparent proxies? 13 Which websites can use ECH? 14 Why can’t users directly control ECH? 15 How can I tell if ECH is working for me? 16 Learn more What is Encrypted Client Hello (ECH), and why is it important? ECH is a security feature available in Firefox and other major web browsers that plugs a gap in existing online privacy and security infrastructure that allows the websites a user is visiting to be accessible to intermediaries on a network, such as ISPs or other unauthorized parties. How do I enable ECH in Firefox? ECH is enabled in Firefox by default since version 119. How do I know ECH is available for me? ECH is enabled in Firefox by default since version 119. It has the most privacy benefit if used in conjunction with DNS over HTTPS (DoH). See Configure DNS over HTTPS protection levels in Firefox for details on how to enable DoH. Does ECH affect my Internet speed? No. ECH requires fetching a very small additional amount of data whilst connecting to a website. This data is only a few hundred bytes in size and too small to have any effect on your internet speed. Firefox retrieves this data simultaneously with performing a DNS lookup when connecting to a website, ensuring there's no extra delay during the connection. Does ECH affect website compatibility? ECH has been carefully designed to interoperate with existing websites and servers. Existing standards require servers to ignore ECH if they don’t understand it, and Firefox understands how to continue the connection without any interruption to your browsing. We have carried a number of studies and tests to ensure that websites will continue to operate correctly. Can I use ECH alongside other security tools like ad blockers? Yes, ECH can be used in conjunction with ad blockers. Ad blockers which are integrated with Firefox as an extension will work automatically with ECH and don’t require any changes. DNS-based ad blockers also work with ECH, however users should ensure that their local DNS resolver is using an encrypted transport like DNS over HTTPS to avoid indirectly leaking their visited websites. Can I use ECH alongside other security tools like VPNs? Yes, in fact, combining ECH with a VPN can provide an extra layer of privacy and security. ECH works over VPNs transparently with no additional configuration required. Are there any privacy concerns or drawbacks associated with ECH? ECH is a valuable tool for bolstering your online privacy and security, as it encrypts your initial website connections. Nevertheless, it's important to note that many websites won’t support ECH right away, which means connections to those sites won’t benefit from the additional privacy ECH offers. To stay protected, ensure your Firefox browser stays up to date , receiving the latest security enhancements, including ECH. Unlike technologies like VPNs, ECH doesn't redirect your browser traffic or involve third parties; it simply adds an extra layer of encryption to your standard connections. Can Enterprises disable ECH? Yes, ECH can be disabled by policy. For details, see Firefox Policy Templates . Will users notice any changes in their browsing experience as a result of this encryption? Firefox users shouldn’t notice any difference to their usual browsing experience. How will ECH impact parental controls? If parental controls are applied, ECH encryption is disabled in order to avoid interfering with parental controls. How will ECH impact Enterprises that use transparent proxies? ECH encryption is automatically disabled when proxies or middleboxes which are trusted by the browser are detected, so they remain unaffected. Which websites can use ECH? Any website can employ ECH, as long as it is equipped with the necessary server-side support. Its optimal privacy is often achieved when multiple websites are hosted by a single web server, a common configuration in today's Internet ecosystem. Why can’t users directly control ECH? In line with our commitment to privacy and security by default, we aim to ship Firefox with a comprehensive set of protections enabled by default. Consequently, ECH is enabled by default but won’t be used if family safety software is used or Firefox has been configured as part of an enterprise. This is similar to other security and privacy technologies used in Firefox like TLS 1.3, which also isn’t exposed as a user setting. How can I tell if ECH is working for me? ECH isn’t visible in the browser UI, but you can check if it's working for you using Cloudflare’s Browser Security Check . Learn more Understand Encrypted Client Hello (ECH) ECH Technical Article on Mozilla's Wiki (for expert users) Firefox DNS over HTTPS Configure DNS over HTTPS protection levels in Firefox",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 9496,
    "text_bytes": 5354,
    "word_count": 889,
    "downloaded_at": "2025-08-26T10:56:23.239155"
  }
}