{
  "slug": "find-and-install-add-ons-add-features-to-firefox",
  "title": "Find and install add-ons to add features to Firefox",
  "summary": "You can install different types of add-ons, such as extensions to add features to Firefox and themes to change its appearance. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/find-and-install-add-ons-add-features-to-firefox",
  "html": "<p>Add-ons let you add bells and whistles to Firefox. You can get add-ons that compare prices, check the weather, change the look of Firefox, listen to music, or even update your Facebook profile. This article covers the different types of add-ons available and how to find and install them.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-types-of-add-ons-can-i-install\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What types of add-ons can I install?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_viewing-and-managing-your-installed-add-ons\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Viewing and managing your installed add-ons</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-find-and-install-add-ons\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How do I find and install add-ons?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_troubleshooting-add-ons\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Troubleshooting add-ons</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_problems-with-installing-or-uninstalling-add-ons\"><span class=\"tocnumber\">3.1</span> <span class=\"toctext\">Problems with installing or uninstalling add-ons</span></a></li><li class=\"toclevel-2\"><a href=\"#w_problems-caused-by-add-ons\"><span class=\"tocnumber\">3.2</span> <span class=\"toctext\">Problems caused by add-ons</span></a></li></ul></li></ul></div>\n<h1 id=\"w_what-types-of-add-ons-can-i-install\">What types of add-ons can I install?</h1>\n<p>These general types of add-ons can be installed:\n</p>\n<ul><li> <strong><a href=\"https://addons.mozilla.org/firefox/extensions/\">Extensions</a></strong><br>Extensions add new features to Firefox or modify existing ones. There are extensions that allow you to block advertisements, download videos from websites, integrate Firefox with websites like e-mail or Facebook, check your grammar and spelling, and so on. Community-created extensions can be found on <a href=\"https://addons.mozilla.org/firefox/extensions/\">addons.mozilla.org</a>.\n</li><li> <strong><a href=\"/en-US/kb/use-themes-change-look-of-firefox\">Themes</a></strong><br>Themes change the visual appearance of Firefox by setting a custom background image in the browser's header section and the colors used in the tab strip, address bar, menus, and so on. Firefox includes built-in themes and others created by the community can be found on <a href=\"https://addons.mozilla.org/firefox/themes/\">addons.mozilla.org</a>. For more information on built-in themes, see <a href=\"/en-US/kb/built-themes-firefox-alternative-complete-themes\">Built-in themes in Firefox - alternative to complete themes</a>.\n</li><li> <strong>Plugins</strong><br>Firefox automatically downloads and installs the Google Widevine CDM for watching <a href=\"/en-US/kb/enable-drm\">Digital Rights Management (DRM) controlled content</a> and an <a href=\"/en-US/kb/open-h264-plugin-firefox\">OpenH264 plugin</a> for video calls. \n</li><li> <strong><a href=\"https://addons.mozilla.org/firefox/language-tools/\">Dictionaries</a></strong><br><a href=\"/en-US/kb/how-do-i-use-firefox-spell-checker\">Firefox can check your spelling</a>, but not all locales come with a dictionary installed for licensing reasons. You can <a href=\"https://addons.mozilla.org/firefox/language-tools/\">find and install a dictionary</a> for your language.\n</li><li> <strong><a href=\"https://addons.mozilla.org/firefox/language-tools\">Language Packs</a></strong><br>Language packs change the language of Firefox's user interface. You can <a href=\"/en-US/kb/use-firefox-another-language\">change languages in Firefox's settings menu</a> and community-created language packs can be found on <a href=\"https://addons.mozilla.org/firefox/language-tools/\">addons.mozilla.org</a>.\n</li><li> <strong><a href=\"/en-US/kb/change-your-default-search-settings-firefox\">Search engines</a></strong><br>Firefox comes with a number of search engines already installed. You can access them from the <a href=\"/en-US/kb/add-search-bar-firefox-toolbar\">Search bar (if enabled)</a> or directly from the address bar. If you want additional search engines, you can <a href=\"/en-US/kb/add-or-remove-search-engine-firefox\">install them</a> on the websites directly or from <a href=\"https://addons.mozilla.org/firefox/search-tools/\">addons.mozilla.org</a>.\n</li></ul>\n<h2 id=\"w_viewing-and-managing-your-installed-add-ons\">Viewing and managing your installed add-ons</h2>\n<p>Most types of add-ons can be managed directly from Firefox's Add-on Manager. To access the Add-on Manager: \n</p>\n<ol><li> <span class=\"for\" data-for=\"not fx140\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and choose <span class=\"menu\">Add-ons and themes</span>. The Add-ons Manager tab will open.</span><span class=\"for\" data-for=\"fx140\">Click the menu button <img alt=\"IG main menu\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-04-08-05-37-01-6bf1c5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"menu\">Extensions and themes</span>. The Add-ons Manager tab will open.</span>\n</li><li> Select the panel for the type of add-on you wish to view or manage, such as the <span class=\"menu\">Extensions</span> or <span class=\"menu\">Themes</span> panel.\n</li></ol>\n<p>Search engines can be viewed and managed in the <a href=\"/en-US/kb/change-your-default-search-settings-firefox\">Search panel</a> in Firefox Settings\n.\n</p><p>For detailed information on disabling or removing add-ons, see <a href=\"/en-US/kb/disable-or-remove-add-ons\">Disable or remove Add-ons</a>.\n</p>\n<h1 id=\"w_how-do-i-find-and-install-add-ons\">How do I find and install add-ons?</h1>\n<p>Here is an overview to get you started:\n</p>\n<ol><li> Firefox may offer <a href=\"/en-US/kb/personalized-extension-recommendations\">personalized recommendations</a>. Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"for\" data-for=\"not fx140\"><span class=\"menu\">Add-ons and themes</span></span><span class=\"for\" data-for=\"fx140\"><span class=\"menu\">Extensions and themes</span></span> and select <span class=\"menu\">Recommendations</span>.\n\n</li><li> To install a recommended add-on, click the blue <span class=\"button\">+ Install Theme</span> or <span class=\"button\">+ Add to Firefox</span> button, depending on the type of add-on.\n</li></ol>\n<p>At the bottom of the list of recommended add-ons, there's also a <span class=\"button\">Find more add-ons</span> button you can click. It will take you to <a href=\"https://addons.mozilla.org?utm_source=support.mozilla.org&amp;utm_medium=support-article&amp;utm_content=find-and-install-add-ons-add-features-to-firefox\">addons.mozilla.org</a> where you can search for specific add-ons.\n</p>\n<div class=\"note\"><strong>For advanced users:</strong> You can also install a signed add-on from a file. When you install an extension from <a href=\"https://addons.mozilla.org/\">addons.mozilla.org</a> or a developer's website, Firefox will automatically download and install a file with a .xpi extension. If you save this file to your computer, you can later install the add-on using the gear icon <img alt=\"Fx91GearIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-11-22-12-58-07-a6a699.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the upper-right area of the Add-ons Manager <span class=\"menu\">Extensions</span> panel. Select <span class=\"menu\">Install Add-on from file…</span> from the menu, then find and select the file.</div>\n<p>Once an extension has been installed, you can pin its icon to the toolbar for easy access. See <a href=\"/en-US/kb/extensions-button\">Manage your extensions using the extensions button in the toolbar</a> for details.\n</p>\n<h1 id=\"w_troubleshooting-add-ons\">Troubleshooting add-ons</h1>\n<p>For information on troubleshooting problems with extensions or themes, see the articles below.\n</p>\n<h2 id=\"w_problems-with-installing-or-uninstalling-add-ons\">Problems with installing or uninstalling add-ons</h2>\n<ul><li> <a href=\"/en-US/kb/unable-install-add-ons-extensions-or-themes\">Unable to install add-ons (extensions or themes)</a>\n</li><li> <a href=\"/en-US/kb/cannot-remove-add-on-extension-or-theme\">Cannot remove an add-on (extension or theme)</a>\n</li></ul>\n<h2 id=\"w_problems-caused-by-add-ons\">Problems caused by add-ons</h2>\n<ul><li> <a href=\"/en-US/kb/troubleshoot-extensions-themes-to-fix-problems\">Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems</a>\n</li><li> <a href=\"/en-US/kb/troubleshoot-firefox-issues-caused-malware\">Troubleshoot Firefox issues caused by malware</a>\n</li><li> <a href=\"/en-US/kb/remove-toolbar-has-taken-over-your-firefox-search\">Remove a toolbar that has taken over your Firefox search or home page</a>\n</li><li> <a href=\"/en-US/kb/re-enable-add-ons-disabled-when-updating\">Re-enable add-ons that were disabled when updating Firefox</a>\n</li><li> <a href=\"/en-US/kb/add-ons-cause-issues-are-on-blocklist\">Why does Mozilla disable some add-ons from running in Firefox?</a>\n</li><li> <a href=\"/en-US/kb/add-on-signing-in-firefox\">Add-on signing in Firefox</a>\n</li></ul>",
  "text": "Add-ons let you add bells and whistles to Firefox. You can get add-ons that compare prices, check the weather, change the look of Firefox, listen to music, or even update your Facebook profile. This article covers the different types of add-ons available and how to find and install them. Table of Contents 1 What types of add-ons can I install? 1.1 Viewing and managing your installed add-ons 2 How do I find and install add-ons? 3 Troubleshooting add-ons 3.1 Problems with installing or uninstalling add-ons 3.2 Problems caused by add-ons What types of add-ons can I install? These general types of add-ons can be installed: Extensions Extensions add new features to Firefox or modify existing ones. There are extensions that allow you to block advertisements, download videos from websites, integrate Firefox with websites like e-mail or Facebook, check your grammar and spelling, and so on. Community-created extensions can be found on addons.mozilla.org . Themes Themes change the visual appearance of Firefox by setting a custom background image in the browser's header section and the colors used in the tab strip, address bar, menus, and so on. Firefox includes built-in themes and others created by the community can be found on addons.mozilla.org . For more information on built-in themes, see Built-in themes in Firefox - alternative to complete themes . Plugins Firefox automatically downloads and installs the Google Widevine CDM for watching Digital Rights Management (DRM) controlled content and an OpenH264 plugin for video calls. Dictionaries Firefox can check your spelling , but not all locales come with a dictionary installed for licensing reasons. You can find and install a dictionary for your language. Language Packs Language packs change the language of Firefox's user interface. You can change languages in Firefox's settings menu and community-created language packs can be found on addons.mozilla.org . Search engines Firefox comes with a number of search engines already installed. You can access them from the Search bar (if enabled) or directly from the address bar. If you want additional search engines, you can install them on the websites directly or from addons.mozilla.org . Viewing and managing your installed add-ons Most types of add-ons can be managed directly from Firefox's Add-on Manager. To access the Add-on Manager: Click the menu button and choose Add-ons and themes . The Add-ons Manager tab will open. Click the menu button , click Extensions and themes . The Add-ons Manager tab will open. Select the panel for the type of add-on you wish to view or manage, such as the Extensions or Themes panel. Search engines can be viewed and managed in the Search panel in Firefox Settings . For detailed information on disabling or removing add-ons, see Disable or remove Add-ons . How do I find and install add-ons? Here is an overview to get you started: Firefox may offer personalized recommendations . Click the menu button , click Add-ons and themes Extensions and themes and select Recommendations . To install a recommended add-on, click the blue + Install Theme or + Add to Firefox button, depending on the type of add-on. At the bottom of the list of recommended add-ons, there's also a Find more add-ons button you can click. It will take you to addons.mozilla.org where you can search for specific add-ons. For advanced users: You can also install a signed add-on from a file. When you install an extension from addons.mozilla.org or a developer's website, Firefox will automatically download and install a file with a .xpi extension. If you save this file to your computer, you can later install the add-on using the gear icon in the upper-right area of the Add-ons Manager Extensions panel. Select Install Add-on from file… from the menu, then find and select the file. Once an extension has been installed, you can pin its icon to the toolbar for easy access. See Manage your extensions using the extensions button in the toolbar for details. Troubleshooting add-ons For information on troubleshooting problems with extensions or themes, see the articles below. Problems with installing or uninstalling add-ons Unable to install add-ons (extensions or themes) Cannot remove an add-on (extension or theme) Problems caused by add-ons Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems Troubleshoot Firefox issues caused by malware Remove a toolbar that has taken over your Firefox search or home page Re-enable add-ons that were disabled when updating Firefox Why does Mozilla disable some add-ons from running in Firefox? Add-on signing in Firefox",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 9966,
    "text_bytes": 4649,
    "word_count": 745,
    "downloaded_at": "2025-08-26T09:04:20.512736"
  }
}