{
  "slug": "firefox-protection-against-fingerprinting",
  "title": "Firefox's protection against fingerprinting",
  "summary": "Fingerprinting Protection in Firefox protects you from websites that try to identify you based on a set of unique characteristics.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-protection-against-fingerprinting",
  "html": "<p>Like other browsers, Firefox’s functionality is influenced by your operating system, hardware, graphics cards, additional software and even the fonts you install. In some instances, details of your computer are accessible to websites to (for example) help render content in higher resolution or provide instructions for your specific operating system.\n</p><p>However, when all the different aspects a browser exposes are combined, the unique combination can act like a “fingerprint” and makes you identifiable across the web. This “fingerprint” is potentially used to profile you for targeted content without the use of cookies. Firefox’s <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a> blocks a list of “Known Fingerprinters” and limits the information your browser exposes at all times to combat “Suspected Fingerprinters”.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_default-settings\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Default Settings</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-disable-this-protection-for-a-website\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How do I disable this protection for a website?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-enable-or-disable-this-protection-for-all-sites\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How do I enable or disable this protection for all sites?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-can-i-tell-if-this-protection-broke-something\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">How can I tell if this protection broke something?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_report-a-broken-site\"><span class=\"tocnumber\">4.1</span> <span class=\"toctext\">Report a broken site</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_how-does-each-protection-work\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">How does each protection work?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_known-fingerprinters\"><span class=\"tocnumber\">5.1</span> <span class=\"toctext\">Known Fingerprinters</span></a></li><li class=\"toclevel-2\"><a href=\"#w_suspected-fingerprinters\"><span class=\"tocnumber\">5.2</span> <span class=\"toctext\">Suspected Fingerprinters</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<h1 id=\"w_default-settings\">Default Settings</h1>\n<p>Known Fingerprinters Protection is enabled in normal browsing and when Enhanced Tracking Protection is set to Strict.\n</p><p>Both Known Fingerprinters Protection and Suspected Fingerprinters Protection are enabled in Private Browsing and when Enhanced Tracking Protection is set to strict.\n</p><p>Both features can be controlled more granularly when the Custom level of Enhanced Tracking Protection is selected.\n</p>\n<h1 id=\"w_how-do-i-disable-this-protection-for-a-website\">How do I disable this protection for a website?</h1>\n<p>If a site seems broken, try turning off Enhanced Tracking Protection. It disables the protection on that site only. Enhanced Tracking Protection will continue to block trackers on other sites.\n</p>\n<ol><li>Select the shield icon <img alt=\"IG shield\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-05-01-08-10-24-5dc90b.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to the left of the address bar.\n</li><li>Toggle the switch <img alt=\"Fx115 blue toggle\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-02-04-09-53-40-c13770.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> at the top of the panel.\n<dl><dt><img alt=\"Fx91ETPtoggle-on\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-07-10-12-10-57-722b75.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<p>This will turn off Enhanced Tracking Protection for this site. The page will reload automatically and disable protection on this site only.\n</p><p>Follow the same process to turn Enhanced Tracking Protection back on.\n</p>\n<h1 id=\"w_how-do-i-enable-or-disable-this-protection-for-all-sites\">How do I enable or disable this protection for all sites?</h1>\n<ol><li>Launch Firefox on your computer.\n</li><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>In the left-hand sidebar, click <span class=\"menu\">Privacy &amp; Security</span>.\n</li><li><strong>Customize Enhanced Tracking Protection:</strong> Scroll down to the <em>Enhanced Tracking Protection</em> section.\n</li><li><strong>Enable Fingerprinting Protection:</strong> To control Fingerprinting Protection, select the <strong>Custom</strong> option from the Enhanced Tracking Protection settings.\n</li><li><strong>Adjust Fingerprinting Protection Settings:</strong> Once you've selected Custom, you will see options to block <strong>Known fingerprinters</strong> and <strong>Suspected fingerprinters</strong>. Check the boxes next to these options to enable them. Additionally, you can choose whether to block Suspected Fingerprinters in all windows or just in private windows using the dropdown menu located on the right-hand side of this option.\n<dl><dt><img alt=\"Fingerprinting protection\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-09-27-10-39-06-3064e0.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<h1 id=\"w_how-can-i-tell-if-this-protection-broke-something\">How can I tell if this protection broke something?</h1>\n<p>First, try disabling the protections by exempting the page from Enhanced Tracking Protection as described <a href=\"#w_how-do-i-disable-this-protection-for-a-website\">above</a>, and see if that resolves your issue.\n</p><p>Presently, the types of breakage we see most commonly are:\n</p>\n<ul><li>If you have <a href=\"/en-US/kb/change-fonts-and-colors-websites-use\">set a custom font</a> for Firefox to use in Settings and that font is not in the default install list, it will not be used when this protection is active.\n</li><li>Scripts that detect support for emojis may incorrectly fail to detect support when Firefox does actually support them. This would typically result in these emojis being rendered using Unicode text instead of images.\n</li><li>Certain types of image or video effects may not behave as expected, including greenscreen effects and progressive drawing videos (where the image accumulates the results of multiple animations or effects over time).\n</li><li>For languages with extended character sets, certain glyphs may not render and instead display a square “character not found” icon.\n</li></ul>\n<div class=\"for\" data-for=\"fx143\">\n<ul><li>A website that uses touch events from multiple input devices at once may not process these correctly.\n</li><li>A website that attempts to control its window size and maximize it may overlap your taskbar or dock or be slightly smaller than expected.\n</li><li>Websites that perform complex calculations or operations may perform slower.\n</li></ul>\n</div><p>On rare occasions, these fingerprinting protections can completely break a site in an unexpected way; however disabling Enhanced Tracking Protection as <a href=\"#w_how-do-i-disable-this-protection-for-a-website\">described above</a> will resolve the issue if fingerprinting protections were the cause of breakage.\n</p>\n<h2 id=\"w_report-a-broken-site\">Report a broken site</h2>\n<p>If a broken site starts working properly again after turning off the Enhanced Tracking Protection, you can click the shield icon and select <strong>Send report</strong>. This will show the <em>Report a Broken Site</em> panel.\n</p>\n<dl><dt><img alt=\"Fx123-Report broken site panel\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-03-03-18-07-21-3ce5df.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>The <span class=\"button\">Send Report</span> button will send site related data to Mozilla, so future Firefox versions can load the website correctly with Enhanced Tracking Protection enabled for everyone. Filling the optional <strong>Describe the problem</strong> field helps us fix the problem faster. For more details, see <a href=\"/en-US/kb/report-breakage-due-blocking\">How do I report a broken site in Firefox desktop?</a>\n</p>\n<h1 id=\"w_how-does-each-protection-work\">How does each protection work?</h1>\n<h2 id=\"w_known-fingerprinters\">Known Fingerprinters</h2>\n<p>The “Known Fingerprinters” protection feature works by blocking scripts listed in <a href=\"https://disconnect.me/trackerprotection#categories_of_trackers\">Disconnect’s fingerprinting list</a>. This prevents companies specializing in fingerprinting from examining your device and obtaining details about their hardware, software or IP address. While this serves as an initial defense, it does not safeguard you against companies that are not included in the list. Additionally, we sometimes have to create exceptions for this list to ensure that websites continue to work as intended.\n</p>\n<h2 id=\"w_suspected-fingerprinters\">Suspected Fingerprinters</h2>\n<p>To combat fingerprinting attempts that Firefox cannot block (because we are unaware of the script, or because it is integrated with the site in a way such that it cannot be blocked), Firefox will limit the information it exposes to the web at all times, for every webpage. (Potentially limited to Private Browsing only, per the settings above.)\n</p><p>The specific attributes that Firefox alters are:\n</p>\n<ul><li>Random data is introduced to background images when the website reads back the image. If a website merely renders data to the background, it will render without alteration. Although typically this does not happen, if the website reads the image data in the background (and potentially displays it to you again), it will have subtle noise that may affect how the image is displayed.\n</li><li>Locally installed fonts (specifically, fonts that are not in the list of standard fonts shipped by your operating system) will not be used to render text on a page.\n</li></ul>\n<div class=\"for\" data-for=\"fx143\">\n<ul><li>The number of simultaneous touches your hardware supports is reported as either 0, 1, and for all other values, 5.\n</li><li>The Available Screen Resolution (your Screen Resolution subtracting any dock or taskbar) is reported as your Screen Resolution<span class=\"for\" data-for=\"mac,win\"> minus a height of <span class=\"for\" data-for=\"win\">48</span><span class=\"for\" data-for=\"mac\">76</span> pixels</span>.\n</li><li>The number of processor cores is reported as 2.\n</li></ul>\n</div>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/resist-fingerprinting\">Resist Fingerprinting</a>\n</li></ul>",
  "text": "Like other browsers, Firefox’s functionality is influenced by your operating system, hardware, graphics cards, additional software and even the fonts you install. In some instances, details of your computer are accessible to websites to (for example) help render content in higher resolution or provide instructions for your specific operating system. However, when all the different aspects a browser exposes are combined, the unique combination can act like a “fingerprint” and makes you identifiable across the web. This “fingerprint” is potentially used to profile you for targeted content without the use of cookies. Firefox’s Enhanced Tracking Protection blocks a list of “Known Fingerprinters” and limits the information your browser exposes at all times to combat “Suspected Fingerprinters”. Table of Contents 1 Default Settings 2 How do I disable this protection for a website? 3 How do I enable or disable this protection for all sites? 4 How can I tell if this protection broke something? 4.1 Report a broken site 5 How does each protection work? 5.1 Known Fingerprinters 5.2 Suspected Fingerprinters 6 Related articles Default Settings Known Fingerprinters Protection is enabled in normal browsing and when Enhanced Tracking Protection is set to Strict. Both Known Fingerprinters Protection and Suspected Fingerprinters Protection are enabled in Private Browsing and when Enhanced Tracking Protection is set to strict. Both features can be controlled more granularly when the Custom level of Enhanced Tracking Protection is selected. How do I disable this protection for a website? If a site seems broken, try turning off Enhanced Tracking Protection. It disables the protection on that site only. Enhanced Tracking Protection will continue to block trackers on other sites. Select the shield icon to the left of the address bar. Toggle the switch at the top of the panel. This will turn off Enhanced Tracking Protection for this site. The page will reload automatically and disable protection on this site only. Follow the same process to turn Enhanced Tracking Protection back on. How do I enable or disable this protection for all sites? Launch Firefox on your computer. In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the left-hand sidebar, click Privacy & Security . Customize Enhanced Tracking Protection: Scroll down to the Enhanced Tracking Protection section. Enable Fingerprinting Protection: To control Fingerprinting Protection, select the Custom option from the Enhanced Tracking Protection settings. Adjust Fingerprinting Protection Settings: Once you've selected Custom, you will see options to block Known fingerprinters and Suspected fingerprinters . Check the boxes next to these options to enable them. Additionally, you can choose whether to block Suspected Fingerprinters in all windows or just in private windows using the dropdown menu located on the right-hand side of this option. How can I tell if this protection broke something? First, try disabling the protections by exempting the page from Enhanced Tracking Protection as described above , and see if that resolves your issue. Presently, the types of breakage we see most commonly are: If you have set a custom font for Firefox to use in Settings and that font is not in the default install list, it will not be used when this protection is active. Scripts that detect support for emojis may incorrectly fail to detect support when Firefox does actually support them. This would typically result in these emojis being rendered using Unicode text instead of images. Certain types of image or video effects may not behave as expected, including greenscreen effects and progressive drawing videos (where the image accumulates the results of multiple animations or effects over time). For languages with extended character sets, certain glyphs may not render and instead display a square “character not found” icon. A website that uses touch events from multiple input devices at once may not process these correctly. A website that attempts to control its window size and maximize it may overlap your taskbar or dock or be slightly smaller than expected. Websites that perform complex calculations or operations may perform slower. On rare occasions, these fingerprinting protections can completely break a site in an unexpected way; however disabling Enhanced Tracking Protection as described above will resolve the issue if fingerprinting protections were the cause of breakage. Report a broken site If a broken site starts working properly again after turning off the Enhanced Tracking Protection, you can click the shield icon and select Send report . This will show the Report a Broken Site panel. The Send Report button will send site related data to Mozilla, so future Firefox versions can load the website correctly with Enhanced Tracking Protection enabled for everyone. Filling the optional Describe the problem field helps us fix the problem faster. For more details, see How do I report a broken site in Firefox desktop? How does each protection work? Known Fingerprinters The “Known Fingerprinters” protection feature works by blocking scripts listed in Disconnect’s fingerprinting list . This prevents companies specializing in fingerprinting from examining your device and obtaining details about their hardware, software or IP address. While this serves as an initial defense, it does not safeguard you against companies that are not included in the list. Additionally, we sometimes have to create exceptions for this list to ensure that websites continue to work as intended. Suspected Fingerprinters To combat fingerprinting attempts that Firefox cannot block (because we are unaware of the script, or because it is integrated with the site in a way such that it cannot be blocked), Firefox will limit the information it exposes to the web at all times, for every webpage. (Potentially limited to Private Browsing only, per the settings above.) The specific attributes that Firefox alters are: Random data is introduced to background images when the website reads back the image. If a website merely renders data to the background, it will render without alteration. Although typically this does not happen, if the website reads the image data in the background (and potentially displays it to you again), it will have subtle noise that may affect how the image is displayed. Locally installed fonts (specifically, fonts that are not in the list of standard fonts shipped by your operating system) will not be used to render text on a page. The number of simultaneous touches your hardware supports is reported as either 0, 1, and for all other values, 5. The Available Screen Resolution (your Screen Resolution subtracting any dock or taskbar) is reported as your Screen Resolution minus a height of 48 76 pixels . The number of processor cores is reported as 2. Related articles Resist Fingerprinting",
  "products": [
    "firefox"
  ],
  "topics": [
    "advanced-and-experimental-features",
    "tracking-protection"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 12057,
    "text_bytes": 7040,
    "word_count": 1110,
    "downloaded_at": "2025-08-26T10:38:47.168841"
  }
}