{
  "slug": "firefox-advanced-customization-and-configuration",
  "title": "Firefox advanced customization and configuration options",
  "summary": "Advanced Firefox customization options, about:config and userChrome.css/userContent.css modifications, are not recommended.  Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-advanced-customization-and-configuration",
  "html": "<p>Firefox supports a wide range of customization options that are well-suited to all skill levels. The <a href=\"/en-US/kb/customize-firefox-controls-buttons-and-toolbars\">toolbar layout can be customized</a>, numerous <a href=\"/en-US/kb/firefox-options-preferences-and-settings\">settings can be configured</a>, and the <a href=\"https://addons.mozilla.org\">Mozilla Add-ons</a> directory contains a massive library of <a href=\"/en-US/kb/find-and-install-add-ons-add-features-to-firefox\">extensions</a> and <a href=\"/en-US/kb/use-themes-change-look-of-firefox\">themes</a> to add additional functionality and make Firefox reflect your own needs and personality.\n</p><p>Two other forms of advanced configuration allow even further customization: <em>about:config</em> preference modifications and <em>userChrome.css</em> or <em>userContent.css</em> custom style rules. However, Mozilla highly recommends that only the developers consider these customizations, as they could cause unexpected behavior or even break Firefox. Firefox is a work in progress and, to allow for continuous innovation, Mozilla cannot guarantee that future updates won’t impact these customizations.\n</p>\n<div class=\"warning\"><strong>Mozilla does not officially support adding custom style rules with a <span class=\"filepath\">userChrome.css</span> or <span class=\"filepath\">userContent.css</span> file, or using the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a> (<em>about:config</em> page) to modify preference settings.</strong></div>\n<p>If Firefox suddenly appears broken after an update, you may need to <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">use the Refresh feature</a> to restore Firefox to a default state while keeping important data. Alternatively, you can selectively reverse your advanced customization and configuration changes, as follows:\n</p>\n<ul><li>To reverse changes you made to Firefox with a <span class=\"filepath\">userChrome.css</span> or <span class=\"filepath\">userContent.css</span> file, use <em>about:config</em> to <a href=\"/en-US/kb/about-config-editor-firefox#w_resetting-or-deleting-preferences\">reset the preference</a> <span class=\"pref\">toolkit.legacyUserProfileCustomizations.stylesheets</span> to <span class=\"pref\">false</span> and then remove (or rename) the <span class=\"filepath\">userChrome.css</span> or <span class=\"filepath\">userContent.css</span> file located inside the <span class=\"filepath\">chrome</span> folder in your Firefox <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile folder</a>. This also applies to Thunderbird. Please refer to Thunderbird's article: <a href=\"/en-US/kb/userchromecss-js-usercontent-unsupported\">userChrome.css and .js and userContent are unsupported</a>.\n</li><li>To reset all preference modifications, either use <em>about:config</em> to <a href=\"/en-US/kb/about-config-editor-firefox#w_resetting-or-deleting-preferences\">reset all modified preferences</a> or else delete the preference file(s) in your <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile folder</a>, as explained <a href=\"/en-US/kb/reset-preferences-fix-problems#w_solution-2-delete-firefox-preference-files\">here</a>, to restore all preferences to default settings.\n</li></ul>",
  "text": "Firefox supports a wide range of customization options that are well-suited to all skill levels. The toolbar layout can be customized , numerous settings can be configured , and the Mozilla Add-ons directory contains a massive library of extensions and themes to add additional functionality and make Firefox reflect your own needs and personality. Two other forms of advanced configuration allow even further customization: about:config preference modifications and userChrome.css or userContent.css custom style rules. However, Mozilla highly recommends that only the developers consider these customizations, as they could cause unexpected behavior or even break Firefox. Firefox is a work in progress and, to allow for continuous innovation, Mozilla cannot guarantee that future updates won’t impact these customizations. Mozilla does not officially support adding custom style rules with a userChrome.css or userContent.css file, or using the Configuration Editor ( about:config page) to modify preference settings. If Firefox suddenly appears broken after an update, you may need to use the Refresh feature to restore Firefox to a default state while keeping important data. Alternatively, you can selectively reverse your advanced customization and configuration changes, as follows: To reverse changes you made to Firefox with a userChrome.css or userContent.css file, use about:config to reset the preference toolkit.legacyUserProfileCustomizations.stylesheets to false and then remove (or rename) the userChrome.css or userContent.css file located inside the chrome folder in your Firefox profile folder . This also applies to Thunderbird. Please refer to Thunderbird's article: userChrome.css and .js and userContent are unsupported . To reset all preference modifications, either use about:config to reset all modified preferences or else delete the preference file(s) in your profile folder , as explained here , to restore all preferences to default settings.",
  "products": [
    "firefox"
  ],
  "topics": [
    "advanced-and-experimental-features"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3274,
    "text_bytes": 1973,
    "word_count": 280,
    "downloaded_at": "2025-08-26T10:54:35.902659"
  }
}