{
  "slug": "firefox-labs-explore-experimental-features-firefox",
  "title": "Firefox Labs - Explore experimental features in Firefox",
  "summary": "Discover and test experimental features with Firefox Labs, accessible directly from your Firefox settings.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-labs-explore-experimental-features-firefox",
  "html": "<p><em>Firefox Labs</em> is a new section within Firefox settings <span class=\"for\" data-for=\"not fx131\">starting in <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 130, </span>that gives you access to experimental features. These features are in development, and by enabling them, you get a sneak peek at what could be coming to Firefox in the future. Firefox Labs allows you to test these functionalities and share your feedback, helping shape the direction of future updates.\n</p>\n<div class=\"note\"><strong>Note:</strong> To run experiments in Firefox Labs, <a href=\"/en-US/kb/shield\">Studies</a> and <a href=\"/en-US/kb/technical-and-interaction-data\">telemetry</a> must be enabled, which are the default settings. If you’ve opted out of Studies or telemetry, you won’t be able to use Firefox Labs to turn on experiments.</div>\n<h1 id=\"w_whats-inside-firefox-labs\">What’s inside Firefox Labs?</h1>\n<p>Firefox Labs includes a selection of experimental features that are updated regularly. For an up-to-date list of available experiments, visit Firefox Labs directly through your settings. Please note that these features may change frequently as new experiments are added or removed based on testing outcomes.\n</p>\n<h1 id=\"w_access-firefox-labs\">Access Firefox Labs</h1>\n<p>To explore Firefox Labs, follow these steps:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>At the left-hand menu, click on <span class=\"menu\">Firefox Labs</span>.\n</li></ol>\n<dl><dt><img alt=\"Firefox Labs overview\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-09-03-11-06-27-b5e7d9.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div class=\"for\" data-for=\"fx137\"><div class=\"note\"><strong>Note:</strong> The <em>Firefox Labs</em> panel will be missing if <a href=\"/en-US/kb/technical-and-interaction-data\">telemetry</a> has been disabled.</div></div>\n<h1 id=\"w_where-to-share-feedback\">Where to share feedback</h1>\n<p>Since these are experimental features, please share your feedback through the recommended path in each experiment. If there's no explicit recommendation, you can always use our <a href=\"https://connect.mozilla.org/\">Mozilla Connect feedback platform</a> to <a href=\"/en-US/kb/what-mozilla-connect\">share your feedback</a> about an experiment in Firefox Labs, instead of using the Mozilla Support platform.\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/shield\">About Studies</a>\n</li><li><a href=\"/en-US/kb/firefox-privacy-and-security-features\">Firefox privacy and security features</a>\n</li></ul>",
  "text": "Firefox Labs is a new section within Firefox settings starting in Firefox version 130, that gives you access to experimental features. These features are in development, and by enabling them, you get a sneak peek at what could be coming to Firefox in the future. Firefox Labs allows you to test these functionalities and share your feedback, helping shape the direction of future updates. Note: To run experiments in Firefox Labs, Studies and telemetry must be enabled, which are the default settings. If you’ve opted out of Studies or telemetry, you won’t be able to use Firefox Labs to turn on experiments. What’s inside Firefox Labs? Firefox Labs includes a selection of experimental features that are updated regularly. For an up-to-date list of available experiments, visit Firefox Labs directly through your settings. Please note that these features may change frequently as new experiments are added or removed based on testing outcomes. Access Firefox Labs To explore Firefox Labs, follow these steps: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . At the left-hand menu, click on Firefox Labs . Note: The Firefox Labs panel will be missing if telemetry has been disabled. Where to share feedback Since these are experimental features, please share your feedback through the recommended path in each experiment. If there's no explicit recommendation, you can always use our Mozilla Connect feedback platform to share your feedback about an experiment in Firefox Labs, instead of using the Mozilla Support platform. Related articles About Studies Firefox privacy and security features",
  "products": [
    "firefox"
  ],
  "topics": [
    "advanced-and-experimental-features"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3373,
    "text_bytes": 1719,
    "word_count": 275,
    "downloaded_at": "2025-08-26T10:57:06.390029"
  }
}