{
  "slug": "firefox-users-macos-1012-1013-1014-moving-to-extended-support",
  "title": "Firefox users on macOS 10.12, 10.13 and 10.14 moving to Extended Support Release",
  "summary": "Firefox version 115 ESR will be the last supported release for macOS 10.12, 10.13 and 10.14",
  "url": "https://support.mozilla.org/en-US/kb/firefox-users-macos-1012-1013-1014-moving-to-extended-support",
  "html": "<p><a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 115 is the last supported Firefox version for users of macOS 10.12 (Sierra), macOS 10.13 (High Sierra) and macOS 10.14 (Mojave). If you have been using Firefox on these macOS versions, you will be moved to the Firefox <a href=\"https://www.mozilla.org/firefox/enterprise\">Extended Support Release</a> (ESR) channel by an application update.\n</p><p>If you visit the Firefox download page at <a href=\"https://www.mozilla.org/firefox/new/\">https://www.mozilla.org/firefox/new/</a> and you are using macOS 10.12 (Sierra), macOS 10.13 (High Sierra) or macOS 10.14 (Mojave) you will be prompted to download Firefox Extended Support Release (ESR) so that you can install the latest Firefox 115 ESR version.\n</p><p><img alt=\"DownloadFirefoxESR-mac\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-10-03-11-37-03-b8c38a.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"800\">\n</p><p>Mozilla will provide security updates for Firefox 115 ESR until at least August 2025, when the position will be re-evaluated.\n</p>\n<h1 id=\"w_why-has-firefox-ended-support-for-macos-10-12-10-13-and-10-14-users\">Why has Firefox ended support for macOS 10.12, 10.13 and 10.14 users?</h1>\n<p>While Apple doesn’t have an official policy governing security updates for older macOS releases, their ongoing practice has been to support the most recent three releases. The last security update for macOS 10.14 was in July 2021. Unsupported operating systems receive no security updates and have known exploits. With no official support from Apple, maintaining Firefox for obsolete operating systems becomes costly for Mozilla and dangerous for users.\n</p><p>\n</p>\n<h1 id=\"w_can-i-still-browse-safely-with-firefox-macos-10-12-10-13-or-10-14\">Can I still browse safely with Firefox macOS 10.12, 10.13 or 10.14?</h1>\n<p>Mozilla is providing critical security updates through the <a href=\"https://www.mozilla.org/firefox/enterprise\">Firefox ESR</a> channel up until the end of ESR version 115, August 2025. After this, no security updates will be provided and you are strongly encouraged to move to a supported version of macOS.\n</p>\n<h1 id=\"w_how-can-i-get-the-newest-features-of-firefox\">How can I get the newest features of Firefox?</h1>\n<p>If you want to keep your Firefox up to date, with all the latest features and updates, you need to upgrade your operating system to macOS 10.15 or higher. In some cases, Apple may require newer hardware in order to support the newer operating system. After upgrading, you can easily reinstall Firefox and <a href=\"/en-US/kb/switching-devices\">keep all of your settings</a>.\n</p>",
  "text": "Firefox version 115 is the last supported Firefox version for users of macOS 10.12 (Sierra), macOS 10.13 (High Sierra) and macOS 10.14 (Mojave). If you have been using Firefox on these macOS versions, you will be moved to the Firefox Extended Support Release (ESR) channel by an application update. If you visit the Firefox download page at https://www.mozilla.org/firefox/new/ and you are using macOS 10.12 (Sierra), macOS 10.13 (High Sierra) or macOS 10.14 (Mojave) you will be prompted to download Firefox Extended Support Release (ESR) so that you can install the latest Firefox 115 ESR version. Mozilla will provide security updates for Firefox 115 ESR until at least August 2025, when the position will be re-evaluated. Why has Firefox ended support for macOS 10.12, 10.13 and 10.14 users? While Apple doesn’t have an official policy governing security updates for older macOS releases, their ongoing practice has been to support the most recent three releases. The last security update for macOS 10.14 was in July 2021. Unsupported operating systems receive no security updates and have known exploits. With no official support from Apple, maintaining Firefox for obsolete operating systems becomes costly for Mozilla and dangerous for users. Can I still browse safely with Firefox macOS 10.12, 10.13 or 10.14? Mozilla is providing critical security updates through the Firefox ESR channel up until the end of ESR version 115, August 2025. After this, no security updates will be provided and you are strongly encouraged to move to a supported version of macOS. How can I get the newest features of Firefox? If you want to keep your Firefox up to date, with all the latest features and updates, you need to upgrade your operating system to macOS 10.15 or higher. In some cases, Apple may require newer hardware in order to support the newer operating system. After upgrading, you can easily reinstall Firefox and keep all of your settings .",
  "products": [
    "firefox"
  ],
  "topics": [
    "installation-and-updates"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2818,
    "text_bytes": 1947,
    "word_count": 317,
    "downloaded_at": "2025-08-26T10:56:07.632462"
  }
}