{
  "slug": "firefox-suggest-fakespot",
  "title": "Fakespot results in Firefox Suggest",
  "summary": "Shop smarter with Fakespot-powered sponsored searches in Firefox Suggest.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-suggest-fakespot",
  "html": "<div class=\"warning\"><strong>Important Update:</strong> The Review Checker feature is shutting down and will no longer be available after June 10, 2025.</div>\n<p><a href=\"/en-US/kb/firefox-suggest-faq\">Firefox Suggest</a> now features <a href=\"https://www.fakespot.com/\">Fakespot</a> results to help you find high-quality and relevant products while searching. Fakespot uses <a href=\"https://blog.mozilla.org/en/internet-culture/how-does-ai-work/\">AI</a> to detect reviews that are more likely to be untrustworthy, so you can shop with more confidence. This feature is particularly valuable when searching for specific items, such as “OLED TVs” or “waterproof wireless earbuds.” In these cases, we’ll surface a relevant product with more trustworthy reviews and solid ratings.\n</p>\n<div class=\"note\"><strong>Note:</strong> Firefox Suggest is currently available in the United States. For users outside of the US, only local results (browsing history, bookmarks and open tab suggestions) are provided.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_how-does-fakespot-work-in-firefox-suggest\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">How does Fakespot work in Firefox Suggest?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_what-happens-when-you-click-on-a-fakespot-result\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">What happens when you click on a Fakespot result?</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_manage-and-disable-fakespot-results\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Manage and disable Fakespot results</span></a></li><li class=\"toclevel-1\"><a href=\"#w_privacy\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Privacy</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_provide-feedback-on-fakespot-results\"><span class=\"tocnumber\">3.1</span> <span class=\"toctext\">Provide feedback on Fakespot results</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_faqs\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">FAQs</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_can-i-completely-turn-off-fakespot-suggestions-in-firefox-suggest\"><span class=\"tocnumber\">4.1</span> <span class=\"toctext\">Can I completely turn off Fakespot suggestions in Firefox Suggest?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_how-can-i-adjust-how-often-fakespot-suggestions-appear-in-firefox-suggest\"><span class=\"tocnumber\">4.2</span> <span class=\"toctext\">How can I adjust how often Fakespot suggestions appear in Firefox Suggest?</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<h1 id=\"w_how-does-fakespot-work-in-firefox-suggest\">How does Fakespot work in Firefox Suggest?</h1>\n<p>When you type a product-related query in the address bar, Firefox Suggest may display a Fakespot result directly within the suggestions.\n</p>\n<dl><dt><img alt=\"Fakespot sponsored searches in Firefox Suggest\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-09-10-11-42-17-8c3fa8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<h2 id=\"w_what-happens-when-you-click-on-a-fakespot-result\">What happens when you click on a Fakespot result?</h2>\n<p>When you click on a Fakespot result, you’ll be directed to the product page on the merchant’s website. If <a href=\"/en-US/kb/review-checker-review-quality\">Review Checker</a> is enabled, you’ll see detailed insights about the product’s reviews on that page. If it’s not enabled, you’ll be prompted to opt in.\n</p>\n<dl><dt><img alt=\"Review Checker\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-09-10-11-42-57-3bfa56.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<h1 id=\"w_manage-and-disable-fakespot-results\">Manage and disable Fakespot results</h1>\n<p>You can manage how Firefox Suggest shows Fakespot results in the Firefox settings. To adjust these preferences:\n</p>\n<ol><li>Open Firefox.\n</li><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Go to the <span class=\"menu\">Search</span> section.\n</li><li>Under <em>Address bar - Firefox Suggest</em>, you’ll see options to manage suggestions, including toggling Fakespot results on or off by adjusting the <strong>Suggestions from sponsors</strong> option.\n<dl><dt><img alt=\"Suggestions from sponsors\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-09-10-11-43-13-5f01b7.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<p>If you prefer to manage or disable Fakespot suggestions directly from the search bar in Firefox Suggest, follow these steps:\n</p>\n<ol><li><strong>Access the Suggestions Menu:</strong> When a Fakespot suggestion appears in the dropdown, click on the three-dot menu <img alt=\"IG page actions\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-04-30-15-26-42-077193.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> next to it.\n</li><li><strong>Manage Fakespot Suggestions:</strong> Select <span class=\"menu\">Manage Fakespot suggestions</span> from the menu.\n</li><li><strong>Alternative Actions:</strong>\n<dl><dt><ul><li><strong>Don’t show this suggestion:</strong> Use this option to stop seeing the specific Fakespot suggestion that appeared in the dropdown. Other Fakespot suggestions may still appear in future searches.\n</li><li><strong>Don’t show any suggestions:</strong> This option will disable all suggestions from appearing in the search bar, including those from Fakespot, Firefox Suggest and other sources.\n</li></ul>\n</dt></dl>\n<dl><dt><img alt=\"Fakespot sponsored searches settings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-09-10-11-42-32-943359.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<p>For details on how to manage and customize other Firefox Suggest settings, please see <a href=\"/en-US/kb/firefox-suggest\">How to customize Firefox Suggest settings</a>.\n</p>\n<h1 id=\"w_privacy\">Privacy</h1>\n<p>Firefox Suggest, along with its Fakespot integration, is built with a focus on protecting your privacy. Here’s how it works:\n</p>\n<ul><li><strong>Minimal Data Collection:</strong> When you use Firefox Suggest with Fakespot, Mozilla only collects the data necessary to provide the service, such as user engagement data.\n</li><li><strong>Data Usage Transparency:</strong> While Firefox Suggest uses your search activity to deliver more relevant suggestions, this data is processed and stored securely. Mozilla does not collect your browsing history, and your personal data is never sold to third parties.\n</li><li><strong>Optional Feature:</strong> You have full control over Fakespot suggestions in Firefox Suggest. This feature is optional, and you can manage or disable Fakespot suggestions anytime through Firefox settings or right from the search bar. Follow the instructions provided in the section above.\n</li></ul>\n<p>For more information on how Firefox handles your data, please refer to the <a href=\"https://www.mozilla.org/privacy/\">Mozilla Privacy Notice</a>.\n</p><p>For details on how Fakespot and Review Checker manage your data, visit <a href=\"/en-US/kb/review-checker-review-quality#w_protect-your-privacy\">How Review Checker protects your privacy</a> and <a href=\"/en-US/kb/how-review-checker-preserves-user-privacy\">How Review Checker preserves user privacy</a>.\n</p>\n<h2 id=\"w_provide-feedback-on-fakespot-results\">Provide feedback on Fakespot results</h2>\n<p>Your feedback is essential in helping us improve your experience with Firefox Suggest and Fakespot. If you have any comments, concerns, or suggestions about Fakespot results, please share them with us through <a href=\"https://connect.mozilla.org/\">Mozilla Connect</a>.\n</p>\n<h1 id=\"w_faqs\">FAQs</h1>\n<h2 id=\"w_can-i-completely-turn-off-fakespot-suggestions-in-firefox-suggest\">Can I completely turn off Fakespot suggestions in Firefox Suggest?</h2>\n<p>Yes, you can turn off Fakespot suggestions entirely. To do this, go to Firefox Settings, navigate to the Search section, and under <em>Address bar - Firefox Suggest</em>, uncheck the option for <strong>Suggestions from sponsors</strong>. This will disable Fakespot suggestions and other sponsored suggestions from appearing in your search results.\n</p>\n<h2 id=\"w_how-can-i-adjust-how-often-fakespot-suggestions-appear-in-firefox-suggest\">How can I adjust how often Fakespot suggestions appear in Firefox Suggest?</h2>\n<p>If you want to see Fakespot suggestions less frequently, you can manage this directly from the search bar. When a Fakespot suggestion appears, click on the three-dot menu <img alt=\"IG page actions\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-04-30-15-26-42-077193.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> next to it and choose <span class=\"menu\">Show less frequently</span>. This will reduce the frequency of Fakespot suggestions in your search results.\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li> <a href=\"/en-US/kb/review-checker-review-quality\">Shop online with more confidence using Firefox Review Checker</a> \n</li><li> <a href=\"/en-US/kb/how-review-checker-preserves-user-privacy\">How Review Checker preserves user privacy</a>\n</li><li> <a href=\"/en-US/kb/firefox-suggest-faq\">Firefox Suggest FAQ</a>\n</li><li> <a href=\"/en-US/kb/firefox-suggest\">How to customize Firefox Suggest settings</a>\n</li><li> <a href=\"/en-US/kb/address-bar-autocomplete-firefox\">Address bar autocomplete suggestions in Firefox</a>\n</li><li> <a href=\"/en-US/kb/search-suggestions-firefox\">Search suggestions in Firefox</a>\n</li></ul>",
  "text": "Important Update: The Review Checker feature is shutting down and will no longer be available after June 10, 2025. Firefox Suggest now features Fakespot results to help you find high-quality and relevant products while searching. Fakespot uses AI to detect reviews that are more likely to be untrustworthy, so you can shop with more confidence. This feature is particularly valuable when searching for specific items, such as “OLED TVs” or “waterproof wireless earbuds.” In these cases, we’ll surface a relevant product with more trustworthy reviews and solid ratings. Note: Firefox Suggest is currently available in the United States. For users outside of the US, only local results (browsing history, bookmarks and open tab suggestions) are provided. Table of Contents 1 How does Fakespot work in Firefox Suggest? 1.1 What happens when you click on a Fakespot result? 2 Manage and disable Fakespot results 3 Privacy 3.1 Provide feedback on Fakespot results 4 FAQs 4.1 Can I completely turn off Fakespot suggestions in Firefox Suggest? 4.2 How can I adjust how often Fakespot suggestions appear in Firefox Suggest? 5 Related articles How does Fakespot work in Firefox Suggest? When you type a product-related query in the address bar, Firefox Suggest may display a Fakespot result directly within the suggestions. What happens when you click on a Fakespot result? When you click on a Fakespot result, you’ll be directed to the product page on the merchant’s website. If Review Checker is enabled, you’ll see detailed insights about the product’s reviews on that page. If it’s not enabled, you’ll be prompted to opt in. Manage and disable Fakespot results You can manage how Firefox Suggest shows Fakespot results in the Firefox settings. To adjust these preferences: Open Firefox. In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Go to the Search section. Under Address bar - Firefox Suggest , you’ll see options to manage suggestions, including toggling Fakespot results on or off by adjusting the Suggestions from sponsors option. If you prefer to manage or disable Fakespot suggestions directly from the search bar in Firefox Suggest, follow these steps: Access the Suggestions Menu: When a Fakespot suggestion appears in the dropdown, click on the three-dot menu next to it. Manage Fakespot Suggestions: Select Manage Fakespot suggestions from the menu. Alternative Actions: Don’t show this suggestion: Use this option to stop seeing the specific Fakespot suggestion that appeared in the dropdown. Other Fakespot suggestions may still appear in future searches. Don’t show any suggestions: This option will disable all suggestions from appearing in the search bar, including those from Fakespot, Firefox Suggest and other sources. For details on how to manage and customize other Firefox Suggest settings, please see How to customize Firefox Suggest settings . Privacy Firefox Suggest, along with its Fakespot integration, is built with a focus on protecting your privacy. Here’s how it works: Minimal Data Collection: When you use Firefox Suggest with Fakespot, Mozilla only collects the data necessary to provide the service, such as user engagement data. Data Usage Transparency: While Firefox Suggest uses your search activity to deliver more relevant suggestions, this data is processed and stored securely. Mozilla does not collect your browsing history, and your personal data is never sold to third parties. Optional Feature: You have full control over Fakespot suggestions in Firefox Suggest. This feature is optional, and you can manage or disable Fakespot suggestions anytime through Firefox settings or right from the search bar. Follow the instructions provided in the section above. For more information on how Firefox handles your data, please refer to the Mozilla Privacy Notice . For details on how Fakespot and Review Checker manage your data, visit How Review Checker protects your privacy and How Review Checker preserves user privacy . Provide feedback on Fakespot results Your feedback is essential in helping us improve your experience with Firefox Suggest and Fakespot. If you have any comments, concerns, or suggestions about Fakespot results, please share them with us through Mozilla Connect . FAQs Can I completely turn off Fakespot suggestions in Firefox Suggest? Yes, you can turn off Fakespot suggestions entirely. To do this, go to Firefox Settings, navigate to the Search section, and under Address bar - Firefox Suggest , uncheck the option for Suggestions from sponsors . This will disable Fakespot suggestions and other sponsored suggestions from appearing in your search results. How can I adjust how often Fakespot suggestions appear in Firefox Suggest? If you want to see Fakespot suggestions less frequently, you can manage this directly from the search bar. When a Fakespot suggestion appears, click on the three-dot menu next to it and choose Show less frequently . This will reduce the frequency of Fakespot suggestions in your search results. Related articles Shop online with more confidence using Firefox Review Checker How Review Checker preserves user privacy Firefox Suggest FAQ How to customize Firefox Suggest settings Address bar autocomplete suggestions in Firefox Search suggestions in Firefox",
  "products": [
    "firefox"
  ],
  "topics": [
    "advanced-and-experimental-features"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 11112,
    "text_bytes": 5378,
    "word_count": 844,
    "downloaded_at": "2025-08-26T10:56:57.276567"
  }
}