{
  "slug": "firefox-privacy-and-security-features",
  "title": "Firefox privacy and security features",
  "summary": "Check Firefox's most advanced features and settings for safe, private online browsing.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-privacy-and-security-features",
  "html": "<p>When users look for a full-featured browser to navigate the web, privacy and security are the top concern. Firefox recognizes this and offers some of the most advanced and highly customizable privacy and security features in a web browser.\n</p><p>In this article, we go over some of the most notable features we have developed to help put you in control of the information you share and to protect you against online security risks. For more information on how Firefox protects you, visit our <a href=\"https://support.mozilla.org/products/firefox/protect-your-privacy\">privacy and security articles</a>.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_privacy\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Privacy</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_enhanced-tracking-protection\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Enhanced Tracking Protection</span></a></li><li class=\"toclevel-2\"><a href=\"#w_total-cookie-protection\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Total Cookie Protection</span></a></li><li class=\"toclevel-2\"><a href=\"#w_dns-over-https\"><span class=\"tocnumber\">1.3</span> <span class=\"toctext\">DNS over HTTPS</span></a></li><li class=\"toclevel-2\"><a href=\"#w_fingerprinting\"><span class=\"tocnumber\">1.4</span> <span class=\"toctext\">Fingerprinting</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_security\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Security</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_phishing-and-malware-protection\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Phishing and malware protection</span></a></li><li class=\"toclevel-2\"><a href=\"#w_firefox-monitor\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">Firefox Monitor</span></a></li><li class=\"toclevel-2\"><a href=\"#w_https-only-mode\"><span class=\"tocnumber\">2.3</span> <span class=\"toctext\">HTTPS-Only mode</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_privacy-and-security-focused-add-ons\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Privacy and security-focused add-ons</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_containers\"><span class=\"tocnumber\">3.1</span> <span class=\"toctext\">Containers</span></a></li><li class=\"toclevel-2\"><a href=\"#w_firefox-relay\"><span class=\"tocnumber\">3.2</span> <span class=\"toctext\">Firefox Relay</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_related-links\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Related links</span></a></li></ul></div>\n<h1 id=\"w_privacy\">Privacy</h1>\n<p>We work continuously to develop features that prevent your online activity from being traced or spied on. Here’s how Firefox protects your privacy:\n</p>\n<h2 id=\"w_enhanced-tracking-protection\">Enhanced Tracking Protection</h2>\n<p><a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a> blocks known trackers that gather information about your online activity and are hidden in the websites you visit.<span class=\"for\" data-for=\"fx132\"> In <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop#w_strict-enhanced-tracking-protection\">Strict Mode</a> it blocks all cross-site (third-party) cookies.</span>\n</p>\n<h2 id=\"w_total-cookie-protection\">Total Cookie Protection</h2>\n<p><a href=\"/en-US/kb/introducing-total-cookie-protection-standard-mode\">Total Cookie Protection</a> is an improvement to Enhanced Tracking Protection that creates a cookie jar where cookies placed by different websites are isolated to keep them from tracking your online activity across different websites.\n</p>\n<h2 id=\"w_dns-over-https\">DNS over HTTPS</h2>\n<p>When you type a website in the address bar, <a href=\"/en-US/kb/firefox-dns-over-https\">DNS-over-HTTPS</a> sends the domain name you typed to a DNS server using an encrypted HTTPS connection. This prevents third parties from seeing what websites you are trying to access.\n</p>\n<h2 id=\"w_fingerprinting\">Fingerprinting</h2>\n<p>Firefox <a href=\"/en-US/kb/firefox-protection-against-fingerprinting\">fingerprinting protection</a> warns you against websites that collect settings from your browser and computer to profile you. Using this <em>digital fingerprint</em>, they can create a unique profile of you to track you across different websites.\n</p>\n<h1 id=\"w_security\">Security</h1>\n<p>The following features have been developed to help you browse the Internet safely and prevent or take action against external security threats:\n</p>\n<h2 id=\"w_phishing-and-malware-protection\">Phishing and malware protection</h2>\n<p><a href=\"/en-US/kb/how-does-phishing-and-malware-protection-work\">These features</a> will warn you when a page you visit has been reported as a Deceptive Site (sometimes called “phishing” pages), as a source of Unwanted Software or as an Attack Site designed to harm your computer (otherwise known as “malware”).\n</p>\n<h2 id=\"w_firefox-monitor\">Firefox Monitor</h2>\n<p><a href=\"/en-US/kb/get-started-firefox-monitor\">Firefox Monitor</a> warns you if your online accounts were involved in a known data breach. It also empowers users to fight against data breaches by alerting them when they visit a previously breached website.\n</p>\n<h2 id=\"w_https-only-mode\">HTTPS-Only mode</h2>\n<p>This <a href=\"/en-US/kb/https-only-prefs\">security-enhancing mode</a> forces all connections to websites to use a secure encrypted connection called HTTPS.\n</p>\n<h1 id=\"w_privacy-and-security-focused-add-ons\">Privacy and security-focused add-ons</h1>\n<h2 id=\"w_containers\">Containers</h2>\n<p><a href=\"/en-US/kb/containers\">Firefox Multi-Account Containers</a> lets you keep parts of your online life separated into color-coded tabs. Cookies are separated by container, allowing you to use the web with multiple accounts and integrate <a href=\"https://vpn.mozilla.org/\">Mozilla VPN</a> for an extra layer of privacy.\n</p><p>Additionally, you can install the <a href=\"/en-US/kb/facebook-container-prevent-facebook-tracking\">Facebook container</a>, which makes it harder for Facebook and Meta sites to track you around the web. The Facebook Container extension for Firefox helps you take control and isolate your web activity from Facebook.\n</p>\n<h2 id=\"w_firefox-relay\">Firefox Relay</h2>\n<p><a href=\"/en-US/kb/create-email-mask-through-firefox-relay\">Firefox Relay</a> lets you generate email masks that forward to your real inbox. Use it to hide your real email address and protect yourself from hackers and unwanted email.\n</p>\n<h1 id=\"w_related-links\">Related links</h1>\n<p>To learn more about the privacy principles that guide our mission, visit:\n</p>\n<ul><li><a href=\"https://www.mozilla.org/privacy/\">Mozilla Privacy Policy</a>\n</li><li><a href=\"https://www.mozilla.org/about/policy/lean-data/\">Data Privacy Principles</a>\n</li><li><a href=\"https://www.mozilla.org/privacy/firefox/\">Firefox Privacy Notice</a>\n</li><li><a href=\"https://www.mozilla.org/privacy/faq/\">Mozilla's Data Privacy FAQ</a>\n</li></ul>",
  "text": "When users look for a full-featured browser to navigate the web, privacy and security are the top concern. Firefox recognizes this and offers some of the most advanced and highly customizable privacy and security features in a web browser. In this article, we go over some of the most notable features we have developed to help put you in control of the information you share and to protect you against online security risks. For more information on how Firefox protects you, visit our privacy and security articles . Table of Contents 1 Privacy 1.1 Enhanced Tracking Protection 1.2 Total Cookie Protection 1.3 DNS over HTTPS 1.4 Fingerprinting 2 Security 2.1 Phishing and malware protection 2.2 Firefox Monitor 2.3 HTTPS-Only mode 3 Privacy and security-focused add-ons 3.1 Containers 3.2 Firefox Relay 4 Related links Privacy We work continuously to develop features that prevent your online activity from being traced or spied on. Here’s how Firefox protects your privacy: Enhanced Tracking Protection Enhanced Tracking Protection blocks known trackers that gather information about your online activity and are hidden in the websites you visit. In Strict Mode it blocks all cross-site (third-party) cookies. Total Cookie Protection Total Cookie Protection is an improvement to Enhanced Tracking Protection that creates a cookie jar where cookies placed by different websites are isolated to keep them from tracking your online activity across different websites. DNS over HTTPS When you type a website in the address bar, DNS-over-HTTPS sends the domain name you typed to a DNS server using an encrypted HTTPS connection. This prevents third parties from seeing what websites you are trying to access. Fingerprinting Firefox fingerprinting protection warns you against websites that collect settings from your browser and computer to profile you. Using this digital fingerprint , they can create a unique profile of you to track you across different websites. Security The following features have been developed to help you browse the Internet safely and prevent or take action against external security threats: Phishing and malware protection These features will warn you when a page you visit has been reported as a Deceptive Site (sometimes called “phishing” pages), as a source of Unwanted Software or as an Attack Site designed to harm your computer (otherwise known as “malware”). Firefox Monitor Firefox Monitor warns you if your online accounts were involved in a known data breach. It also empowers users to fight against data breaches by alerting them when they visit a previously breached website. HTTPS-Only mode This security-enhancing mode forces all connections to websites to use a secure encrypted connection called HTTPS. Privacy and security-focused add-ons Containers Firefox Multi-Account Containers lets you keep parts of your online life separated into color-coded tabs. Cookies are separated by container, allowing you to use the web with multiple accounts and integrate Mozilla VPN for an extra layer of privacy. Additionally, you can install the Facebook container , which makes it harder for Facebook and Meta sites to track you around the web. The Facebook Container extension for Firefox helps you take control and isolate your web activity from Facebook. Firefox Relay Firefox Relay lets you generate email masks that forward to your real inbox. Use it to hide your real email address and protect yourself from hackers and unwanted email. Related links To learn more about the privacy principles that guide our mission, visit: Mozilla Privacy Policy Data Privacy Principles Firefox Privacy Notice Mozilla's Data Privacy FAQ",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 7003,
    "text_bytes": 3658,
    "word_count": 570,
    "downloaded_at": "2025-08-26T10:55:16.230826"
  }
}