{
  "slug": "firefox-suggest-faq",
  "title": "Firefox Suggest FAQ",
  "summary": "In this article, you'll find answers to frequently asked questions about Firefox Suggest.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-suggest-faq",
  "html": "<p>\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-is-firefox-suggest\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What is Firefox Suggest?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_whats-already-provided\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">What's already provided?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_why-would-you-enable-the-improved-firefox-suggest-experience\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Why would you enable the Improved Firefox Suggest Experience?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-types-of-suggestions-can-i-expect-in-the-address-bar\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">What types of suggestions can I expect in the address bar?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-data-does-mozilla-share-with-its-partners-if-you-allow-or-enable-improve-the-firefox-suggest-experience\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">What data does Mozilla share with its partners if you allow or enable “Improve the Firefox Suggest Experience”?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_who-are-mozillas-partners\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Who are Mozilla’s partners?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-manage-my-firefox-suggest-settings\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">How do I manage my Firefox Suggest settings?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_learn-more\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">Learn more</span></a></li></ul></div>\n<h1 id=\"w_what-is-firefox-suggest\">What is Firefox Suggest?</h1>\n<p><a href=\"https://blog.mozilla.org/en/products/firefox/firefox-news/firefox-suggest/\">Firefox Suggest</a> is a feature that provides  website suggestions from Firefox and Mozilla's partners, as you type into the address bar. It serves as a trustworthy guide to the better web, with relevant suggestions to help you accomplish your goals.\n</p>\n<div class=\"note\"><strong>Note:</strong> Firefox Suggest is currently available in the United States. For users outside of the US, only local results (browsing history, bookmarks and open tab suggestions) are provided.</div>\n<h1 id=\"w_whats-already-provided\">What's already provided?</h1>\n<p>Firefox already provides <a href=\"/en-US/kb/search-suggestions-firefox\">suggestions from your default search engine</a> as you type into the address bar, if enabled in Firefox settings. Firefox also shows you <a href=\"/en-US/kb/address-bar-autocomplete-firefox\">address bar autocomplete suggestions</a> based on local data stored on your own computer, such as websites from your browsing history, bookmarks and open tabs. US users will see this local data under a “Firefox Suggest” label in the address bar drop-down list.\n</p>\n<dl><dt><img alt=\"Fx94FirefoxSuggestResults\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-11-28-06-04-15-c59e26.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>In addition to suggestions based on local data, Firefox Suggest results may also include <em>contextual</em> suggestions from the Web and occasional sponsored suggestions from Mozilla's partners, which are also on by default (any sponsored results will be clearly labeled). These are helpful suggestions from Firefox related to your search query and do not require new types of data. These suggestions from Firefox and Mozilla's partners will connect you with content from many sources, including Wikipedia, Pocket articles and product reviews. See <a href=\"https://blog.mozilla.org/data/2021/09/15/data-and-firefox-suggest/\">this Mozilla blog post</a> to learn more about Firefox Suggest and how it works.\n</p>\n<h1 id=\"w_why-would-you-enable-the-improved-firefox-suggest-experience\">Why would you enable the Improved Firefox Suggest Experience?</h1>\n<p>Firefox is creating a trustworthy guide to the better web, surfacing relevant information to users as they navigate the web. We're doing so by only collecting the data that we need to operate and update the functionality of Firefox Suggest based on our <a href=\"https://www.mozilla.org/en-US/about/policy/lean-data/\">Lean Data</a> and <a href=\"https://www.mozilla.org/en-US/privacy/principles/\">Data Privacy Principles</a>.\n</p><p>When you enable the improved Firefox Suggest experience, it helps Firefox improve the overall search experience and suggest relevant information for users. To enable these suggestions, click <span class=\"button\">Allow suggestions</span> when you receive our notification prompt or go to the <strong>Address Bar — Firefox Suggest</strong> section in Firefox settings to choose the types of suggestions that will show in address bar results.\n</p>\n<h1 id=\"w_what-types-of-suggestions-can-i-expect-in-the-address-bar\">What types of suggestions can I expect in the address bar?</h1>\n<p><img alt=\"Addressbar_suggestions\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-03-28-08-10-41-b15a61.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"500\">\n</p>\n<ul><li><strong>Search Engine Suggestions:</strong> Suggestions from your preferred search engine, if enabled.\n</li><li><strong>Firefox Suggest:</strong> Sponsored and non-sponsored suggestions.\n</li></ul>\n<h1 id=\"w_what-data-does-mozilla-share-with-its-partners-if-you-allow-or-enable-improve-the-firefox-suggest-experience\">What data does Mozilla share with its partners if you allow or enable “Improve the Firefox Suggest Experience”?</h1>\n<p>Before Firefox shares any data with its partners about which suggestions have been displayed or clicked, it removes personally identifying information, and the data is sent through a <a href=\"https://en.wikipedia.org/wiki/Proxy_server\">Mozilla-owned proxy</a> service rather than directly from your computer. <a href=\"https://blog.mozilla.org/data/2021/09/15/data-and-firefox-suggest/\">Learn more about how Mozilla handles data</a>.\n</p>\n<h1 id=\"w_who-are-mozillas-partners\">Who are Mozilla’s partners?</h1>\n<p>Mozilla collaborates with trusted organizations to provide some of the suggestions you see in Firefox. Privacy is fundamental to Mozilla’s <a href=\"https://www.mozilla.org/about/manifesto/\">mission</a>, and we carefully evaluate all partners to ensure they meet our strict privacy standards.\n</p><p>We partner with <a href=\"https://www.admarketplace.com/privacy-policy/\">adMarketplace</a><span class=\"for\" data-for=\"fx135\">,</span><span class=\"for\" data-for=\"not fx135\"> and</span> <a href=\"https://www.yelp.com\">Yelp</a> <span class=\"for\" data-for=\"fx135\">, and <a href=\"/en-US/kb/get-your-local-weather-forecast-firefox-address-bar\">AccuWeather</a> </span> to provide sponsored suggestions that enhance your browsing experience with helpful, context-based information. For transparency, sponsored suggestions are clearly labeled as <em>Sponsored</em> meaning Mozilla receives revenue when users engage with these suggestions, which in turn helps fund Firefox development and other Mozilla initiatives. Through Yelp, we offer recommendations for local businesses and services, such as restaurants and shops.<span class=\"for\" data-for=\"fx135\"> AccuWeather enables us to provide weather-related suggestions, including local forecasts and current conditions. The AccuWeather feature is being rolled out gradually and may not yet be available to all users.</span>\n</p><p>In addition, Firefox provides suggestions from <a href=\"https://www.wikipedia.org/\">Wikipedia</a>, which are not sponsored. Wikipedia results are provided to enrich your browsing experience with useful, community-driven information.\n</p>\n<h1 id=\"w_how-do-i-manage-my-firefox-suggest-settings\">How do I manage my Firefox Suggest settings?</h1>\n<p>You can change the types of suggestions that are displayed at any time. To do so, follow these steps:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Select <span class=\"for\" data-for=\"not fx123\"><span class=\"menu\">Privacy &amp; Security</span></span><span class=\"for\" data-for=\"fx123\"><span class=\"menu\">Search</span></span> on the left and go down to the <strong>Address Bar — Firefox Suggest</strong> section.\n</li><li>To enable or disable any setting, click its checkbox or toggle switch.\n<dl><dt><span class=\"for\" data-for=\"not fx121\"><img alt=\"Fx115AddressBar-FirefoxSuggestSettings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-01-07-06-16-41-32a10e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"fx121\"><img alt=\"Fx121AddressBar-FirefoxSuggestSettings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-01-07-02-22-35-10dade.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</dt></dl>\n</li></ol>\n<h1 id=\"w_learn-more\">Learn more</h1>\n<ul><li><a href=\"/en-US/kb/firefox-suggest\">How to customize Firefox Suggest settings</a>\n</li><li><a href=\"/en-US/kb/get-your-local-weather-forecast-firefox-address-bar\">Get your local weather forecast from the Firefox address bar</a>\n</li><li><a href=\"/en-US/kb/firefox_suggest_mobile\">Firefox Suggest for Mobile</a>\n</li></ul>",
  "text": "Table of Contents 1 What is Firefox Suggest? 2 What's already provided? 3 Why would you enable the Improved Firefox Suggest Experience? 4 What types of suggestions can I expect in the address bar? 5 What data does Mozilla share with its partners if you allow or enable “Improve the Firefox Suggest Experience”? 6 Who are Mozilla’s partners? 7 How do I manage my Firefox Suggest settings? 8 Learn more What is Firefox Suggest? Firefox Suggest is a feature that provides website suggestions from Firefox and Mozilla's partners, as you type into the address bar. It serves as a trustworthy guide to the better web, with relevant suggestions to help you accomplish your goals. Note: Firefox Suggest is currently available in the United States. For users outside of the US, only local results (browsing history, bookmarks and open tab suggestions) are provided. What's already provided? Firefox already provides suggestions from your default search engine as you type into the address bar, if enabled in Firefox settings. Firefox also shows you address bar autocomplete suggestions based on local data stored on your own computer, such as websites from your browsing history, bookmarks and open tabs. US users will see this local data under a “Firefox Suggest” label in the address bar drop-down list. In addition to suggestions based on local data, Firefox Suggest results may also include contextual suggestions from the Web and occasional sponsored suggestions from Mozilla's partners, which are also on by default (any sponsored results will be clearly labeled). These are helpful suggestions from Firefox related to your search query and do not require new types of data. These suggestions from Firefox and Mozilla's partners will connect you with content from many sources, including Wikipedia, Pocket articles and product reviews. See this Mozilla blog post to learn more about Firefox Suggest and how it works. Why would you enable the Improved Firefox Suggest Experience? Firefox is creating a trustworthy guide to the better web, surfacing relevant information to users as they navigate the web. We're doing so by only collecting the data that we need to operate and update the functionality of Firefox Suggest based on our Lean Data and Data Privacy Principles . When you enable the improved Firefox Suggest experience, it helps Firefox improve the overall search experience and suggest relevant information for users. To enable these suggestions, click Allow suggestions when you receive our notification prompt or go to the Address Bar — Firefox Suggest section in Firefox settings to choose the types of suggestions that will show in address bar results. What types of suggestions can I expect in the address bar? Search Engine Suggestions: Suggestions from your preferred search engine, if enabled. Firefox Suggest: Sponsored and non-sponsored suggestions. What data does Mozilla share with its partners if you allow or enable “Improve the Firefox Suggest Experience”? Before Firefox shares any data with its partners about which suggestions have been displayed or clicked, it removes personally identifying information, and the data is sent through a Mozilla-owned proxy service rather than directly from your computer. Learn more about how Mozilla handles data . Who are Mozilla’s partners? Mozilla collaborates with trusted organizations to provide some of the suggestions you see in Firefox. Privacy is fundamental to Mozilla’s mission , and we carefully evaluate all partners to ensure they meet our strict privacy standards. We partner with adMarketplace , and Yelp , and AccuWeather to provide sponsored suggestions that enhance your browsing experience with helpful, context-based information. For transparency, sponsored suggestions are clearly labeled as Sponsored meaning Mozilla receives revenue when users engage with these suggestions, which in turn helps fund Firefox development and other Mozilla initiatives. Through Yelp, we offer recommendations for local businesses and services, such as restaurants and shops. AccuWeather enables us to provide weather-related suggestions, including local forecasts and current conditions. The AccuWeather feature is being rolled out gradually and may not yet be available to all users. In addition, Firefox provides suggestions from Wikipedia , which are not sponsored. Wikipedia results are provided to enrich your browsing experience with useful, community-driven information. How do I manage my Firefox Suggest settings? You can change the types of suggestions that are displayed at any time. To do so, follow these steps: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select Privacy & Security Search on the left and go down to the Address Bar — Firefox Suggest section. To enable or disable any setting, click its checkbox or toggle switch. Learn more How to customize Firefox Suggest settings Get your local weather forecast from the Firefox address bar Firefox Suggest for Mobile",
  "products": [
    "firefox"
  ],
  "topics": [
    "search",
    "search-tag-and-share"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 10324,
    "text_bytes": 5080,
    "word_count": 793,
    "downloaded_at": "2025-08-26T10:54:44.841323"
  }
}