{
  "slug": "firefox-suggest",
  "title": "How to customize Firefox Suggest settings",
  "summary": "Firefox Suggest provides website suggestions as you type into the address bar. Learn about this feature and how to customize your settings.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-suggest",
  "html": "<p>\n</p><p>Firefox Suggest is a feature that provides website suggestions as you type into the address bar. This article describes what types of suggestions can be displayed and how to customize your Firefox Suggest settings.\n</p>\n<div class=\"note\">\n<p><strong>Note:</strong> Firefox Suggest is currently available in the following countries:\n</p>\n<ul><li>The United States\n</li><li>The United Kingdom\n</li><li>France\n</li><li>Germany\n</li><li>Poland\n</li><li>Italy\n</li></ul>\n<p>For users in other places, only local results (browsing history, bookmarks and open tab suggestions) are provided.\n</p>\n</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-settings-are-on-by-default\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What settings are on by default?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-setting-is-opt-in\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">What setting is opt-in?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-determine-what-firefox-suggest-experience-im-in\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How do I determine what Firefox Suggest experience I'm in?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-customize-my-settings\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">How do I customize my settings?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-can-i-manage-my-address-bar-suggestions\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">How can I manage my address bar suggestions?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_firefox-suggest-sponsored-and-non-sponsored\"><span class=\"tocnumber\">5.1</span> <span class=\"toctext\">Firefox Suggest (Sponsored and Non-Sponsored)</span></a></li><li class=\"toclevel-2\"><a href=\"#w_search-engine-historical-suggestions\"><span class=\"tocnumber\">5.2</span> <span class=\"toctext\">Search engine historical suggestions</span></a></li><li class=\"toclevel-2\"><a href=\"#w_autofill-domain\"><span class=\"tocnumber\">5.3</span> <span class=\"toctext\">Autofill (Domain)</span></a></li><li class=\"toclevel-2\"><a href=\"#w_autofill-full-urls\"><span class=\"tocnumber\">5.4</span> <span class=\"toctext\">Autofill (Full URLs)</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_dismissed-suggestions\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Dismissed suggestions</span></a></li><li class=\"toclevel-1\"><a href=\"#w_who-are-mozillas-partners\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">Who are Mozilla’s partners?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_frequently-asked-questions\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">Frequently asked questions</span></a></li></ul></div>\n<h1 id=\"w_what-settings-are-on-by-default\">What settings are on by default?</h1>\n<p>The following Firefox Suggest settings are turned on by default:\n</p>\n<ul><li><strong>Browsing history</strong> – Page titles and web addresses from your history, using local data stored on your own computer\n</li><li><strong>Bookmarks</strong> – Page titles, web addresses and tags from your bookmarks\n</li><li><strong>Open tabs</strong> – Pages you currently have open in other tabs\n</li><li><strong>Search engines</strong> – Relevant search terms or solution buttons related to the task or answer you may be looking for\n</li><li><strong>Suggestions from Firefox</strong> – Contextual suggestions from the web related to your search\n</li><li><strong>Suggestions from sponsors</strong> – Occasional sponsored suggestions related to your search\n</li></ul>\n<p>You can turn these settings on or off at any time. To learn more about Firefox Suggest and your data, see <a href=\"https://blog.mozilla.org/data/2021/09/15/data-and-firefox-suggest/\">this Mozilla blog post</a>.\n</p>\n<h1 id=\"w_what-setting-is-opt-in\">What setting is opt-in?</h1>\n<p>The following Firefox Suggest setting is turned off by default, but all users have the ability to opt in:\n</p>\n<ul><li><strong>Improve the Firefox Suggest experience</strong> – This feature allows Mozilla to process your search query data to improve your search results, and further develop the Firefox Suggest feature. This setting is turned off by default.\n</li></ul>\n<p>The setting will only be turned on if you explicitly select <strong>Allow</strong> via an opt-in prompt or by opening the Firefox settings and selecting <strong>Improve the Firefox Suggest Experience</strong>. The following section describes how to determine if you're opted into this experience and how to customize your settings. To learn more about the additional data being processed when you opt in, see this <a href=\"https://blog.mozilla.org/data/2021/09/15/data-and-firefox-suggest/\">Mozilla blog post</a>.\n</p>\n<h1 id=\"w_how-do-i-determine-what-firefox-suggest-experience-im-in\">How do I determine what Firefox Suggest experience I'm in?</h1>\n<p>To view what Firefox Suggest experience is enabled:\n</p>\n<ol><li>In the Menu bar at the top of the screen, click <strong>Firefox</strong> and then select <strong>Preferences</strong> or <strong>Settings</strong>, depending on your operating system.\n</li><li>Select <span class=\"for\" data-for=\"not fx123\"><span class=\"menu\">Privacy &amp; Security</span></span><span class=\"for\" data-for=\"fx123\"><span class=\"menu\">Search</span></span> in the left panel.\n</li><li>Scroll down to the section labeled <em>Address bar — Firefox Suggest</em>.\n<dl><dt><span class=\"for\" data-for=\"not fx121\"><img alt=\"Fx115AddressBar-FirefoxSuggestSettings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-01-07-06-16-41-32a10e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"fx121\"><img alt=\"Fx121AddressBar-FirefoxSuggestSettings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-01-07-02-22-35-10dade.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</dt></dl>\n<ul><li>If you <strong>don't see</strong> the <em>Improve the Firefox Suggest experience</em> setting, you may be in a region where this option is not yet available.\n</li><li>If you <strong>see</strong> the <em>Improve the Firefox Suggest experience</em>, this setting is turned off by default. The toggle next to the setting turns the feature on or off. For additional clarity, the gray information box will summarize your Firefox Suggest preference choices.\n</li></ul>\n</li></ol>\n<p>If the gray information box shows the text <em>Based on your selection, you’ll receive suggestions from the web, including sponsored sites. We will process your search query data to develop the Firefox Suggest feature</em>, you've <strong>enabled</strong> the expanded Suggest experience.\n</p>\n<dl><dt><img alt=\"Firefox suggest queries enabled\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-12-18-11-23-54-72ed94.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\">\n</dt></dl>\n<p>If the gray information box shows the text <em>Based on your selection, you’ll receive suggestions from the web, including sponsored sites. We won’t process your search query data</em>, the Suggest experience is turned on, but the enhanced Suggest experience is not.\n</p>\n<dl><dt><img alt=\"Firefox suggest queries disabled\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-12-18-11-24-34-631168.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\">\n</dt></dl>\n<h1 id=\"w_how-do-i-customize-my-settings\">How do I customize my settings?</h1>\n<p>To customize your settings for the types of suggestions displayed in the address bar results:\n</p>\n<ol><li>In the Menu bar at the top of the screen, click <strong>Firefox</strong> and then select <strong>Preferences</strong> or <strong>Settings</strong>, depending on your operating system.\n</li><li>Select <span class=\"for\" data-for=\"not fx123\"><span class=\"menu\">Privacy &amp; Security</span></span><span class=\"for\" data-for=\"fx123\"><span class=\"menu\">Search</span></span> in the left panel.\n</li><li>Scroll down to the section labeled <em>Address bar — Firefox Suggest</em>.\n</li><li>Click the checkbox <span class=\"for\" data-for=\"not fx121\">or toggle switch </span>next to the following settings, to enable or disable. See <a href=\"/en-US/kb/address-bar-autocomplete-firefox#w_changing-your-address-bar-settings\">traditional address bar suggestions</a> for the old experience settings.\n<ul><li>Browsing history\n</li><li>Bookmarks\n</li><li>Open tabs\n</li><li>Shortcuts\n</li><li>Search engines\n</li><li>Suggestions from the web\n</li></ul>\n</li></ol>\n<ul><li>Suggestions from sponsors\n</li></ul>\n<p>From here, you can switch the toggle next to <strong>Improve the Firefox Suggest experience</strong> on or off. The gray information box will summarize your new Firefox Suggest preference choices.\n</p><div class=\"for\" data-for=\"fx112\"><p>\n</p>\n<h1 id=\"w_how-can-i-manage-my-address-bar-suggestions\">How can I manage my address bar suggestions?</h1>\n<p>For options to manage your address bar suggestions, click the three-dot menu button next to a suggestion in the address bar.\n</p><p>The following options are available:\n</p>\n<h2 id=\"w_firefox-suggest-sponsored-and-non-sponsored\">Firefox Suggest (Sponsored and Non-Sponsored)</h2>\n<p>This includes contextual suggestions from Firefox and occasional sponsored suggestions related to your search.\n</p>\n<ul><li><strong>Remove from history:</strong> removes the suggestion from your history.\n</li><li><strong>Dismiss this suggestion:</strong> removes the suggestion from the list of options and adds it to your blocklist.\n</li><li><strong>Learn More:</strong> provides more information.\n</li></ul>\n<h2 id=\"w_search-engine-historical-suggestions\">Search engine historical suggestions</h2>\n<ul><li><strong>Remove from history:</strong> removes the suggestion from your history.\n</li><li><strong>Learn More:</strong> provides more information.\n</li></ul>\n<h2 id=\"w_autofill-domain\">Autofill (Domain)</h2>\n<ul><li><strong>Remove from history:</strong> removes the domain suggestion from your history.\n</li><li><strong>Learn More:</strong> provides more information.\n</li></ul>\n<h2 id=\"w_autofill-full-urls\">Autofill (Full URLs)</h2>\n<ul><li><strong>Remove from autofill history:</strong> the suggestion will be removed from your history, and it will not appear as an automatic suggestion the next time you enter the same query.\n</li><li><strong>Learn More:</strong> provides more information.\n</li></ul>\n<h1 id=\"w_dismissed-suggestions\">Dismissed suggestions</h1>\n<p>When you dismiss a suggestion from the results list, it is placed on blocklist and is no longer included in future search results.\n</p><p>The full experience is available in the US, and we’re working on expanding it into other jurisdictions, starting in <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 139.\n</p><p>To restore all dismissed suggestions:\n</p>\n<ol><li>In the Menu bar at the top of the screen, click <strong>Firefox</strong> and then select <strong>Preferences</strong> or <strong>Settings</strong>, depending on your operating system.\n</li><li>Select <span class=\"for\" data-for=\"not fx123\"><span class=\"menu\">Privacy &amp; Security</span></span><span class=\"for\" data-for=\"fx123\"><span class=\"menu\">Search</span></span> in the left panel.\n</li><li>Go to the section labeled <em>Address bar — Firefox Suggest</em>.\n<dl><dt><span class=\"for\" data-for=\"not fx121\"><img alt=\"Fx115settings-AddressBarDismissedSuggestions\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-01-10-02-18-27-161aa8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"fx121\"><img alt=\"Fx121settings-AddressBarDismissedSuggestions\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-01-10-04-02-18-b44b50.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</dt></dl>\n</li><li>Under <em>Dismissed suggestions</em>, click the <span class=\"button\">Restore</span> button next to <strong>Restore dismissed suggestions from sponsors and the web</strong>.\n</li></ol>\n</div>\n<h1 id=\"w_who-are-mozillas-partners\">Who are Mozilla’s partners?</h1>\n<p>Mozilla collaborates with trusted organizations to provide some of the suggestions you see in Firefox. Privacy is fundamental to Mozilla’s <a href=\"https://www.mozilla.org/about/manifesto/\">mission</a>, and we carefully evaluate all partners to ensure they meet our strict privacy standards.\n</p><p>We partner with <a href=\"https://www.admarketplace.com/privacy-policy/\">adMarketplace</a>, Yelp and <a href=\"/en-US/kb/get-your-local-weather-forecast-firefox-address-bar\">AccuWeather</a> to provide sponsored suggestions that enhance your browsing experience with helpful, context-based information. Certain partnerships are limited to the United States, while others are active in every region where Suggest is available. Sponsored suggestions are clearly labeled as Sponsored, meaning Mozilla receives revenue when users engage with these suggestions, which in turn helps fund Firefox development and other Mozilla initiatives. Through adMarketplace, we share recommendations for a variety of products and services. Through Yelp, we offer recommendations for local businesses and services, such as restaurants and shops. AccuWeather enables us to provide weather-related suggestions, including local forecasts and current conditions. The AccuWeather feature is available to all US-based users, and will be rolled out gradually in other regions during spring 2025.\n</p><p>Firefox also provides suggestions from <a href=\"https://www.wikipedia.org/\">Wikipedia</a>, which are not sponsored, and can enrich your browsing experience with useful, community-driven information.\n</p>\n<h1 id=\"w_frequently-asked-questions\">Frequently asked questions</h1>\n<p>If you have more questions about Firefox Suggest, visit the <a href=\"/en-US/kb/firefox-suggest-faq\">Firefox Suggest FAQ</a>.\n</p><p><strong>Learn more</strong>\n</p>\n<ul><li><a href=\"/en-US/kb/get-your-local-weather-forecast-firefox-address-bar\">Get your local weather forecast from the Firefox address bar</a>\n</li></ul>",
  "text": "Firefox Suggest is a feature that provides website suggestions as you type into the address bar. This article describes what types of suggestions can be displayed and how to customize your Firefox Suggest settings. Note: Firefox Suggest is currently available in the following countries: The United States The United Kingdom France Germany Poland Italy For users in other places, only local results (browsing history, bookmarks and open tab suggestions) are provided. Table of Contents 1 What settings are on by default? 2 What setting is opt-in? 3 How do I determine what Firefox Suggest experience I'm in? 4 How do I customize my settings? 5 How can I manage my address bar suggestions? 5.1 Firefox Suggest (Sponsored and Non-Sponsored) 5.2 Search engine historical suggestions 5.3 Autofill (Domain) 5.4 Autofill (Full URLs) 6 Dismissed suggestions 7 Who are Mozilla’s partners? 8 Frequently asked questions What settings are on by default? The following Firefox Suggest settings are turned on by default: Browsing history – Page titles and web addresses from your history, using local data stored on your own computer Bookmarks – Page titles, web addresses and tags from your bookmarks Open tabs – Pages you currently have open in other tabs Search engines – Relevant search terms or solution buttons related to the task or answer you may be looking for Suggestions from Firefox – Contextual suggestions from the web related to your search Suggestions from sponsors – Occasional sponsored suggestions related to your search You can turn these settings on or off at any time. To learn more about Firefox Suggest and your data, see this Mozilla blog post . What setting is opt-in? The following Firefox Suggest setting is turned off by default, but all users have the ability to opt in: Improve the Firefox Suggest experience – This feature allows Mozilla to process your search query data to improve your search results, and further develop the Firefox Suggest feature. This setting is turned off by default. The setting will only be turned on if you explicitly select Allow via an opt-in prompt or by opening the Firefox settings and selecting Improve the Firefox Suggest Experience . The following section describes how to determine if you're opted into this experience and how to customize your settings. To learn more about the additional data being processed when you opt in, see this Mozilla blog post . How do I determine what Firefox Suggest experience I'm in? To view what Firefox Suggest experience is enabled: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your operating system. Select Privacy & Security Search in the left panel. Scroll down to the section labeled Address bar — Firefox Suggest . If you don't see the Improve the Firefox Suggest experience setting, you may be in a region where this option is not yet available. If you see the Improve the Firefox Suggest experience , this setting is turned off by default. The toggle next to the setting turns the feature on or off. For additional clarity, the gray information box will summarize your Firefox Suggest preference choices. If the gray information box shows the text Based on your selection, you’ll receive suggestions from the web, including sponsored sites. We will process your search query data to develop the Firefox Suggest feature , you've enabled the expanded Suggest experience. If the gray information box shows the text Based on your selection, you’ll receive suggestions from the web, including sponsored sites. We won’t process your search query data , the Suggest experience is turned on, but the enhanced Suggest experience is not. How do I customize my settings? To customize your settings for the types of suggestions displayed in the address bar results: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your operating system. Select Privacy & Security Search in the left panel. Scroll down to the section labeled Address bar — Firefox Suggest . Click the checkbox or toggle switch next to the following settings, to enable or disable. See traditional address bar suggestions for the old experience settings. Browsing history Bookmarks Open tabs Shortcuts Search engines Suggestions from the web Suggestions from sponsors From here, you can switch the toggle next to Improve the Firefox Suggest experience on or off. The gray information box will summarize your new Firefox Suggest preference choices. How can I manage my address bar suggestions? For options to manage your address bar suggestions, click the three-dot menu button next to a suggestion in the address bar. The following options are available: Firefox Suggest (Sponsored and Non-Sponsored) This includes contextual suggestions from Firefox and occasional sponsored suggestions related to your search. Remove from history: removes the suggestion from your history. Dismiss this suggestion: removes the suggestion from the list of options and adds it to your blocklist. Learn More: provides more information. Search engine historical suggestions Remove from history: removes the suggestion from your history. Learn More: provides more information. Autofill (Domain) Remove from history: removes the domain suggestion from your history. Learn More: provides more information. Autofill (Full URLs) Remove from autofill history: the suggestion will be removed from your history, and it will not appear as an automatic suggestion the next time you enter the same query. Learn More: provides more information. Dismissed suggestions When you dismiss a suggestion from the results list, it is placed on blocklist and is no longer included in future search results. The full experience is available in the US, and we’re working on expanding it into other jurisdictions, starting in Firefox version 139. To restore all dismissed suggestions: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your operating system. Select Privacy & Security Search in the left panel. Go to the section labeled Address bar — Firefox Suggest . Under Dismissed suggestions , click the Restore button next to Restore dismissed suggestions from sponsors and the web . Who are Mozilla’s partners? Mozilla collaborates with trusted organizations to provide some of the suggestions you see in Firefox. Privacy is fundamental to Mozilla’s mission , and we carefully evaluate all partners to ensure they meet our strict privacy standards. We partner with adMarketplace , Yelp and AccuWeather to provide sponsored suggestions that enhance your browsing experience with helpful, context-based information. Certain partnerships are limited to the United States, while others are active in every region where Suggest is available. Sponsored suggestions are clearly labeled as Sponsored, meaning Mozilla receives revenue when users engage with these suggestions, which in turn helps fund Firefox development and other Mozilla initiatives. Through adMarketplace, we share recommendations for a variety of products and services. Through Yelp, we offer recommendations for local businesses and services, such as restaurants and shops. AccuWeather enables us to provide weather-related suggestions, including local forecasts and current conditions. The AccuWeather feature is available to all US-based users, and will be rolled out gradually in other regions during spring 2025. Firefox also provides suggestions from Wikipedia , which are not sponsored, and can enrich your browsing experience with useful, community-driven information. Frequently asked questions If you have more questions about Firefox Suggest, visit the Firefox Suggest FAQ . Learn more Get your local weather forecast from the Firefox address bar",
  "products": [
    "firefox"
  ],
  "topics": [
    "search",
    "search-tag-and-share"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 14870,
    "text_bytes": 7821,
    "word_count": 1234,
    "downloaded_at": "2025-08-26T10:54:26.949895"
  }
}