{
  "slug": "firefox-cant-load-websites-other-browsers-can",
  "title": "Firefox can't load websites but other browsers can",
  "summary": "We'll explain errors such as \"Server not found\" or \"Unable to connect\"  and how to fix problems where Firefox can't access websites but other browsers can.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-cant-load-websites-other-browsers-can",
  "html": "<p>This article describes problems where Firefox cannot load websites but other Web browsers (such as <span class=\"for\" data-for=\"win\">Microsoft Edge or Internet Explorer</span><span class=\"for\" data-for=\"mac\">Safari</span><span class=\"for\" data-for=\"linux\">Epiphany on Gnome or Konqueror on KDE</span>) can. When this happens, Firefox may show a <em>Server not found</em> or <em>Unable to connect</em> error message.\n</p>\n<ul><li>For other error messages that display when you try to view websites in Firefox, see <a href=\"/en-US/kb/websites-dont-load-troubleshoot-and-fix-errors\">Websites don't load - troubleshoot and fix error messages</a>.\n</li><li>If none of the Web browsers on your computer can load websites, see <a href=\"/en-US/kb/firefox-and-other-browsers-cant-load-websites\">Firefox and other browsers can't load websites</a>.\n</li></ul>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_internet-security-software-blocking-firefox\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Internet Security software blocking Firefox</span></a></li><li class=\"toclevel-1\"><a href=\"#w_firefox-connection-settings\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Firefox connection settings</span></a></li><li class=\"toclevel-1\"><a href=\"#w_ipv6\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">IPv6</span></a></li><li class=\"toclevel-1\"><a href=\"#w_dns-prefetching\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">DNS Prefetching</span></a></li><li class=\"toclevel-1\"><a href=\"#w_firefox-cannot-load-certain-websites\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Firefox cannot load certain websites</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_check-for-malware\"><span class=\"tocnumber\">5.1</span> <span class=\"toctext\">Check for malware</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_check-if-an-extension-is-causing-the-problem\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Check if an extension is causing the problem</span></a></li></ul></div>\n<h1 id=\"w_internet-security-software-blocking-firefox\">Internet Security software blocking Firefox</h1>\n<p>If you were able to load websites until you updated Firefox or until your Internet security software was updated, reconfigured or a new one was added, your Internet security software (including firewalls, antivirus programs, anti-spyware programs, and more) is likely preventing Firefox from connecting to the Internet.\n</p>\n<div class=\"note\"><strong>Note:</strong> Some Internet security programs can block Internet access even when they are disabled.</div>\n<p>So, you should make sure your Internet security software is up-to-date and remove Firefox from your program's list of trusted or recognized programs, then add it back. For instructions on how to configure some programs, see <a href=\"/en-US/kb/configure-firewalls-so-firefox-can-access-internet\">Configure firewalls so that Firefox can access the Internet</a>.\n</p>\n<h1 id=\"w_firefox-connection-settings\">Firefox connection settings</h1>\n<p>If you connect to the Internet through a proxy server that is having connection problems, you will not be able to load websites. To check your <a href=\"/en-US/kb/connection-settings-firefox\">connection settings in Firefox</a>:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>In the <span class=\"menu\">General</span> panel scroll down to the <strong>Network Settings</strong> section.\n</li><li>In the <em>Network Settings</em> section click <span class=\"button\">Settings…</span>.\n</li><li>Change your proxy settings:\n<ul><li>If you don't connect to the Internet through a proxy (or don't know whether you connect through a proxy), select <strong>No Proxy</strong>.\n</li><li>If you connect to the Internet through a proxy, compare Firefox's settings to another browser's (which is working normally).\n</li></ul>\n</li><li>Close the <em>Connection Settings</em> dialog.\n</li><li>Close the <span class=\"menu\">Settings</span> page. Any changes you've made will automatically be saved.\n\n</li></ol>\n<div class=\"note\"><strong>Note:</strong> If you find that changes you make to your Firefox connection settings are not remembered when you restart Firefox, see <a href=\"/en-US/kb/how-to-fix-preferences-wont-save\">How to fix preferences that won't save</a>.</div>\n<h1 id=\"w_ipv6\">IPv6</h1>\n<p>Firefox supports <a href=\"https://wikipedia.org/wiki/IPv6\">IPv6</a> by default, which may cause connection problems on certain systems. To disable IPv6 in Firefox:\n</p><div class=\"warning\"><strong>Warning:</strong> These instructions are for experienced Firefox users. Changing settings in the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a> (<em>about:config</em>) can have serious effects on your browser’s stability, security and performance.\n<br><strong>Only proceed if you are comfortable with advanced settings and understand the potential impacts</strong>.</div>\n<p></p>\n<ol><li>Type <strong>about:config</strong> in the <a href=\"/en-US/kb/search-firefox-address-bar\">address bar</a> and press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>.<br>A warning page may appear. Click <span class=\"button\">Accept the Risk and Continue</span> to go to the <em>about:config</em> page.\n\n</li><li>Enter <strong>network.dns.disableIPv6</strong> in the search field.\n</li><li>In the list of preferences click the <em>Toggle</em> <img alt=\"Fx71aboutconfig-ToggleButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-29-08-56-36-b0ab10.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button next to <span class=\"pref\">network.dns.disableIPv6</span> to set its value to <span class=\"pref\">true</span>.\n</li></ol>\n<h1 id=\"w_dns-prefetching\">DNS Prefetching</h1>\n<p>Firefox attempts to speed up loading new websites by using DNS Prefetching, which can cause page load errors with some system configurations. To disable DNS Prefetching:\n</p><div class=\"warning\"><strong>Warning:</strong> These instructions are for experienced Firefox users. Changing settings in the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a> (<em>about:config</em>) can have serious effects on your browser’s stability, security and performance.\n<br><strong>Only proceed if you are comfortable with advanced settings and understand the potential impacts</strong>.</div>\n<p></p>\n<ol><li>Type <strong>about:config</strong> in the <a href=\"/en-US/kb/search-firefox-address-bar\">address bar</a> and press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>.<br>A warning page may appear. Click <span class=\"button\">Accept the Risk and Continue</span> to go to the <em>about:config</em> page.\n\n</li><li>Enter <strong>network.dns.disablePrefetch</strong> in the search field.\n<ul><li>If such preference doesn't already exist, select <strong>Boolean</strong> and click the <em>Add</em> <img alt=\"Fx71aboutconfig-AddButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-11-04-06-37-13-6f14d8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button.\n</li></ul>\n</li><li>Click the <em>Toggle</em> <img alt=\"Fx71aboutconfig-ToggleButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-29-08-56-36-b0ab10.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button to set the preference value to <span class=\"pref\">true</span>, if it's not already set.\n</li></ol>\n<h1 id=\"w_firefox-cannot-load-certain-websites\">Firefox cannot load certain websites</h1>\n<p>If you find that Firefox can load some websites but not others, first clear your Firefox cookies and cache:\n</p><div class=\"for\" data-for=\"not fx128\">\n<ol><li> Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the menu panel.\n\n</li><li> Click <span class=\"menu\">History</span> and select <span class=\"menu\">Clear recent history…</span>\n</li><li> In the <em>Time range to clear:</em> drop-down, select <strong>Everything</strong>.\n</li><li> Below the drop-down menu, select both <strong>Cookies</strong> and <strong>Cache</strong>. Make sure other items you want to keep are not selected.\n</li><li> Click <span class=\"button\">Clear Now</span>.\n</li></ol>\n</div><div class=\"for\" data-for=\"fx128\">\n<ol><li> Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the menu panel.\n\n</li><li> Click <span class=\"menu\">History</span> and select <span class=\"menu\">Clear recent history…</span>\n</li><li> In the <em>When:</em> drop-down, select <strong>Everything</strong>.\n</li><li> Below the drop-down menu, select both  <strong>Cookies and site data</strong> and <strong>Temporary cached files and pages</strong>. Make sure other items you want to keep are not selected.\n</li><li> Click <span class=\"button\">Clear</span>.\n</li></ol>\n</div>\n<p></p>\n<h2 id=\"w_check-for-malware\">Check for malware</h2>\n<p>If clearing the cookies and cache didn't help, you should check your computer for <a href=\"https://wikipedia.org/wiki/Malware\">malware</a>. Certain types of malware are known to target Firefox and can prevent it from loading various websites:\n</p>\n<ul><li>If you have an antivirus or Internet security program, update its detections database and do a full scan of your system.\n</li><li>If you still have problems, follow the instructions in <a href=\"/en-US/kb/troubleshoot-firefox-issues-caused-malware\">Troubleshoot Firefox issues caused by malware</a>.\n</li></ul>\n<h1 id=\"w_check-if-an-extension-is-causing-the-problem\">Check if an extension is causing the problem</h1>\n<p>Firefox extensions could be causing the issue, especially the ones that have network access and/or those that rely on manipulating webpage content. Try disabling your extensions in the Add-ons Manager one by one and then reload the page. See <a href=\"/en-US/kb/disable-or-remove-add-ons\">Disable or remove Add-ons</a> and <a href=\"/en-US/kb/troubleshoot-extensions-themes-to-fix-problems\">Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems</a> for more information.\n</p><p><br><br>\n<em><strong>Based on information from <a href=\"https://kb.mozillazine.org/Error_loading_websites\">Error loading websites (mozillaZine KB)</a></strong></em>\n</p>",
  "text": "This article describes problems where Firefox cannot load websites but other Web browsers (such as Microsoft Edge or Internet Explorer Safari Epiphany on Gnome or Konqueror on KDE ) can. When this happens, Firefox may show a Server not found or Unable to connect error message. For other error messages that display when you try to view websites in Firefox, see Websites don't load - troubleshoot and fix error messages . If none of the Web browsers on your computer can load websites, see Firefox and other browsers can't load websites . Table of Contents 1 Internet Security software blocking Firefox 2 Firefox connection settings 3 IPv6 4 DNS Prefetching 5 Firefox cannot load certain websites 5.1 Check for malware 6 Check if an extension is causing the problem Internet Security software blocking Firefox If you were able to load websites until you updated Firefox or until your Internet security software was updated, reconfigured or a new one was added, your Internet security software (including firewalls, antivirus programs, anti-spyware programs, and more) is likely preventing Firefox from connecting to the Internet. Note: Some Internet security programs can block Internet access even when they are disabled. So, you should make sure your Internet security software is up-to-date and remove Firefox from your program's list of trusted or recognized programs, then add it back. For instructions on how to configure some programs, see Configure firewalls so that Firefox can access the Internet . Firefox connection settings If you connect to the Internet through a proxy server that is having connection problems, you will not be able to load websites. To check your connection settings in Firefox : In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the General panel scroll down to the Network Settings section. In the Network Settings section click Settings… . Change your proxy settings: If you don't connect to the Internet through a proxy (or don't know whether you connect through a proxy), select No Proxy . If you connect to the Internet through a proxy, compare Firefox's settings to another browser's (which is working normally). Close the Connection Settings dialog. Close the Settings page. Any changes you've made will automatically be saved. Note: If you find that changes you make to your Firefox connection settings are not remembered when you restart Firefox, see How to fix preferences that won't save . IPv6 Firefox supports IPv6 by default, which may cause connection problems on certain systems. To disable IPv6 in Firefox: Warning: These instructions are for experienced Firefox users. Changing settings in the Configuration Editor ( about:config ) can have serious effects on your browser’s stability, security and performance. Only proceed if you are comfortable with advanced settings and understand the potential impacts . Type about:config in the address bar and press Enter Return . A warning page may appear. Click Accept the Risk and Continue to go to the about:config page. Enter network.dns.disableIPv6 in the search field. In the list of preferences click the Toggle button next to network.dns.disableIPv6 to set its value to true . DNS Prefetching Firefox attempts to speed up loading new websites by using DNS Prefetching, which can cause page load errors with some system configurations. To disable DNS Prefetching: Warning: These instructions are for experienced Firefox users. Changing settings in the Configuration Editor ( about:config ) can have serious effects on your browser’s stability, security and performance. Only proceed if you are comfortable with advanced settings and understand the potential impacts . Type about:config in the address bar and press Enter Return . A warning page may appear. Click Accept the Risk and Continue to go to the about:config page. Enter network.dns.disablePrefetch in the search field. If such preference doesn't already exist, select Boolean and click the Add button. Click the Toggle button to set the preference value to true , if it's not already set. Firefox cannot load certain websites If you find that Firefox can load some websites but not others, first clear your Firefox cookies and cache: Click the menu button to open the menu panel. Click History and select Clear recent history… In the Time range to clear: drop-down, select Everything . Below the drop-down menu, select both Cookies and Cache . Make sure other items you want to keep are not selected. Click Clear Now . Click the menu button to open the menu panel. Click History and select Clear recent history… In the When: drop-down, select Everything . Below the drop-down menu, select both Cookies and site data and Temporary cached files and pages . Make sure other items you want to keep are not selected. Click Clear . Check for malware If clearing the cookies and cache didn't help, you should check your computer for malware . Certain types of malware are known to target Firefox and can prevent it from loading various websites: If you have an antivirus or Internet security program, update its detections database and do a full scan of your system. If you still have problems, follow the instructions in Troubleshoot Firefox issues caused by malware . Check if an extension is causing the problem Firefox extensions could be causing the issue, especially the ones that have network access and/or those that rely on manipulating webpage content. Try disabling your extensions in the Add-ons Manager one by one and then reload the page. See Disable or remove Add-ons and Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems for more information. Based on information from Error loading websites (mozillaZine KB)",
  "products": [
    "firefox"
  ],
  "topics": [
    "performance-and-connectivity",
    "site-breakages"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 11927,
    "text_bytes": 5854,
    "word_count": 946,
    "downloaded_at": "2025-08-26T09:04:32.664507"
  }
}