{
  "slug": "firefox-and-other-browsers-cant-load-websites",
  "title": "Firefox and other browsers can't load websites",
  "summary": "If no web browsers on your computer can load websites, it indicates a problem with your Internet connection. The article describes some troubleshooting methods.",
  "url": "https://support.mozilla.org/en-US/kb/firefox-and-other-browsers-cant-load-websites",
  "html": "<p>If you're having the same problems loading websites on every browser, these are some possible causes and ways to fix them.\n</p>\n<div class=\"note\"><strong>Note:</strong> Before you proceed, check if your problem also occurs in another browser, such as <span class=\"for\" data-for=\"win\">Internet Explorer</span><span class=\"for\" data-for=\"mac\">Safari</span><span class=\"for\" data-for=\"linux\">Epiphany</span>. If it doesn't, see <a href=\"/en-US/kb/firefox-cant-load-websites-other-browsers-can\">Firefox can't load websites but other browsers can</a>.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_security-software-is-blocking-the-connection\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Security software is blocking the connection</span></a></li><li class=\"toclevel-1\"><a href=\"#w_system-time-is-incorrect\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">System time is incorrect</span></a></li><li class=\"toclevel-1\"><a href=\"#w_dns-cache\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">DNS cache</span></a></li><li class=\"toclevel-1\"><a href=\"#w_wireless-connection\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Wireless connection</span></a></li><li class=\"toclevel-1\"><a href=\"#w_internet-service-provider-problem\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Internet Service Provider problem</span></a></li><li class=\"toclevel-1\"><a href=\"#w_dns-server-problem\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">DNS server problem</span></a></li><li class=\"toclevel-1\"><a href=\"#w_other-resources\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">Other resources</span></a></li></ul></div>\n<h1 id=\"w_security-software-is-blocking-the-connection\">Security software is blocking the connection</h1>\n<p>Check if your Internet security software (including firewalls, antivirus programs, anti-spyware programs and more) is blocking the connection to the Internet. For instructions on how to configure some programs, read <a href=\"/en-US/kb/configure-firewalls-so-firefox-can-access-internet\">Configure firewalls so that Firefox can access the Internet</a>.\n</p>\n<h1 id=\"w_system-time-is-incorrect\">System time is incorrect</h1>\n<p>Make sure your system's date, time and timezone settings are configured correctly. Firefox may have issues validating the website's security certificate if the date/time is incorrect.\n</p>\n<h1 id=\"w_dns-cache\">DNS cache</h1>\n<p>Every web server connected to the Internet is assigned a number known as its IP address. Domain names are assigned to IP addresses through a <a href=\"http://wikipedia.org/wiki/Domain_Name_System\">Domain Name System</a> (DNS) server. Your computer stores recent IP address assignments so it can connect to sites more quickly, but if there is a discrepancy between the DNS server and the IP address assignments on your computer, it will cause every browser on your computer to have problems finding some websites. To remove the recently stored IP address assignments, flush your DNS cache.\n</p><div class=\"for\" data-for=\"win\">\n<ol><li> Hold down the Windows key <span class=\"key\"><img alt=\"Windows Key\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2011-09-20-08-33-13-ff63c4.jpg\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span> and press <span class=\"key\">R</span>.\n</li><li> Type <strong>cmd</strong> and press <span class=\"key\">Enter</span>.\n</li><li> In the command prompt, type <strong>ipconfig /flushdns</strong> and press <span class=\"key\">Enter</span>.\n</li></ol>\n</div><div class=\"for\" data-for=\"mac\"><p>Restart MacOS to flush your DNS cache.\n</p></div><div class=\"for\" data-for=\"linux\">\n<ol><li> Open the <strong>command terminal</strong>.\n</li><li> Run the command <strong>/etc/init.d/nscd restart</strong>\n</li></ol>\n</div>\n<h1 id=\"w_wireless-connection\">Wireless connection</h1>\n<p>If you are using a wireless connection, make sure that you are using the correct access point.\n</p>\n<h1 id=\"w_internet-service-provider-problem\">Internet Service Provider problem</h1>\n<p>Even if your modem and/or router are both on and are not indicating errors, there may be a problem with your Internet Service Provider (ISP). Contact your ISP for more information. \n</p>\n<h1 id=\"w_dns-server-problem\">DNS server problem</h1>\n<p>Your <a href=\"http://en.wikipedia.org/wiki/Domain_Name_System\">Domain Name System</a> (DNS) server translates web addresses (URLs) into IP addresses and is usually provided by your ISP. If the DNS server is overloaded, you may be unable to view some or all websites. For example, if http://74.125.53.99 or http://74.125.159.105 work but <a href=\"http://www.google.com\">http://www.google.com</a> doesn't, you may have a DNS problem. You can use an alternative service such as <a href=\"http://www.opendns.com/\">OpenDNS</a> or <a href=\"http://code.google.com/speed/public-dns/\">Google Public DNS</a>.\n</p>\n<h1 id=\"w_other-resources\">Other resources</h1>\n<p>If neither Firefox nor another browser can load any websites, your problem is external to Firefox and you should seek support elsewhere.\n</p><div class=\"for\" data-for=\"win\">\n<ul><li> See <a href=\"http://windows.microsoft.com/windows/network-connection-problem-help\">Wired and wireless network problems</a> at microsoft.com.\n</li></ul>\n</div><div class=\"for\" data-for=\"mac\">\n<ul><li> See <a href=\"http://support.apple.com/kb/PH21640\">OS X El Capitan: If you can’t connect to the Internet</a> at apple.com.\n</li></ul>\n</div>",
  "text": "If you're having the same problems loading websites on every browser, these are some possible causes and ways to fix them. Note: Before you proceed, check if your problem also occurs in another browser, such as Internet Explorer Safari Epiphany . If it doesn't, see Firefox can't load websites but other browsers can . Table of Contents 1 Security software is blocking the connection 2 System time is incorrect 3 DNS cache 4 Wireless connection 5 Internet Service Provider problem 6 DNS server problem 7 Other resources Security software is blocking the connection Check if your Internet security software (including firewalls, antivirus programs, anti-spyware programs and more) is blocking the connection to the Internet. For instructions on how to configure some programs, read Configure firewalls so that Firefox can access the Internet . System time is incorrect Make sure your system's date, time and timezone settings are configured correctly. Firefox may have issues validating the website's security certificate if the date/time is incorrect. DNS cache Every web server connected to the Internet is assigned a number known as its IP address. Domain names are assigned to IP addresses through a Domain Name System (DNS) server. Your computer stores recent IP address assignments so it can connect to sites more quickly, but if there is a discrepancy between the DNS server and the IP address assignments on your computer, it will cause every browser on your computer to have problems finding some websites. To remove the recently stored IP address assignments, flush your DNS cache. Hold down the Windows key and press R . Type cmd and press Enter . In the command prompt, type ipconfig /flushdns and press Enter . Restart MacOS to flush your DNS cache. Open the command terminal . Run the command /etc/init.d/nscd restart Wireless connection If you are using a wireless connection, make sure that you are using the correct access point. Internet Service Provider problem Even if your modem and/or router are both on and are not indicating errors, there may be a problem with your Internet Service Provider (ISP). Contact your ISP for more information. DNS server problem Your Domain Name System (DNS) server translates web addresses (URLs) into IP addresses and is usually provided by your ISP. If the DNS server is overloaded, you may be unable to view some or all websites. For example, if http://74.125.53.99 or http://74.125.159.105 work but http://www.google.com doesn't, you may have a DNS problem. You can use an alternative service such as OpenDNS or Google Public DNS . Other resources If neither Firefox nor another browser can load any websites, your problem is external to Firefox and you should seek support elsewhere. See Wired and wireless network problems at microsoft.com. See OS X El Capitan: If you can’t connect to the Internet at apple.com.",
  "products": [
    "firefox"
  ],
  "topics": [
    "site-breakages"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5612,
    "text_bytes": 2870,
    "word_count": 466,
    "downloaded_at": "2025-08-26T09:04:24.832273"
  }
}