{
  "slug": "fix-bookmarks-and-history-will-not-be-functional",
  "title": "Fix \"The bookmarks and history system will not be functional\" error message",
  "summary": "This article explains what to do if you see the error message “The bookmarks and history system will not be functional” when you start Firefox.",
  "url": "https://support.mozilla.org/en-US/kb/fix-bookmarks-and-history-will-not-be-functional",
  "html": "<p><strong>Do you see this error message when you start Firefox?</strong>\n</p>\n<div class=\"warning\">The bookmarks and history system will not be functional because one of Firefox's files is in use by another application. Some security software can cause this problem.</div>\n<p>This error happens when a database file that stores bookmarks and browsing history (<span class=\"filepath\">places.sqlite</span>) and related site icons (<span class=\"filepath\">favicons.sqlite</span>) can’t be accessed by Firefox. This article covers troubleshooting steps for a possible solution.\n</p><p><strong>If you don't see the error above and are still having issues with your bookmarks, try one of these articles instead:</strong>\n</p>\n<ul><li><a href=\"/en-US/kb/recover-lost-or-missing-bookmarks\">Recover lost or missing Bookmarks</a>\n</li><li><a href=\"/en-US/kb/cant-add-change-or-save-bookmarks\">Can't add, change or save bookmarks - How to fix</a>\n</li></ul>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_restart-firefox\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Restart Firefox</span></a></li><li class=\"toclevel-1\"><a href=\"#w_restart-your-computer\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Restart your computer</span></a></li><li class=\"toclevel-1\"><a href=\"#w_update-security-software-definitions\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Update Security Software definitions</span></a></li><li class=\"toclevel-1\"><a href=\"#w_create-a-new-database\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Create a new database</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_part-1-open-your-profile-folder\"><span class=\"tocnumber\">4.1</span> <span class=\"toctext\">Part 1 – Open your profile folder</span></a></li><li class=\"toclevel-2\"><a href=\"#w_part-2-create-a-new-database\"><span class=\"tocnumber\">4.2</span> <span class=\"toctext\">Part 2 – Create a new database</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_error-message-still-displays-after-troubleshooting\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Error message still displays after troubleshooting</span></a></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<h1 id=\"w_restart-firefox\">Restart Firefox</h1>\n<p>The most common causes of this error are another program using the file or a problem with the file that was caused when the computer was shut off unexpectedly (like a power failure). The good news is that sometimes, <strong>simply restarting Firefox</strong> is the fix for both problems.\n</p>\n<h1 id=\"w_restart-your-computer\">Restart your computer</h1>\n<p>Most of the time, <strong>restarting your computer and then restarting Firefox</strong> is the fix for both problems.\n</p>\n<h1 id=\"w_update-security-software-definitions\">Update Security Software definitions</h1>\n<p>Occasionally, Security Software like Microsoft's <em>Windows Security</em> application (the built-in antivirus for Windows operating systems) may cause a problem with the file. Open the Windows Security app (formerly Windows Defender).\n</p>\n<ol><li>Click <strong>Virus &amp; threat protection</strong>.\n</li><li>Look for a subsection named “Virus &amp; threat protection updates” or “Protection updates”.\n</li><li>Click the <strong>Check for updates</strong> button.\n</li><li>Once the update is complete, restart Firefox.\n</li></ol>\n<h1 id=\"w_create-a-new-database\">Create a new database</h1>\n<p>If the previous steps don’t take care of things, you can fix this by having Firefox create a new places and favicon database for you. Don’t worry, it’s not as hard as it sounds!\n</p>\n<h2 id=\"w_part-1-open-your-profile-folder\">Part 1 – Open your profile folder</h2>\n<ol><li>From the Help menu, select More Troubleshooting Information. The <strong>Troubleshooting Information</strong> tab will open.\n</li><li>Under the <strong>Application Basics</strong> section next to <em>Profile Folder</em>, click Show in Finder. A window will open that contains your profile folder.\n</li></ol>\n<div class=\"note\"><strong>Note:</strong> If you are unable to open or use Firefox, follow the instructions in <a class=\"new\" href=\"/en-US/kb/new?title=Finding+your+profile+without+opening+Firefox\" title=\"Page does not exist.\">Finding your profile without opening Firefox</a>.</div>\n<p>Leave the Profile folder open and go on to Part 2.\n</p>\n<h2 id=\"w_part-2-create-a-new-database\">Part 2 – Create a new database</h2>\n<ol><li>(Optional) <a href=\"/en-US/kb/restore-bookmarks-from-backup-or-move-them#w_manual-backup\">Create a bookmark backup file</a>.\n</li><li><span class=\"for\" data-for=\"win\">Click the Firefox menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Exit</span>.</span><span class=\"for\" data-for=\"mac\">Click the Firefox menu at the top of the screen and select <span class=\"menu\">Quit Firefox</span>.</span><span class=\"for\" data-for=\"linux\">Click the Firefox menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Quit</span>.</span>\nWait until Firefox has completely quit.\n</li><li>In the Firefox profile folder, find and delete (or rename) the <strong><span class=\"filepath\">favicons.sqlite</span></strong> and <strong><span class=\"filepath\">places.sqlite</span></strong> files.\n<ul><li>You can rename instead of deleting a file to keep it as a backup. <span class=\"for\" data-for=\"win,linux\">Right-click it and select <strong>Rename</strong> from the context menu</span><span class=\"for\" data-for=\"mac\">Click it once to select and click a second time the file name to make it editable</span>, then add <strong>.old</strong> to the end of its name.\n</li></ul>\n</li><li>Delete the <strong><span class=\"filepath\">favicons.sqlite-shm</span></strong>, <strong><span class=\"filepath\">favicons.sqlite-wal</span></strong>, <strong><span class=\"filepath\">places.sqlite-shm</span></strong> and <strong><span class=\"filepath\">places.sqlite-wal</span></strong> files, if they exist.\n</li><li>Finally, reopen Firefox.\n<ul><li>When Firefox reopens, it will create new <span class=\"filepath\">favicons.sqlite</span> and <span class=\"filepath\">places.sqlite</span> database files. Your browsing history will be lost, but Firefox will automatically restore your bookmarks from the most recent <em>bookmarkbackups</em> file.\n</li><li>If your bookmarks weren’t restored, try the steps in <a href=\"/en-US/kb/recover-lost-or-missing-bookmarks\">Recover lost or missing Bookmarks</a>.\n</li></ul>\n</li></ol>\n<h1 id=\"w_error-message-still-displays-after-troubleshooting\">Error message still displays after troubleshooting</h1>\n<p>If the above solutions didn't work, you may be able to resolve the problem with a new Firefox <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile</a>. You can <a href=\"/en-US/kb/profile-manager-create-remove-switch-firefox-profiles#w_manage-profiles-when-firefox-is-open\">use these instructions</a> to create a new Firefox profile and set it as the default profile. When you restart Firefox, it will open with the new profile and, hopefully, you will no longer see the error message. You can then <a href=\"/en-US/kb/restore-bookmarks-passwords-and-data-from-an-old-firefox-profile#w_copying-files-between-profile-folders\">copy important data to the new profile</a> and, if necessary, <a href=\"/en-US/kb/restore-bookmarks-from-backup-or-move-them#w_restoring-from-backups\">restore bookmarks from a backup file</a>, if you have one.\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li> <a href=\"/en-US/kb/bookmarks-firefox\">Bookmarks in Firefox</a>\n</li><li> <a href=\"/en-US/kb/import-bookmarks-html-file\">Import Bookmarks from an HTML file</a>\n</li><li> <a href=\"/en-US/kb/view-recent-bookmarks-and-searches-firefox-android-home\">View bookmarks on your home screen</a>\n</li></ul>",
  "text": "Do you see this error message when you start Firefox? The bookmarks and history system will not be functional because one of Firefox's files is in use by another application. Some security software can cause this problem. This error happens when a database file that stores bookmarks and browsing history ( places.sqlite ) and related site icons ( favicons.sqlite ) can’t be accessed by Firefox. This article covers troubleshooting steps for a possible solution. If you don't see the error above and are still having issues with your bookmarks, try one of these articles instead: Recover lost or missing Bookmarks Can't add, change or save bookmarks - How to fix Table of Contents 1 Restart Firefox 2 Restart your computer 3 Update Security Software definitions 4 Create a new database 4.1 Part 1 – Open your profile folder 4.2 Part 2 – Create a new database 5 Error message still displays after troubleshooting 6 Related articles Restart Firefox The most common causes of this error are another program using the file or a problem with the file that was caused when the computer was shut off unexpectedly (like a power failure). The good news is that sometimes, simply restarting Firefox is the fix for both problems. Restart your computer Most of the time, restarting your computer and then restarting Firefox is the fix for both problems. Update Security Software definitions Occasionally, Security Software like Microsoft's Windows Security application (the built-in antivirus for Windows operating systems) may cause a problem with the file. Open the Windows Security app (formerly Windows Defender). Click Virus & threat protection . Look for a subsection named “Virus & threat protection updates” or “Protection updates”. Click the Check for updates button. Once the update is complete, restart Firefox. Create a new database If the previous steps don’t take care of things, you can fix this by having Firefox create a new places and favicon database for you. Don’t worry, it’s not as hard as it sounds! Part 1 – Open your profile folder From the Help menu, select More Troubleshooting Information. The Troubleshooting Information tab will open. Under the Application Basics section next to Profile Folder , click Show in Finder. A window will open that contains your profile folder. Note: If you are unable to open or use Firefox, follow the instructions in Finding your profile without opening Firefox . Leave the Profile folder open and go on to Part 2. Part 2 – Create a new database (Optional) Create a bookmark backup file . Click the Firefox menu and select Exit . Click the Firefox menu at the top of the screen and select Quit Firefox . Click the Firefox menu and select Quit . Wait until Firefox has completely quit. In the Firefox profile folder, find and delete (or rename) the favicons.sqlite and places.sqlite files. You can rename instead of deleting a file to keep it as a backup. Right-click it and select Rename from the context menu Click it once to select and click a second time the file name to make it editable , then add .old to the end of its name. Delete the favicons.sqlite-shm , favicons.sqlite-wal , places.sqlite-shm and places.sqlite-wal files, if they exist. Finally, reopen Firefox. When Firefox reopens, it will create new favicons.sqlite and places.sqlite database files. Your browsing history will be lost, but Firefox will automatically restore your bookmarks from the most recent bookmarkbackups file. If your bookmarks weren’t restored, try the steps in Recover lost or missing Bookmarks . Error message still displays after troubleshooting If the above solutions didn't work, you may be able to resolve the problem with a new Firefox profile . You can use these instructions to create a new Firefox profile and set it as the default profile. When you restart Firefox, it will open with the new profile and, hopefully, you will no longer see the error message. You can then copy important data to the new profile and, if necessary, restore bookmarks from a backup file , if you have one. Related articles Bookmarks in Firefox Import Bookmarks from an HTML file View bookmarks on your home screen",
  "products": [
    "firefox"
  ],
  "topics": [
    "error-codes",
    "performance-and-connectivity"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 8412,
    "text_bytes": 4141,
    "word_count": 690,
    "downloaded_at": "2025-08-26T10:34:42.374644"
  }
}