{
  "slug": "fix-problems-connecting-websites-after-updating",
  "title": "Fix problems connecting to websites after updating Firefox",
  "summary": "Learn to troubleshoot and fix problems connecting to websites that start immediately after updating to a new version of Firefox.",
  "url": "https://support.mozilla.org/en-US/kb/fix-problems-connecting-websites-after-updating",
  "html": "<p>This article describes how to troubleshoot problems connecting to websites that start immediately after updating Firefox to a new version.\n</p>\n<ul><li> Follow the instructions in this article if you can connect to websites using another browser (such as <span class=\"for\" data-for=\"win\">Internet Explorer</span><span class=\"for\" data-for=\"mac\">Safari</span><span class=\"for\" data-for=\"linux\">Epiphany</span>), but not in Firefox. If no browsers can load websites, see <a href=\"/en-US/kb/firefox-and-other-browsers-cant-load-websites\">Firefox and other browsers can't load websites</a>.\n</li><li> For troubleshooting connection problems unrelated to updating Firefox, see <a href=\"/en-US/kb/firefox-cant-load-websites-other-browsers-can\">Firefox can't load websites but other browsers can</a>.\n</li></ul>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_the-cause\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">The cause</span></a></li><li class=\"toclevel-1\"><a href=\"#w_fixing-the-problem\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Fixing the problem</span></a></li></ul></div>\n<h1 id=\"w_the-cause\">The cause</h1>\n<p>If you were able to load websites until you updated Firefox, your Internet security software (including firewalls, antivirus programs, anti-spyware programs, and more) is likely preventing Firefox from connecting to the Internet.\n</p><p>This problem occurs when your Internet security program was set to trust the previous version of Firefox, but no longer recognizes your updated version as trusted.\n</p>\n<div class=\"note\"><strong>Note: In some cases, disabling an Internet security program or firewall does not stop all of its parts from being active. A program that reports that it is disabled may still be able to block Firefox.</strong></div>\n<h1 id=\"w_fixing-the-problem\">Fixing the problem</h1>\n<p>To allow Firefox to connect to the Internet again:\n</p>\n<ol><li> Make sure your Internet security software is up-to-date (i.e. you are running the latest version).\n</li><li> Remove Firefox from your program's list of trusted or recognized programs, then add it back. For detailed instructions, see <a href=\"/en-US/kb/configure-firewalls-so-firefox-can-access-internet\">Configure firewalls so that Firefox can access the Internet</a>.\n</li></ol>",
  "text": "This article describes how to troubleshoot problems connecting to websites that start immediately after updating Firefox to a new version. Follow the instructions in this article if you can connect to websites using another browser (such as Internet Explorer Safari Epiphany ), but not in Firefox. If no browsers can load websites, see Firefox and other browsers can't load websites . For troubleshooting connection problems unrelated to updating Firefox, see Firefox can't load websites but other browsers can . Table of Contents 1 The cause 2 Fixing the problem The cause If you were able to load websites until you updated Firefox, your Internet security software (including firewalls, antivirus programs, anti-spyware programs, and more) is likely preventing Firefox from connecting to the Internet. This problem occurs when your Internet security program was set to trust the previous version of Firefox, but no longer recognizes your updated version as trusted. Note: In some cases, disabling an Internet security program or firewall does not stop all of its parts from being active. A program that reports that it is disabled may still be able to block Firefox. Fixing the problem To allow Firefox to connect to the Internet again: Make sure your Internet security software is up-to-date (i.e. you are running the latest version). Remove Firefox from your program's list of trusted or recognized programs, then add it back. For detailed instructions, see Configure firewalls so that Firefox can access the Internet .",
  "products": [
    "firefox"
  ],
  "topics": [
    "site-breakages"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2322,
    "text_bytes": 1523,
    "word_count": 241,
    "downloaded_at": "2025-08-26T10:35:00.146301"
  }
}