{
  "slug": "how-do-you-use-google-firebase-firefox",
  "title": "How do you use Google Firebase in Firefox?",
  "summary": "How Firefox Lite and Firefox ScreenshotGo use Google Firebase.",
  "url": "https://support.mozilla.org/en-US/kb/how-do-you-use-google-firebase-firefox",
  "html": "<p></p><div class=\"warning\">Mozilla has ended support for Firefox Lite on June 30, 2021. This application may continue to work on your device, but it will no longer receive support or security updates. For more information, visit <a href=\"/en-US/kb/end-support-firefox-lite\">End of support for Firefox Lite</a>. Download <a href=\"/en-US/kb/install-firefox-your-phone-or-tablet\">Firefox for Android</a> or <a href=\"/en-US/kb/firefox-focus-ios\">Firefox Focus</a> for a fast, private and safe browsing experience.</div>\n<div class=\"note\">Firefox ScreenshotGo is no longer supported and will not be getting any further updates.</div>\n<p></p><p>Google Firebase is a developer platform with several different capabilities.  Firefox Lite and Firefox ScreenshotGo use Google Firebase for the following:\n</p>\n<ul><li>Google Analytics -  to analyze anonymous user attributions and behavior to make informed decisions on our product roadmap. \n</li><li>Remote Config - to customize your experience such as changing the look and feel, rolling out features gradually, running A/B tests, delivering customized content, or making other updates without deploying a new version.\n</li><li>Cloud Messaging - to send messages and notifications so we can bring contextual hints to you to help you better use the product \n</li><li>Crashlytics - to understand crashes better \n</li><li>Performance Monitoring - to diagnose app performance issues so we can keep Lite really fast\n</li></ul>\n<p>Portions of the <a href=\"https://firebase.google.com/\">Firebase</a> Android software development kit (SDK) are currently proprietary, closed source code.  It is built into Firefox Lite and data is sent to Google.  \n</p><p>For more details see the <a href=\"https://github.com/mozilla-tw/Rocket/wiki/Telemetry\">documentation</a>.\n</p>\n<h1 id=\"w_why-does-firefox-lite-use-a-closed-source-sdk\">Why does Firefox Lite use a closed-source SDK?</h1>\n<p>Firefox Lite is an experimental project released by Mozilla in late 2017 for Android in specific markets.  Firebase was selected because it offered functionality that would be difficult to otherwise build and support for an experimental project with light resources.  \n</p>\n<h1 id=\"w_what-data-is-collected-and-sent-to-the-google-firebase-backend\">What data is collected and sent to the Google Firebase backend?</h1>\n<p>By default, the Firebase SDK collects identifiers for mobile devices including <a href=\"https://support.google.com/adxseller/answer/6274238?hl=en\">Mobile ad IDs</a>, <a href=\"https://support.google.com/firebase/answer/6317486?hl=en\">Analytics App Instance IDs</a>, <a href=\"https://developer.apple.com/documentation/uikit/uidevice/1620059-identifierforvendor\">IDFVs</a>/<a href=\"https://developer.android.com/reference/android/provider/Settings.Secure.html#ANDROID_ID\">Android IDs</a> and <a href=\"https://firebase.google.com/docs/reference/android/com/google/firebase/iid/FirebaseInstanceId\">Instance IDs</a>.  \n</p><p>For more information on personal information collected by Firebase and retention times, see the <a href=\"https://firebase.google.com/support/privacy/\">Firebase privacy and security page</a> (scroll to “Data Processing Information”).  You can also learn more about other types of data collection at the <a href=\"https://support.google.com/firebase/answer/6318039\">Google Analytics for Firebase and Firebase Performance Monitoring Data collection page</a>.\n</p>\n<h1 id=\"w_how-do-i-prevent-data-from-being-sent-to-the-google-firebase-backend\">How do I prevent data from being sent to the Google Firebase backend?</h1>\n<p>You can change the “send usage data” control in the settings menu.  See <a href=\"https://support.mozilla.org/kb/send-usage-data-firefox-mobile-devices\">here</a> for instructions\n</p>",
  "text": "Mozilla has ended support for Firefox Lite on June 30, 2021. This application may continue to work on your device, but it will no longer receive support or security updates. For more information, visit End of support for Firefox Lite . Download Firefox for Android or Firefox Focus for a fast, private and safe browsing experience. Firefox ScreenshotGo is no longer supported and will not be getting any further updates. Google Firebase is a developer platform with several different capabilities. Firefox Lite and Firefox ScreenshotGo use Google Firebase for the following: Google Analytics - to analyze anonymous user attributions and behavior to make informed decisions on our product roadmap. Remote Config - to customize your experience such as changing the look and feel, rolling out features gradually, running A/B tests, delivering customized content, or making other updates without deploying a new version. Cloud Messaging - to send messages and notifications so we can bring contextual hints to you to help you better use the product Crashlytics - to understand crashes better Performance Monitoring - to diagnose app performance issues so we can keep Lite really fast Portions of the Firebase Android software development kit (SDK) are currently proprietary, closed source code. It is built into Firefox Lite and data is sent to Google. For more details see the documentation . Why does Firefox Lite use a closed-source SDK? Firefox Lite is an experimental project released by Mozilla in late 2017 for Android in specific markets. Firebase was selected because it offered functionality that would be difficult to otherwise build and support for an experimental project with light resources. What data is collected and sent to the Google Firebase backend? By default, the Firebase SDK collects identifiers for mobile devices including Mobile ad IDs , Analytics App Instance IDs , IDFVs / Android IDs and Instance IDs . For more information on personal information collected by Firebase and retention times, see the Firebase privacy and security page (scroll to “Data Processing Information”). You can also learn more about other types of data collection at the Google Analytics for Firebase and Firebase Performance Monitoring Data collection page . How do I prevent data from being sent to the Google Firebase backend? You can change the “send usage data” control in the settings menu. See here for instructions",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3752,
    "text_bytes": 2423,
    "word_count": 385,
    "downloaded_at": "2025-08-26T10:46:48.654910"
  }
}