{
  "slug": "how-firefox-securely-saves-passwords",
  "title": "How Firefox securely saves passwords",
  "summary": "Learn how Firefox securely saves your passwords.",
  "url": "https://support.mozilla.org/en-US/kb/how-firefox-securely-saves-passwords",
  "html": "<p>Your <a href=\"/en-US/kb/access-mozilla-services-firefox-account\">Mozilla account</a> and <a href=\"/en-US/kb/sync\">Firefox Sync</a> allow you to save and sync your logins, as well as let you know if any of your passwords are vulnerable. They both also protect your passwords with <a href=\"https://wikipedia.org/wiki/Encryption\">encryption</a> so that even Mozilla can’t see them. Meanwhile, Firefox checks your saved websites against a database of breached websites to let you know if your logins are vulnerable. For more information, see <a href=\"/en-US/kb/firefox-password-manager-alerts-breached-websites\">Firefox Password Manager - Alerts for breached websites</a>.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_firefox-sync\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Firefox Sync</span></a></li><li class=\"toclevel-1\"><a href=\"#w_firefox-desktop\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Firefox Desktop</span></a></li></ul></div>\n<h1 id=\"w_firefox-sync\">Firefox Sync</h1>\n<p>If you have a Mozilla account and have enabled the Sync functionality, your <a href=\"/en-US/kb/sync-firefox-desktop\">login data</a> (usernames, passwords, hostnames) is uploaded encrypted to Mozilla’s Sync servers. This encryption ensures that your data is stored in a way that Mozilla cannot decrypt.\n</p>\n<div class=\"note\">If you forget your Mozilla account email and password, Mozilla will not be able to recover your sync data as we do not have access to it.</div>\n<h1 id=\"w_firefox-desktop\">Firefox Desktop</h1>\n<p>Firefox Desktop encrypts your passwords locally in your <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">user profile directory</a> using a <em>logins.json</em> file. Firefox Desktop uses simple cryptography to obscure your passwords. Mozilla doesn’t have the ability to see passwords, but Firefox Desktop does decrypt the password locally so that it can enter them into form fields.\n</p><p>For the best security, use a <a href=\"/en-US/kb/use-primary-password-protect-stored-logins\">Primary Password</a> to encrypt your passwords. To learn more about how Firefox saves and stores your logins and passwords, see these articles:\n</p>\n<ul><li><a href=\"/en-US/kb/using-primary-password-sync\">Use a Primary Password with Sync</a> \n</li><li><a href=\"/en-US/kb/where-are-my-logins-stored\">Where are my logins stored?</a>\n</li><li><a href=\"/en-US/kb/password-manager-remember-delete-edit-logins\">Password Manager - Remember, delete and edit logins and passwords in Firefox</a>\n</li></ul>",
  "text": "Your Mozilla account and Firefox Sync allow you to save and sync your logins, as well as let you know if any of your passwords are vulnerable. They both also protect your passwords with encryption so that even Mozilla can’t see them. Meanwhile, Firefox checks your saved websites against a database of breached websites to let you know if your logins are vulnerable. For more information, see Firefox Password Manager - Alerts for breached websites . Table of Contents 1 Firefox Sync 2 Firefox Desktop Firefox Sync If you have a Mozilla account and have enabled the Sync functionality, your login data (usernames, passwords, hostnames) is uploaded encrypted to Mozilla’s Sync servers. This encryption ensures that your data is stored in a way that Mozilla cannot decrypt. If you forget your Mozilla account email and password, Mozilla will not be able to recover your sync data as we do not have access to it. Firefox Desktop Firefox Desktop encrypts your passwords locally in your user profile directory using a logins.json file. Firefox Desktop uses simple cryptography to obscure your passwords. Mozilla doesn’t have the ability to see passwords, but Firefox Desktop does decrypt the password locally so that it can enter them into form fields. For the best security, use a Primary Password to encrypt your passwords. To learn more about how Firefox saves and stores your logins and passwords, see these articles: Use a Primary Password with Sync Where are my logins stored? Password Manager - Remember, delete and edit logins and passwords in Firefox",
  "products": [
    "firefox",
    "mozilla-account"
  ],
  "topics": [
    "privacy-and-security",
    "sync-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2558,
    "text_bytes": 1554,
    "word_count": 256,
    "downloaded_at": "2025-08-26T10:47:42.456179"
  }
}