{
  "slug": "how-update-add-ons",
  "title": "How to update add-ons",
  "summary": "This article explains how to update your Firefox add-ons from the Extensions panel in the Add-ons Manager.",
  "url": "https://support.mozilla.org/en-US/kb/how-update-add-ons",
  "html": "<p><a href=\"https://addons.mozilla.org/firefox/\">Add-ons</a> allow you to add extra features and functionality to Firefox. If you need help installing add-ons, see <a href=\"/en-US/kb/find-and-install-add-ons-add-features-to-firefox\">Find and install add-ons to add features to Firefox</a>.\n</p><p>For fixes and new features, keep your add-ons up to date. Here's how to update your add-ons.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_updating-add-ons\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Updating add-ons</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_update-settings-for-specific-add-ons\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Update settings for specific add-ons</span></a></li><li class=\"toclevel-2\"><a href=\"#w_can-i-update-legacy-add-ons\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Can I update legacy add-ons?</span></a></li></ul></li></ul></div>\n<h1 id=\"w_updating-add-ons\">Updating add-ons</h1>\n<ol><li> Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"for\" data-for=\"not fx140\"><span class=\"menu\">Add-ons and themes</span></span><span class=\"for\" data-for=\"fx140\"><span class=\"menu\">Extensions and themes</span></span> and select <span class=\"menu\">Extensions</span>.\n\n</li><li> Click the gear icon <img alt=\"gear icon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2014-06-13-01-42-16-c1469d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the upper-right area of the <span class=\"menu\">Extensions</span> panel. \n<dl><dt><img alt=\"update addons 57\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2017-11-03-03-05-10-e426b1.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> Choose one of the options below:\n</li></ol>\n<ul><li> <strong>Check for Updates:</strong> Allows you to check for any updates to your add-ons manually. If there is an update available, you have the option to choose to update it now or later.\n</li><li> <strong>View Recent Updates:</strong> When you click this option, a <span class=\"menu\">Recent Updates</span> panel appears on the left, showing your last updated add-ons.\n</li><li> <strong>Update Add-ons Automatically:</strong> If you want to keep your add-ons up to date, select this option to let them update automatically.\n</li><li> <strong>Reset All Add-ons to Update Automatically:</strong> If any add-ons have been set to update manually, clicking this option will reset all add-ons to update automatically.\n</li></ul>\n<h2 id=\"w_update-settings-for-specific-add-ons\">Update settings for specific add-ons</h2>\n<div class=\"warning\"><strong>Warning</strong>: Turning off automatic updates might make you miss important security updates to your installed add-ons. We recommend that if you don't use an add-on, <a href=\"/en-US/kb/disable-or-remove-add-ons\">disable it</a> instead of turning off automatic updates.</div>\n<p>You can individually adjust the update method for each extension as follows, when the recommended <em>Update Add-ons Automatically</em> option has been selected:  \n</p>\n<ol><li> Go to the <span class=\"menu\">Extensions</span> panel.\n</li><li> Click on the extension and select the <span class=\"menu\">Details</span> tab.\n<dl><dt> <img alt=\"extensions details tab\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-07-01-13-35-41-f8c0c5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> Find the <em>Automatic Updates</em> line. (You may need to scroll down the page).\n<ul><li> Select <strong>Off</strong> to set manual updates for that extension.\n</li></ul>\n<dl><dt> When automatic updates are turned off, a <em>Check for Updates</em> link will appear on the same line.\n</dt></dl>\n<ul><li> Select <strong>On</strong> or <strong>Default</strong> to set the extension to update automatically.\n</li></ul>\n</li><li> If you want, you can go back to the Extensions panel to set up others.\n</li><li> Close the Add-ons Manager (about:addons) tab.\n</li></ol>\n<h2 id=\"w_can-i-update-legacy-add-ons\">Can I update legacy add-ons?</h2>\n<p>Extensions that do not meet <a href=\"/en-US/kb/firefox-add-technology-modernizing\">Firefox's new add-on technology</a> have been disabled. If you need the add-on, you can visit the developer's website to see if it will be migrated to the <a href=\"https://developer.mozilla.org/Add-ons/WebExtensions/What_are_WebExtensions\">WebExtensions</a> standard. The extension will automatically update when the add-on developer provides a compatible version. You can also search for a compatible alternative. The <a href=\"https://mozilla.github.io/extension-finder/\">Extension Finder</a> utility can help you find replacement extensions.\n</p>",
  "text": "Add-ons allow you to add extra features and functionality to Firefox. If you need help installing add-ons, see Find and install add-ons to add features to Firefox . For fixes and new features, keep your add-ons up to date. Here's how to update your add-ons. Table of Contents 1 Updating add-ons 1.1 Update settings for specific add-ons 1.2 Can I update legacy add-ons? Updating add-ons Click the menu button , click Add-ons and themes Extensions and themes and select Extensions . Click the gear icon in the upper-right area of the Extensions panel. Choose one of the options below: Check for Updates: Allows you to check for any updates to your add-ons manually. If there is an update available, you have the option to choose to update it now or later. View Recent Updates: When you click this option, a Recent Updates panel appears on the left, showing your last updated add-ons. Update Add-ons Automatically: If you want to keep your add-ons up to date, select this option to let them update automatically. Reset All Add-ons to Update Automatically: If any add-ons have been set to update manually, clicking this option will reset all add-ons to update automatically. Update settings for specific add-ons Warning : Turning off automatic updates might make you miss important security updates to your installed add-ons. We recommend that if you don't use an add-on, disable it instead of turning off automatic updates. You can individually adjust the update method for each extension as follows, when the recommended Update Add-ons Automatically option has been selected: Go to the Extensions panel. Click on the extension and select the Details tab. Find the Automatic Updates line. (You may need to scroll down the page). Select Off to set manual updates for that extension. When automatic updates are turned off, a Check for Updates link will appear on the same line. Select On or Default to set the extension to update automatically. If you want, you can go back to the Extensions panel to set up others. Close the Add-ons Manager (about:addons) tab. Can I update legacy add-ons? Extensions that do not meet Firefox's new add-on technology have been disabled. If you need the add-on, you can visit the developer's website to see if it will be migrated to the WebExtensions standard. The extension will automatically update when the add-on developer provides a compatible version. You can also search for a compatible alternative. The Extension Finder utility can help you find replacement extensions.",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5408,
    "text_bytes": 2506,
    "word_count": 414,
    "downloaded_at": "2025-08-26T10:38:00.342950"
  }
}