{
  "slug": "how-disable-enterprise-roots-preference",
  "title": "How to disable the Enterprise Roots preference",
  "summary": "How to disable the Enterprise Roots preference to fix TLS connection errors caused by antivirus software, without compromising security.",
  "url": "https://support.mozilla.org/en-US/kb/how-disable-enterprise-roots-preference",
  "html": "<p></p><div class=\"warning\"><strong>Warning:</strong> These instructions are for experienced Firefox users. Changing settings in the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a> (<em>about:config</em>) can have serious effects on your browser’s stability, security and performance.\n<br><strong>Only proceed if you are comfortable with advanced settings and understand the potential impacts</strong>.</div>\n<p></p><p>Firefox may display a <a href=\"https://wikipedia.org/wiki/Transport_Layer_Security\">TLS</a> connection error when your antivirus software prevents data from being sent to your browser. This happens when your antivirus software fails to register itself with Firefox as a valid issuer of TLS certificates. \n</p><p>Mozilla has added an Enterprise Roots preference to Firefox as a solution to the problem. This preference can be used to import any root <a href=\"https://wikipedia.org/wiki/Certificate_authority\">certificate authorities</a> (CAs) that have been added to the operating system, to resolve your TLS connection error. You can determine if a website is relying on an imported root certificate by clicking the <em>Site information</em> padlock icon <img alt=\"Fx89Padlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-33-33-7bdc86.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the address bar. \n</p><p>When a TLS connection error occurs Firefox will automatically enable the Enterprise Roots preference and attempts to connect again. If the issue is resolved, then the Enterprise Roots preference remains enabled. However, you may want to disable this behavior, so this article explains how to do just that without compromising security.\n</p><p>You can modify this behavior and prevent Firefox from automatically enabling the import of CAs that have been added to the operating system when a TLS connection error occurs, as follows:\n</p>\n<ol><li>Type <strong>about:config</strong> in the <a href=\"/en-US/kb/search-firefox-address-bar\">address bar</a> and press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>.<br>A warning page may appear. Click <span class=\"button\">Accept the Risk and Continue</span> to go to the <em>about:config</em> page.\n\n</li><li>Type <strong>enterprise</strong> in the <em>Search</em> field.\n</li><li>Click the <em>Toggle</em> <img alt=\"Fx71aboutconfig-ToggleButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-29-08-56-36-b0ab10.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button next to the preference <span class=\"pref\">security.certerrors.mitm.auto_enable_enterprise_roots</span> to change its value from <span class=\"pref\">true</span> to <span class=\"pref\"><strong>false</strong></span>.\n</li></ol>\n<p>To prevent CAs that have been added to the operating system from being automatically imported each time Firefox restarts:\n</p>\n<ol><li>In the <em>about:config</em> page, search for <strong>enterprise</strong> as explained above.\n</li><li>Click the <em>Toggle</em> <img alt=\"Fx71aboutconfig-ToggleButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-29-08-56-36-b0ab10.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button next to the preference <span class=\"pref\">security.enterprise_roots.enabled</span> to change its value from <span class=\"pref\">true</span> to <span class=\"pref\"><strong>false</strong></span>.\n</li></ol>",
  "text": "Warning: These instructions are for experienced Firefox users. Changing settings in the Configuration Editor ( about:config ) can have serious effects on your browser’s stability, security and performance. Only proceed if you are comfortable with advanced settings and understand the potential impacts . Firefox may display a TLS connection error when your antivirus software prevents data from being sent to your browser. This happens when your antivirus software fails to register itself with Firefox as a valid issuer of TLS certificates. Mozilla has added an Enterprise Roots preference to Firefox as a solution to the problem. This preference can be used to import any root certificate authorities (CAs) that have been added to the operating system, to resolve your TLS connection error. You can determine if a website is relying on an imported root certificate by clicking the Site information padlock icon in the address bar. When a TLS connection error occurs Firefox will automatically enable the Enterprise Roots preference and attempts to connect again. If the issue is resolved, then the Enterprise Roots preference remains enabled. However, you may want to disable this behavior, so this article explains how to do just that without compromising security. You can modify this behavior and prevent Firefox from automatically enabling the import of CAs that have been added to the operating system when a TLS connection error occurs, as follows: Type about:config in the address bar and press Enter Return . A warning page may appear. Click Accept the Risk and Continue to go to the about:config page. Type enterprise in the Search field. Click the Toggle button next to the preference security.certerrors.mitm.auto_enable_enterprise_roots to change its value from true to false . To prevent CAs that have been added to the operating system from being automatically imported each time Firefox restarts: In the about:config page, search for enterprise as explained above. Click the Toggle button next to the preference security.enterprise_roots.enabled to change its value from true to false .",
  "products": [
    "firefox"
  ],
  "topics": [
    "customization",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3914,
    "text_bytes": 2103,
    "word_count": 327,
    "downloaded_at": "2025-08-26T10:47:57.283882"
  }
}