{
  "slug": "how-install-firefox-windows",
  "title": "How to install Firefox on Windows",
  "summary": "This article describes how to download and install Firefox on Windows.",
  "url": "https://support.mozilla.org/en-US/kb/how-install-firefox-windows",
  "html": "<p>This article explains how to install Firefox on Windows, either with a simple online installer from Mozilla or from the Microsoft Store.\n</p>\n<ul><li>If you need a full, offline installer with custom options, see <a href=\"/en-US/kb/custom-installation-firefox-on-windows\">Custom installation of Firefox on Windows</a>.\n</li><li>To update Firefox from a previous version, see <a href=\"/en-US/kb/update-firefox-latest-release\">Update Firefox to the latest release</a>.\n</li></ul>\n<div class=\"for\" data-for=\"mac,linux\"><div class=\"note\"><strong>This article only applies to Windows.</strong><span class=\"for\" data-for=\"mac\"> For instructions to install Firefox on Mac, see <a href=\"/en-US/kb/how-download-and-install-firefox-mac\">How to download and install Firefox on Mac</a>.</span><span class=\"for\" data-for=\"linux\"> For instructions to install Firefox on Linux, see <a href=\"/en-US/kb/install-firefox-linux\">Install Firefox on Linux</a>.</span></div></div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_install-from-mozillas-download-server\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Install from Mozilla's download server</span></a></li><li class=\"toclevel-1\"><a href=\"#w_install-from-the-microsoft-store\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Install from the Microsoft Store</span></a></li><li class=\"toclevel-1\"><a href=\"#w_having-problems\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Having problems?</span></a></li></ul></div>\n<h1 id=\"w_install-from-mozillas-download-server\">Install from Mozilla's download server</h1>\n<div class=\"note\"><strong>Before installing Firefox, see the <a href=\"https://www.mozilla.org/firefox/system-requirements\">Firefox System Requirements</a></strong> to make sure that your computer has the required operating system and recommended hardware.</div>\n<p>To install Firefox on your computer:\n</p>\n<ol><li>Visit <a href=\"https://www.firefox.com/browsers/desktop/windows/?utm_medium=referral&amp;utm_source=support.mozilla.org\"><strong>this Firefox download page</strong></a> in any browser, such as Microsoft Edge.\n</li><li>Click the <span class=\"button\">Download Now</span> button. The Firefox Installer that downloads will automatically offer you the best available version of Firefox for your computer.<br><img alt=\"FirefoxInstallerDownload\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-08-03-13-59-00-1873ee.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"800\"><div class=\"for\" data-for=\"win10\"><div class=\"note\">Windows 10 may show you a warning when installing apps that aren't from the Microsoft Store. See <a href=\"/en-US/kb/windows-10-warns-me-use-microsoft-verified-app\">Windows 10 warns me to use a \"Microsoft-verified\" app</a> for more information.</div></div>\n<ul><li>Click <strong>Open file</strong> in the <em>Downloads</em> notification on Microsoft Edge to start the process.\n</li><li>In other browsers, you may need to first save the Firefox installer to your computer, then open the file you downloaded.<br><strong>Note:</strong> If you see an <em>Open File – Security Warning</em> dialog, click <span class=\"button\">Open</span> or <span class=\"button\">Run</span>.\n</li></ul>\n<dl><dt><img alt=\"Firefox-60-open-file-warning-win10\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2018-06-10-22-02-04-45d74b.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>The <em>User Account Control</em> dialog may open, to ask you to allow the Firefox Installer to make changes to your computer. If this dialog appears, click <span class=\"button\">Yes</span> to start the installation. Firefox will be installed to the Program Files directory and available to all users on your computer.\n<dl><dt><img alt=\"Firefox-Installer-win10-UAC\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2018-06-10-22-04-34-a54b02.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"><div class=\"note\"><strong>Note:</strong> If you run the installer as administrator and click <span class=\"button\">No</span> or cancel the UAC dialog, or if you install Firefox using a non-administrator account, Firefox installs to your user home directory (<span class=\"filepath\">C:\\Users\\&lt;username&gt;\\AppData\\Local\\Mozilla Firefox\\</span>) and is not available to other users.</div>\n</dt></dl>\n</li><li>Wait for Firefox to finish installing.\n<dl><dt><img alt=\"Fx141FirefoxInstaller-NowInstalling\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-08-11-15-51-54-850857.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>When the installation is complete, the Welcome to Firefox page will open, where you can read the Terms of Use and Privacy Notice and manage diagnostic and interaction data.\n<dl><dt><img alt=\"Fx141FirefoxInstaller-Welcome\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-08-11-15-59-39-48412e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> <div class=\"note\"><strong>Note:</strong> A notification bar with a <span class=\"button\">Refresh Firefox…</span> button may be shown at the top of the page, if Firefox was previously installed. See <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">Refresh Firefox - reset add-ons and settings</a> to learn more.</div>\n</dt></dl>\n</li><li>Click the <span class=\"button\">Continue</span> button, then complete or skip the steps that follow.\n</li></ol>\n<p><strong>Congratulations, you are done installing Firefox!</strong>\n</p><p>Double-click the Firefox icon that was placed on the desktop whenever you want to start Firefox.\n</p>\n<dl><dt><img alt=\"FirefoxShortcut\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2020-08-14-09-52-41-a970a7.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<h1 id=\"w_install-from-the-microsoft-store\">Install from the Microsoft Store</h1>\n<div class=\"note\">Installing Firefox from the Microsoft Store requires Windows 10 or Windows 11.</div>\n<ol><li>Click on the <em>Windows</em> icon located on the taskbar.\n</li><li>Type <strong>Microsoft Store</strong>.\n</li><li>Select the <strong>Microsoft Store</strong> from the results. This will take you to the Microsoft app store.\n</li><li>Type <strong>Firefox</strong> in the search bar and press <span class=\"key\">Enter</span>.\n</li><li>Select <strong>Mozilla Firefox</strong> from the applications available.\n</li><li>Click <span class=\"button\">Get</span> to start the installation process.\n</li></ol>\n<p>To learn more, see <a href=\"/en-US/kb/download-firefox-windows-microsoft-store\">Download Firefox on Windows from the Microsoft Store</a>.\n</p>\n<h1 id=\"w_having-problems\">Having problems?</h1>\n<p>Here are some articles that can help you:\n</p><div class=\"for\" data-for=\"win10,win11\">\n<ul><li><a href=\"/en-US/kb/windows-s-mode-wont-let-me-install-firefox\">Windows in S mode won't let me install Firefox</a>\n</li><li><a href=\"/en-US/kb/how-change-your-default-browser-firefox-windows\">Make Firefox your default browser on Windows</a>\n</li></ul>\n</div>\n<ul><li><a href=\"/en-US/kb/make-firefox-your-default-browser\">Make Firefox your default browser</a>\n</li><li><a href=\"/en-US/kb/firefox-wont-start-find-solutions\">Firefox won't start - find solutions</a>\n</li><li><a href=\"/en-US/kb/troubleshoot-and-diagnose-firefox-problems\">Troubleshoot and diagnose Firefox problems</a>\n</li><li><a href=\"/en-US/kb/why-do-i-get-harmful-download-message-when-downloading-firefox-windows\">Why do I get a harmful download message when downloading Firefox on Windows?</a>\n</li></ul>\n<p>If you need more help, you can always <a href=\"/en-US/kb/get-community-support\">get community support</a>.\n</p>",
  "text": "This article explains how to install Firefox on Windows, either with a simple online installer from Mozilla or from the Microsoft Store. If you need a full, offline installer with custom options, see Custom installation of Firefox on Windows . To update Firefox from a previous version, see Update Firefox to the latest release . This article only applies to Windows. For instructions to install Firefox on Mac, see How to download and install Firefox on Mac . For instructions to install Firefox on Linux, see Install Firefox on Linux . Table of Contents 1 Install from Mozilla's download server 2 Install from the Microsoft Store 3 Having problems? Install from Mozilla's download server Before installing Firefox, see the Firefox System Requirements to make sure that your computer has the required operating system and recommended hardware. To install Firefox on your computer: Visit this Firefox download page in any browser, such as Microsoft Edge. Click the Download Now button. The Firefox Installer that downloads will automatically offer you the best available version of Firefox for your computer. Windows 10 may show you a warning when installing apps that aren't from the Microsoft Store. See Windows 10 warns me to use a \"Microsoft-verified\" app for more information. Click Open file in the Downloads notification on Microsoft Edge to start the process. In other browsers, you may need to first save the Firefox installer to your computer, then open the file you downloaded. Note: If you see an Open File – Security Warning dialog, click Open or Run . The User Account Control dialog may open, to ask you to allow the Firefox Installer to make changes to your computer. If this dialog appears, click Yes to start the installation. Firefox will be installed to the Program Files directory and available to all users on your computer. Note: If you run the installer as administrator and click No or cancel the UAC dialog, or if you install Firefox using a non-administrator account, Firefox installs to your user home directory ( C:\\Users\\<username>\\AppData\\Local\\Mozilla Firefox\\ ) and is not available to other users. Wait for Firefox to finish installing. When the installation is complete, the Welcome to Firefox page will open, where you can read the Terms of Use and Privacy Notice and manage diagnostic and interaction data. Note: A notification bar with a Refresh Firefox… button may be shown at the top of the page, if Firefox was previously installed. See Refresh Firefox - reset add-ons and settings to learn more. Click the Continue button, then complete or skip the steps that follow. Congratulations, you are done installing Firefox! Double-click the Firefox icon that was placed on the desktop whenever you want to start Firefox. Install from the Microsoft Store Installing Firefox from the Microsoft Store requires Windows 10 or Windows 11. Click on the Windows icon located on the taskbar. Type Microsoft Store . Select the Microsoft Store from the results. This will take you to the Microsoft app store. Type Firefox in the search bar and press Enter . Select Mozilla Firefox from the applications available. Click Get to start the installation process. To learn more, see Download Firefox on Windows from the Microsoft Store . Having problems? Here are some articles that can help you: Windows in S mode won't let me install Firefox Make Firefox your default browser on Windows Make Firefox your default browser Firefox won't start - find solutions Troubleshoot and diagnose Firefox problems Why do I get a harmful download message when downloading Firefox on Windows? If you need more help, you can always get community support .",
  "products": [
    "firefox"
  ],
  "topics": [
    "install",
    "installation-and-updates"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 8486,
    "text_bytes": 3661,
    "word_count": 601,
    "downloaded_at": "2025-08-26T09:04:27.851185"
  }
}