{
  "slug": "how-add-translate-feature-firefox",
  "title": "How to add the translate add-on to Firefox",
  "summary": "Seamlessly translate webpages in Firefox.",
  "url": "https://support.mozilla.org/en-US/kb/how-add-translate-feature-firefox",
  "html": "<p>Firefox has always prioritized user convenience and privacy, especially when it comes to browsing content in multiple languages. The Firefox Translations add-on has been a valuable tool for many, offering the ability to translate websites directly in Firefox without relying on cloud services. As browser technology advances and strives to improve user experience, Firefox is transitioning towards a more seamless, integrated solution.\n</p>\n<h1 id=\"w_introducing-built-in-translation-in-firefox\">Introducing built-in translation in Firefox</h1>\n<p>Starting in <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 118, we are excited to introduce a built-in translation feature, a significant step forward in our commitment to privacy and seamless browsing. This feature, integrated directly into your browser, allows local translations of web pages, ensuring your privacy and security remain uncompromised. This built-in tool enables effortless web surfing in your preferred language, making the need for separate translation add-ons obsolete.\n</p>\n<h1 id=\"w_changes-to-the-firefox-translations-add-on\">Changes to the Firefox translations add-on</h1>\n<p>With the introduction of the built-in translation feature, the Firefox Translations add-on will no longer receive updates or maintenance. While the add-on will remain functional for a period, we encourage users to transition to the built-in translation feature for the most up-to-date and secure experience.\n</p>\n<h1 id=\"w_next-steps-for-users\">Next steps for users</h1>\n<p>As we sunset the Firefox Translations add-on, we invite users to embrace the built-in translation feature. To use it, make sure your <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> is 118 or above. Visit <a href=\"/en-US/kb/website-translation\">Firefox Translation</a> for details.\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li> <a href=\"/en-US/kb/website-translation\">Firefox Translation</a>\n</li><li> <a href=\"/en-US/kb/firefox-translations-add-on\">Firefox Translations Add-on</a>\n</li></ul>\n<h2 id=\"w_more-resources\">More Resources</h2>\n<ul><li> <a href=\"/en-US/kb/how-do-i-use-firefox-spell-checker\">How do I use the Firefox spell checker?</a>\n</li><li> <a href=\"/en-US/kb/use-firefox-another-language\">Use Firefox in another language</a>\n</li><li> <a href=\"/en-US/kb/tips-assessing-safety-extension\">Tips for assessing the safety of an extension</a>\n</li></ul>",
  "text": "Firefox has always prioritized user convenience and privacy, especially when it comes to browsing content in multiple languages. The Firefox Translations add-on has been a valuable tool for many, offering the ability to translate websites directly in Firefox without relying on cloud services. As browser technology advances and strives to improve user experience, Firefox is transitioning towards a more seamless, integrated solution. Introducing built-in translation in Firefox Starting in Firefox version 118, we are excited to introduce a built-in translation feature, a significant step forward in our commitment to privacy and seamless browsing. This feature, integrated directly into your browser, allows local translations of web pages, ensuring your privacy and security remain uncompromised. This built-in tool enables effortless web surfing in your preferred language, making the need for separate translation add-ons obsolete. Changes to the Firefox translations add-on With the introduction of the built-in translation feature, the Firefox Translations add-on will no longer receive updates or maintenance. While the add-on will remain functional for a period, we encourage users to transition to the built-in translation feature for the most up-to-date and secure experience. Next steps for users As we sunset the Firefox Translations add-on, we invite users to embrace the built-in translation feature. To use it, make sure your Firefox version is 118 or above. Visit Firefox Translation for details. Related articles Firefox Translation Firefox Translations Add-on More Resources How do I use the Firefox spell checker? Use Firefox in another language Tips for assessing the safety of an extension",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2471,
    "text_bytes": 1713,
    "word_count": 250,
    "downloaded_at": "2025-08-26T10:38:44.941554"
  }
}