{
  "slug": "how-print-web-pages-firefox",
  "title": "How to print web pages in Firefox",
  "summary": "This article covers the basics of print settings and formatting options in Firefox.",
  "url": "https://support.mozilla.org/en-US/kb/how-print-web-pages-firefox",
  "html": "<p>Learn more on how to print web pages using Firefox's printing features.\n</p>\n<ul><li> For troubleshooting printing problems, see <a href=\"/en-US/kb/fix-printing-problems-firefox\">Fix printing problems in Firefox</a>.\n</li><li>To print pages in a simplified format, see <a href=\"/en-US/kb/print-simplified-clutter-free-pages-firefox\">Print simplified, clutter-free pages in Firefox</a>.\n</li></ul>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_print-a-web-page\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Print a web page</span></a></li><li class=\"toclevel-1\"><a href=\"#w_advanced-tips\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Advanced tips</span></a></li></ul></div>\n<h1 id=\"w_print-a-web-page\">Print a web page</h1>\n<ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and then click <span class=\"button\">Print…</span>\n<ul><li>This will open a print preview for that web page.\n</li></ul>\n<dl><dt><img alt=\"Fx82PrintUI\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2020-09-30-13-51-12-c0ec0e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>Choose your printing options:\n<ul><li><strong>Destination:</strong> Use the dropdown menu to choose the device or document to print to or save. Select <span class=\"menu\">Save to PDF</span> in the drop-down menu to save the shown preview as a PDF file.\n</li><li><strong>Copies:</strong> Choose how many copies to make (available for printers and faxes).\n</li><li><strong>Orientation:</strong> Allows you to choose between <span class=\"button\">Portrait</span> and <span class=\"button\">Landscape</span> orientation of the printed page.\n</li><li><strong>Pages:</strong> Allows you to choose what pages you would like to print.\n</li><li><strong>Color mode:</strong> This allows you to choose whether to print in <span class=\"menu\">Color</span> or <span class=\"menu\">Black and white</span> (this may not be customizable for some printers).\n</li><li><strong>More settings:</strong> Expand this section for more options, such as <strong>Paper size</strong>, <strong>Scale</strong>, <strong>Pages per sheet</strong>, <strong>Margins</strong>, <strong>Format</strong> (<strong>Original</strong> or <a href=\"/en-US/kb/print-simplified-clutter-free-pages-firefox\"><strong>Simplified</strong></a>, if available), <strong>Two-sided printing</strong>, <strong>Print headers and footers</strong> and <strong>Print backgrounds</strong>. (If you select <em>Simplified</em> under <em>Format</em>, you won't be able to select <em>Print backgrounds</em>.)\n</li></ul>\n</li><li>After adjusting the settings, click <span class=\"button\">Print</span> to start printing.\n</li></ol>\n<h1 id=\"w_advanced-tips\">Advanced tips</h1>\n<ul><li>If you want to edit the web page content before printing, you can use an extension from <a href=\"https://addons.mozilla.org/firefox/\">Firefox Add-ons</a> such as <a href=\"https://addons.mozilla.org/firefox/addon/print-edit-we/\">Print Edit WE</a>.\n</li><li>To print a single image from a page, you can typically right-click it, and select <span class=\"menu\">Open Image in New Tab</span> or <span class=\"menu\">View Background Image</span> then print using the instructions above.\n</li><li>Web pages can set themselves up to appear different on paper to how they look on screen, so don't be surprised to see some changes.\n</li></ul>",
  "text": "Learn more on how to print web pages using Firefox's printing features. For troubleshooting printing problems, see Fix printing problems in Firefox . To print pages in a simplified format, see Print simplified, clutter-free pages in Firefox . Table of Contents 1 Print a web page 2 Advanced tips Print a web page Click the menu button and then click Print… This will open a print preview for that web page. Choose your printing options: Destination: Use the dropdown menu to choose the device or document to print to or save. Select Save to PDF in the drop-down menu to save the shown preview as a PDF file. Copies: Choose how many copies to make (available for printers and faxes). Orientation: Allows you to choose between Portrait and Landscape orientation of the printed page. Pages: Allows you to choose what pages you would like to print. Color mode: This allows you to choose whether to print in Color or Black and white (this may not be customizable for some printers). More settings: Expand this section for more options, such as Paper size , Scale , Pages per sheet , Margins , Format ( Original or Simplified , if available), Two-sided printing , Print headers and footers and Print backgrounds . (If you select Simplified under Format , you won't be able to select Print backgrounds .) After adjusting the settings, click Print to start printing. Advanced tips If you want to edit the web page content before printing, you can use an extension from Firefox Add-ons such as Print Edit WE . To print a single image from a page, you can typically right-click it, and select Open Image in New Tab or View Background Image then print using the instructions above. Web pages can set themselves up to appear different on paper to how they look on screen, so don't be surprised to see some changes.",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse",
    "download-and-save",
    "downloads",
    "images-and-documents"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3794,
    "text_bytes": 1802,
    "word_count": 317,
    "downloaded_at": "2025-08-26T09:04:31.461135"
  }
}