{
  "slug": "https-upgrades",
  "title": "Firefox connection upgrades - HTTP to HTTPS",
  "summary": "Firefox upgrades connections from HTTP to HTTPS to enhance security and protect your data. Learn about server- and browser-initiated upgrades and how they work.",
  "url": "https://support.mozilla.org/en-US/kb/https-upgrades",
  "html": "<p>When you browse the web using Firefox, the browser may automatically upgrade your connection from the less secure HTTP protocol to the safer HTTPS protocol. This ensures that the websites you visit are authentic and that any information you send, such as passwords or personal data, is encrypted and protected from interception. Since most websites today support HTTPS, this upgrade usually happens without any problems. Even if a link uses the older <code>http://</code> format, Firefox may still attempt to connect securely via HTTPS, as many older links still exist even though websites themselves now support HTTPS. This helps keep your browsing experience both seamless and secure.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-is-the-difference-between-http-and-https\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What is the difference between HTTP and HTTPS?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_different-upgrade-mechanisms\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Different upgrade mechanisms</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_server-initiated-upgrades\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Server initiated upgrades</span></a></li><li class=\"toclevel-2\"><a href=\"#w_browser-initiated-upgrades\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">Browser initiated upgrades</span></a></li><li class=\"toclevel-2\"><a href=\"#w_other-requests\"><span class=\"tocnumber\">2.3</span> <span class=\"toctext\">Other requests</span></a></li></ul></li></ul></div>\n<h1 id=\"w_what-is-the-difference-between-http-and-https\">What is the difference between HTTP and HTTPS?</h1>\n<p><a href=\"https://wikipedia.org/wiki/Hypertext_Transfer_Protocol\">HTTP</a> stands for Hypertext Transfer Protocol. It is the fundamental protocol for the web and encodes basic interactions between browsers and web servers. The problem with the regular HTTP protocol is that the data transferring from server to browser is not encrypted, meaning data can be viewed, stolen or altered. <a href=\"https://wikipedia.org/wiki/HTTPS\">HTTPS</a> protocols fix this by using a Transport Layer Security (TLS) certificate. This creates a secure encrypted connection between the server and the browser, which protects sensitive information.\n</p>\n<h1 id=\"w_different-upgrade-mechanisms\">Different upgrade mechanisms</h1>\n<p>Connection upgrade mechanisms can be grouped based on two factors:\n</p>\n<ol><li>Who initiates the upgrade (the browser or the web server).\n</li><li>The type of connection being upgraded.\n</li></ol>\n<p>The sections below explain these mechanisms in detail.\n</p>\n<h2 id=\"w_server-initiated-upgrades\">Server initiated upgrades</h2>\n<p>When a web server indicates that it supports HTTPS, the browser can automatically switch to a secure connection. The server can use several methods to achieve this:\n</p>\n<ul><li> <a href=\"https://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security\">HTTP Strict Transport Security (HSTS)</a> is a standard which lets websites communicate to the browser that they support secure connections, and the browser will remember this for future connections. It is supplemented by a built-in list of such sites, the <a href=\"https://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security#Solutions_with_preload_list\">HSTS preload list</a>.\n</li><li> <a href=\"https://developer.mozilla.org/en-US/docs/Glossary/HTTPS_RR\">HTTPS Resource Records (HTTPS RR)</a> are special DNS entries which tell a browser that a web server supports HTTPS.\n</li><li> While not technically a connection upgrade, many websites redirect HTTP connections to HTTPS using the redirection status codes like <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/301\">301 Moved Permanently</a>.\n</li></ul>\n<h2 id=\"w_browser-initiated-upgrades\">Browser initiated upgrades</h2>\n<p>If the browser cannot determine whether a web server supports HTTPS, it may still attempt to upgrade the connection. Because HTTPS is widely supported, this process is often successful. Firefox supports several browser-initiated upgrade features:\n</p><div class=\"for\" data-for=\"fx136\">\n<ul><li> <a href=\"/en-US/kb/https-first\">HTTPS-First</a> is a feature available since <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 136. It ensures that all connections attempt to use HTTPS first, before falling back to HTTP in case of failure. This will always select the most secure option, without interrupting users.\n</li></ul>\n</div>\n<ul><li> <a href=\"/en-US/kb/https-only-prefs\">HTTPS-Only Mode</a> is a setting which users can enable to ensure that Firefox will never establish an insecure connection without prompting the user first. Since most sites now support HTTPS, users may find the frequent prompts from HTTPS-Only Mode frustrating when they encounter HTTP websites. For this reason, it is not enabled by default.\n</li><li> There are several web extensions which perform some kind of connection upgrade. These mostly serve specific use-cases for expert audiences.\n</li></ul>\n<h2 id=\"w_other-requests\">Other requests</h2>\n<p>The mechanisms described above primarily apply to “top-level” or navigation requests, such as typing a URL into the address bar or clicking on a link. Firefox also handles other types of requests, such as downloading images or other subresources for a webpage. While <a href=\"/en-US/kb/https-only-prefs\">HTTPS-Only Mode in Firefox</a> applies to all requests, subresources are typically upgraded using the following mechanisms:\n</p>\n<ul><li> The <a href=\"https://developer.mozilla.org/docs/Web/HTTP/CSP\">Content Security Policy</a> (CSP) <a href=\"https://developer.mozilla.org/docs/Web/HTTP/Headers/Content-Security-Policy/upgrade-insecure-requests\">upgrade-insecure-requests</a> directive on a webpage will upgrade subresource requests.\n</li><li> The <a href=\"https://developer.mozilla.org/docs/Web/Security/Mixed_content\">Mixed Content</a> algorithm ensures that, if the top-level request for a site was encrypted, subresources will either also be loaded securely, or the connection is blocked.\n</li></ul>",
  "text": "When you browse the web using Firefox, the browser may automatically upgrade your connection from the less secure HTTP protocol to the safer HTTPS protocol. This ensures that the websites you visit are authentic and that any information you send, such as passwords or personal data, is encrypted and protected from interception. Since most websites today support HTTPS, this upgrade usually happens without any problems. Even if a link uses the older http:// format, Firefox may still attempt to connect securely via HTTPS, as many older links still exist even though websites themselves now support HTTPS. This helps keep your browsing experience both seamless and secure. Table of Contents 1 What is the difference between HTTP and HTTPS? 2 Different upgrade mechanisms 2.1 Server initiated upgrades 2.2 Browser initiated upgrades 2.3 Other requests What is the difference between HTTP and HTTPS? HTTP stands for Hypertext Transfer Protocol. It is the fundamental protocol for the web and encodes basic interactions between browsers and web servers. The problem with the regular HTTP protocol is that the data transferring from server to browser is not encrypted, meaning data can be viewed, stolen or altered. HTTPS protocols fix this by using a Transport Layer Security (TLS) certificate. This creates a secure encrypted connection between the server and the browser, which protects sensitive information. Different upgrade mechanisms Connection upgrade mechanisms can be grouped based on two factors: Who initiates the upgrade (the browser or the web server). The type of connection being upgraded. The sections below explain these mechanisms in detail. Server initiated upgrades When a web server indicates that it supports HTTPS, the browser can automatically switch to a secure connection. The server can use several methods to achieve this: HTTP Strict Transport Security (HSTS) is a standard which lets websites communicate to the browser that they support secure connections, and the browser will remember this for future connections. It is supplemented by a built-in list of such sites, the HSTS preload list . HTTPS Resource Records (HTTPS RR) are special DNS entries which tell a browser that a web server supports HTTPS. While not technically a connection upgrade, many websites redirect HTTP connections to HTTPS using the redirection status codes like 301 Moved Permanently . Browser initiated upgrades If the browser cannot determine whether a web server supports HTTPS, it may still attempt to upgrade the connection. Because HTTPS is widely supported, this process is often successful. Firefox supports several browser-initiated upgrade features: HTTPS-First is a feature available since Firefox version 136. It ensures that all connections attempt to use HTTPS first, before falling back to HTTP in case of failure. This will always select the most secure option, without interrupting users. HTTPS-Only Mode is a setting which users can enable to ensure that Firefox will never establish an insecure connection without prompting the user first. Since most sites now support HTTPS, users may find the frequent prompts from HTTPS-Only Mode frustrating when they encounter HTTP websites. For this reason, it is not enabled by default. There are several web extensions which perform some kind of connection upgrade. These mostly serve specific use-cases for expert audiences. Other requests The mechanisms described above primarily apply to “top-level” or navigation requests, such as typing a URL into the address bar or clicking on a link. Firefox also handles other types of requests, such as downloading images or other subresources for a webpage. While HTTPS-Only Mode in Firefox applies to all requests, subresources are typically upgraded using the following mechanisms: The Content Security Policy (CSP) upgrade-insecure-requests directive on a webpage will upgrade subresource requests. The Mixed Content algorithm ensures that, if the top-level request for a site was encrypted, subresources will either also be loaded securely, or the connection is blocked.",
  "products": [
    "firefox",
    "mobile"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6152,
    "text_bytes": 4085,
    "word_count": 625,
    "downloaded_at": "2025-08-26T10:59:19.090019"
  }
}