{
  "slug": "im-having-problems-confirming-my-firefox-account",
  "title": "I'm having problems confirming my Mozilla account",
  "summary": "Here are some common solutions to help you resolve issues such as missing confirmation emails and outdated or locked Mozilla account status.",
  "url": "https://support.mozilla.org/en-US/kb/im-having-problems-confirming-my-firefox-account",
  "html": "<p>When you sign up for a Mozilla account, we will send you a 6-digit confirmation code, to confirm that you own the email address connected to the account. We will also send you an email to confirm your sign in if you are signing into a new device for the first time. If you're having issues confirming your account, try these common solutions.\n</p>\n<ul><li> For other Mozilla account issues, see <a href=\"/en-US/kb/im-having-problems-my-firefox-account\">I'm having problems with my Mozilla account</a>.\n</li></ul>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_i-havent-received-an-email-to-confirm-my-account\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">I haven't received an email to confirm my account</span></a></li><li class=\"toclevel-1\"><a href=\"#w_my-code-isnt-being-accepted\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">My code isn’t being accepted</span></a></li><li class=\"toclevel-1\"><a href=\"#w_an-email-was-returned\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">An email was returned</span></a></li><li class=\"toclevel-1\"><a href=\"#w_my-mozilla-account-has-been-locked\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">My Mozilla account has been locked</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-no-longer-have-access-to-the-email-address-associated-with-my-account\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">I no longer have access to the email address associated with my account</span></a></li></ul></div>\n<h1 id=\"w_i-havent-received-an-email-to-confirm-my-account\">I haven't received an email to confirm my account</h1>\n<p>The confirmation code email can take several minutes to get to your inbox. You must enter the code within 10 minutes of receiving it. If you still haven’t received the code within this timeframe after attempting to sign in:\n</p>\n<ol><li>Try again. Some email providers may block the very first email, if it’s the first time seeing an email from us\n</li><li>Check your email from your internet browser instead of using an app like Mail or Outlook \n</li><li>Search your inbox for an email from accounts@firefox.com\n</li><li>Spam filters might also prevent it from reaching the right mail folder. If you've already waited a few minutes and refreshed your inbox, check your junk mail or spam folder to see if your confirmation email ended up there\n</li><li>Try adding accounts@firefox.com to your list of allowed senders to keep your email provider from blocking the email. You can then re-enter the information on the Mozilla account signup page, or click the <strong>Need another code? Resend</strong> link on the page to enter a 6-digit confirmation code, to receive another email.\n</li></ol>\n<h1 id=\"w_my-code-isnt-being-accepted\">My code isn’t being accepted</h1>\n<p>If your code isn’t being accepted, it's likely that it has exceeded its 10 minute expiration and you will need to generate another one. To do this you can request another code from the same confirmation window. If you’ve navigated away from the window, simply attempt to sign in again.\n</p>\n<div class=\"note\"><strong>Note:</strong> Confirmation codes expire <strong>10 minutes</strong> after they are generated.</div>\n<h1 id=\"w_an-email-was-returned\">An email was returned</h1>\n<p><img alt=\"six digit code\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-06-20-12-11-04-0bd390.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"350\">\n</p><p>If you receive a message that an email was returned:\n</p>\n<ol><li>Please check your email settings that accounts@firefox.com is not flagged as spam.\n</li><li>Add accounts@firefox.com to your address book. This will make it a trusted email.\n</li></ol>\n<div class=\"warning\">If you have tried all of the above, do not try to do this again until 24 hours have gone by, or else your account will be locked.</div>\n<h1 id=\"w_my-mozilla-account-has-been-locked\">My Mozilla account has been locked</h1>\n<p><img alt=\"Sorry, locked account\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-06-20-12-11-23-140208.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"350\">\n</p><p>If you become locked out, first wait at least 24 hours and then try again. If this is a valid email address that you have access to, you can contact us through the link in the error notice, respond to your support email or just click the <span class=\"button\">Contact Support</span> button in the <em>Still need help?</em> block at the end of this article.\n</p>\n<h1 id=\"w_i-no-longer-have-access-to-the-email-address-associated-with-my-account\">I no longer have access to the email address associated with my account</h1>\n<p>If you no longer have access to the email account, you will need to create another Mozilla account with a working email address. We also recommend reaching out to your previous email provider as they may be able to grant you temporary access to your account.\n</p>",
  "text": "When you sign up for a Mozilla account, we will send you a 6-digit confirmation code, to confirm that you own the email address connected to the account. We will also send you an email to confirm your sign in if you are signing into a new device for the first time. If you're having issues confirming your account, try these common solutions. For other Mozilla account issues, see I'm having problems with my Mozilla account . Table of Contents 1 I haven't received an email to confirm my account 2 My code isn’t being accepted 3 An email was returned 4 My Mozilla account has been locked 5 I no longer have access to the email address associated with my account I haven't received an email to confirm my account The confirmation code email can take several minutes to get to your inbox. You must enter the code within 10 minutes of receiving it. If you still haven’t received the code within this timeframe after attempting to sign in: Try again. Some email providers may block the very first email, if it’s the first time seeing an email from us Check your email from your internet browser instead of using an app like Mail or Outlook Search your inbox for an email from accounts@firefox.com Spam filters might also prevent it from reaching the right mail folder. If you've already waited a few minutes and refreshed your inbox, check your junk mail or spam folder to see if your confirmation email ended up there Try adding accounts@firefox.com to your list of allowed senders to keep your email provider from blocking the email. You can then re-enter the information on the Mozilla account signup page, or click the Need another code? Resend link on the page to enter a 6-digit confirmation code, to receive another email. My code isn’t being accepted If your code isn’t being accepted, it's likely that it has exceeded its 10 minute expiration and you will need to generate another one. To do this you can request another code from the same confirmation window. If you’ve navigated away from the window, simply attempt to sign in again. Note: Confirmation codes expire 10 minutes after they are generated. An email was returned If you receive a message that an email was returned: Please check your email settings that accounts@firefox.com is not flagged as spam. Add accounts@firefox.com to your address book. This will make it a trusted email. If you have tried all of the above, do not try to do this again until 24 hours have gone by, or else your account will be locked. My Mozilla account has been locked If you become locked out, first wait at least 24 hours and then try again. If this is a valid email address that you have access to, you can contact us through the link in the error notice, respond to your support email or just click the Contact Support button in the Still need help? block at the end of this article. I no longer have access to the email address associated with my account If you no longer have access to the email account, you will need to create another Mozilla account with a working email address. We also recommend reaching out to your previous email provider as they may be able to grant you temporary access to your account.",
  "products": [
    "firefox",
    "mozilla-account"
  ],
  "topics": [
    "accounts",
    "passwords-and-sign-in"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5198,
    "text_bytes": 3165,
    "word_count": 564,
    "downloaded_at": "2025-08-26T10:36:04.711666"
  }
}