{
  "slug": "im-having-problems-my-firefox-account",
  "title": "I'm having problems with my Mozilla account",
  "summary": "Get answers for common questions about problems with your Mozilla account.",
  "url": "https://support.mozilla.org/en-US/kb/im-having-problems-my-firefox-account",
  "html": "<p>Need help with your Mozilla account? This article has some solutions to help you get started. If you don’t find an answer here, you can also <a href=\"/en-US/kb/get-community-support\">get community support</a>.\n</p><p>For questions about using Mozilla accounts on Mozilla Support, see <a href=\"/en-US/kb/firefox-accounts-supportmozillaorg\">Mozilla account on support.mozilla.org</a>.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_ive-created-a-mozilla-account-what-can-i-do-with-it\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">I’ve created a Mozilla account. What can I do with it?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_im-having-trouble-verifying-my-mozilla-account\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">I’m having trouble verifying my Mozilla account</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-received-an-email-from-mozilla-accounts-what-should-i-do\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">I received an email from Mozilla accounts. What should I do?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_verification-code-email\"><span class=\"tocnumber\">3.1</span> <span class=\"toctext\">“Verification code” email</span></a></li><li class=\"toclevel-2\"><a href=\"#w_new-sign-in-to-firefox-email\"><span class=\"tocnumber\">3.2</span> <span class=\"toctext\">“New sign-in to Firefox” email</span></a></li><li class=\"toclevel-2\"><a href=\"#w_finish-creating-your-account-email\"><span class=\"tocnumber\">3.3</span> <span class=\"toctext\">“Finish creating your account” email</span></a></li><li class=\"toclevel-2\"><a href=\"#w_secondary-email-added-email\"><span class=\"tocnumber\">3.4</span> <span class=\"toctext\">“Secondary email added” email</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-change-my-mozilla-account-password\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">How do I change my Mozilla account password?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-dont-know-my-password-how-can-i-set-a-new-password\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">I don't know my password.  How can I set a new password?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-reset-my-mozilla-account\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">How do I reset my Mozilla account?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_can-i-change-the-email-address-for-my-mozilla-account\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">Can I change the email address for my Mozilla account?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-use-mozilla-accounts-on-my-devices\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">How do I use Mozilla accounts on my devices?</span></a></li></ul></div>\n<h1 id=\"w_ive-created-a-mozilla-account-what-can-i-do-with-it\">I’ve created a Mozilla account. What can I do with it?</h1>\n<p>First of all, thanks for signing up! We created a page to help you understand and make the most of all the great features your Mozilla account has to offer: <a href=\"/en-US/kb/access-mozilla-services-firefox-account\">Access Mozilla services with a Mozilla account</a>.\n</p>\n<h1 id=\"w_im-having-trouble-verifying-my-mozilla-account\">I’m having trouble verifying my Mozilla account</h1>\n<p>When you sign up for a Mozilla account or if your <a href=\"/en-US/kb/accounts-blocked\">sign in is blocked for security reasons</a>, we will send you an email to confirm that you own the email address connected to the account. This page will help you with verification issues: <a href=\"/en-US/kb/im-having-problems-confirming-my-firefox-account\">I'm having problems confirming my Mozilla account</a>.\n</p><p>If you’re still unable to sign in or verify your account, try creating another Mozilla account with a different email address. \n</p>\n<h1 id=\"w_i-received-an-email-from-mozilla-accounts-what-should-i-do\">I received an email from Mozilla accounts. What should I do?</h1>\n<p>Mozilla account sends various emails for security purposes and to help guide your experience. You might receive the following emails:\n\n</p>\n<h2 id=\"w_verification-code-email\">“Verification code” email</h2>\n<p>When you receive an email from Mozilla accounts with a six-digit verification code, you must enter the 6-digit verification code on the sign-in page to confirm your account. You may receive a verification code email when you first sign up for a new Mozilla account, or if you sign out and later sign back in to your Mozilla account.\n</p>\n<dl><dt><img alt=\"FxA-NewAccount-VerificationCode-Email\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2020-03-19-06-30-17-6c13ff.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<h2 id=\"w_new-sign-in-to-firefox-email\">“New sign-in to Firefox” email</h2>\n<p>You may receive a “New sign-in to Firefox” email with a <span class=\"button\">Manage account</span> button that links to the <a href=\"https://accounts.firefox.com/settings\">Mozilla account settings page</a>.\n</p>\n<dl><dt><img alt=\"FxAemail-NewSign-in\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2020-03-28-19-12-20-7740ce.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>This can happen when you sign in to an existing Mozilla account using a new device or profile. If you are not sure why you received this email, we recommend that you reset your Mozilla account password and also change your email password.\n</p>\n<h2 id=\"w_finish-creating-your-account-email\">“Finish creating your account” email</h2>\n<p>This email means someone created an account with your email address. If it was you, then please confirm your email.\n</p><p>If you are not sure, then do not click the <span class=\"button\">Confirm email</span> link in the Mozilla accounts email. If you confirmed the email by accident, then you should reset the Mozilla account password to avoid security issues.\n</p>\n<h2 id=\"w_secondary-email-added-email\">“Secondary email added” email</h2>\n<p>You receive an email with a verification code to confirm your secondary email. After entering the code in the verification section, you'll receive a notification in your primary email alerting you that a secondary email has been added to your Mozilla account.\n</p>\n<h1 id=\"w_how-do-i-change-my-mozilla-account-password\">How do I change my Mozilla account password?</h1>\n<p>You can change your password from the <a href=\"https://accounts.firefox.com/settings\">Mozilla account settings page</a> by following these steps:\n</p><ol><li>(In Firefox for desktop) Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the menu panel.\n\n</li><li>Click your Mozilla account name or email address (or click <span class=\"menu\">Sign in</span>).\n</li><li>Click <span class=\"menu\">Manage Account</span>\n<ul><li>Alternatively, go to <a href=\"https://accounts.firefox.com/signin\">Mozilla account Sign in</a>.\n</li></ul>\n</li><li>On the Mozilla account page, scroll down to the <strong>Security</strong> section and click the <span class=\"button\">Change</span> button next to  <strong>Password</strong>.\n</li><li>Follow the steps to enter your old and new passwords, then click <span class=\"button\">Save</span> to finish.\n</li></ol>\n<p></p>\n<h1 id=\"w_i-dont-know-my-password-how-can-i-set-a-new-password\">I don't know my password.  How can I set a new password?</h1>\n<p>If you don't know or forgot your password, you will have to reset your Mozilla account (<a href=\"#w_how-do-i-reset-my-mozilla-account\">see below</a>).\n</p>\n<h1 id=\"w_how-do-i-reset-my-mozilla-account\">How do I reset my Mozilla account?</h1>\n<p>Use the <strong>Forgot password?</strong> link on any Mozilla account sign-in page and follow the prompts to reset your password. This will reset your Mozilla account. Your personal data, such as bookmarks and logins, will no longer be synced to other devices (unless you reset your account with <a href=\"/en-US/kb/reset-your-firefox-account-password-recovery-keys\">recovery keys</a>). To learn more, see <a href=\"/en-US/kb/ive-lost-my-firefox-sync-account-information\">I've lost my Firefox Sync account information - What to do</a> and <a href=\"/en-US/kb/how-change-or-reset-your-mozilla-account-password\">How to change or reset your Mozilla account password</a>.\n</p>\n<h1 id=\"w_can-i-change-the-email-address-for-my-mozilla-account\">Can I change the email address for my Mozilla account?</h1>\n<p>You change the primary email address associated with your Mozilla account if you have a secondary email address registered for the account. For more information, see <a href=\"/en-US/kb/change-primary-email-address-firefox-accounts\">Change the primary email address on your Mozilla account</a>.\n</p>\n<h1 id=\"w_how-do-i-use-mozilla-accounts-on-my-devices\">How do I use Mozilla accounts on my devices?</h1>\n<p>For help setting up and using Mozilla accounts and Sync, see:\n</p>\n<ul><li><a href=\"/topics/sync-data/firefox\">Sync on Firefox desktop</a>\n</li><li><a href=\"/topics/sync-data/mobile\">Sync on Firefox for Android</a>\n</li><li><a href=\"/en-US/kb/sync-bookmarks-logins-and-browsing-history-firefox\">Sync on Firefox for iOS</a>\n</li></ul>",
  "text": "Need help with your Mozilla account? This article has some solutions to help you get started. If you don’t find an answer here, you can also get community support . For questions about using Mozilla accounts on Mozilla Support, see Mozilla account on support.mozilla.org . Table of Contents 1 I’ve created a Mozilla account. What can I do with it? 2 I’m having trouble verifying my Mozilla account 3 I received an email from Mozilla accounts. What should I do? 3.1 “Verification code” email 3.2 “New sign-in to Firefox” email 3.3 “Finish creating your account” email 3.4 “Secondary email added” email 4 How do I change my Mozilla account password? 5 I don't know my password. How can I set a new password? 6 How do I reset my Mozilla account? 7 Can I change the email address for my Mozilla account? 8 How do I use Mozilla accounts on my devices? I’ve created a Mozilla account. What can I do with it? First of all, thanks for signing up! We created a page to help you understand and make the most of all the great features your Mozilla account has to offer: Access Mozilla services with a Mozilla account . I’m having trouble verifying my Mozilla account When you sign up for a Mozilla account or if your sign in is blocked for security reasons , we will send you an email to confirm that you own the email address connected to the account. This page will help you with verification issues: I'm having problems confirming my Mozilla account . If you’re still unable to sign in or verify your account, try creating another Mozilla account with a different email address. I received an email from Mozilla accounts. What should I do? Mozilla account sends various emails for security purposes and to help guide your experience. You might receive the following emails: “Verification code” email When you receive an email from Mozilla accounts with a six-digit verification code, you must enter the 6-digit verification code on the sign-in page to confirm your account. You may receive a verification code email when you first sign up for a new Mozilla account, or if you sign out and later sign back in to your Mozilla account. “New sign-in to Firefox” email You may receive a “New sign-in to Firefox” email with a Manage account button that links to the Mozilla account settings page . This can happen when you sign in to an existing Mozilla account using a new device or profile. If you are not sure why you received this email, we recommend that you reset your Mozilla account password and also change your email password. “Finish creating your account” email This email means someone created an account with your email address. If it was you, then please confirm your email. If you are not sure, then do not click the Confirm email link in the Mozilla accounts email. If you confirmed the email by accident, then you should reset the Mozilla account password to avoid security issues. “Secondary email added” email You receive an email with a verification code to confirm your secondary email. After entering the code in the verification section, you'll receive a notification in your primary email alerting you that a secondary email has been added to your Mozilla account. How do I change my Mozilla account password? You can change your password from the Mozilla account settings page by following these steps: (In Firefox for desktop) Click the menu button to open the menu panel. Click your Mozilla account name or email address (or click Sign in ). Click Manage Account Alternatively, go to Mozilla account Sign in . On the Mozilla account page, scroll down to the Security section and click the Change button next to Password . Follow the steps to enter your old and new passwords, then click Save to finish. I don't know my password. How can I set a new password? If you don't know or forgot your password, you will have to reset your Mozilla account ( see below ). How do I reset my Mozilla account? Use the Forgot password? link on any Mozilla account sign-in page and follow the prompts to reset your password. This will reset your Mozilla account. Your personal data, such as bookmarks and logins, will no longer be synced to other devices (unless you reset your account with recovery keys ). To learn more, see I've lost my Firefox Sync account information - What to do and How to change or reset your Mozilla account password . Can I change the email address for my Mozilla account? You change the primary email address associated with your Mozilla account if you have a secondary email address registered for the account. For more information, see Change the primary email address on your Mozilla account . How do I use Mozilla accounts on my devices? For help setting up and using Mozilla accounts and Sync, see: Sync on Firefox desktop Sync on Firefox for Android Sync on Firefox for iOS",
  "products": [
    "firefox",
    "mozilla-account"
  ],
  "topics": [
    "account-management",
    "accounts",
    "passwords-and-sign-in"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 9657,
    "text_bytes": 4805,
    "word_count": 844,
    "downloaded_at": "2025-08-26T10:36:58.565052"
  }
}