{
  "slug": "insecure-password-warning-firefox",
  "title": "Insecure connection password warning in Firefox",
  "summary": "Firefox will show you a \"connection is not secure\" warning message when a website login page is insecure and information could be stolen.",
  "url": "https://support.mozilla.org/en-US/kb/insecure-password-warning-firefox",
  "html": "<p>A secure webpage will have <span class=\"for\" data-for=\"not fx137\">an address that begins with <em>https://</em> and </span>a lock icon <img alt=\"Fx89Padlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-33-33-7bdc86.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the address bar. If a login page you're viewing does not have a secure connection, the Firefox address bar will show a lock icon with a red strike-through <img alt=\"Fx89Padlock-RedLine\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-53-30-fe088c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"30\">.\n</p><p>If you enter a password on an insecure webpage, eavesdroppers or attackers could steal it. You will also see a warning message when you click inside the login box to enter a username or password.\n</p>\n<dl><dt><img alt=\"Fx122InsecureLogin\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-01-26-13-38-06-17aacc.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div class=\"note\"><strong>Note:</strong> When you start entering your login information, the warning message can obscure the password entry box. To dismiss the warning, either press the <span class=\"key\">Tab</span> key or click the page background after you type in your username.</div>\n<h1 id=\"w_what-can-i-do-if-a-login-page-is-insecure\">What can I do if a login page is insecure?</h1>\n<p>If the login page is not secure, check if a secure version exists by adding <strong>https://</strong> in front of the website address. You can also contact the website administrator and ask them to secure the connection. Otherwise, it is not recommended that you submit any information through the page.\n</p>\n<h1 id=\"w_about-insecure-pages\">About insecure pages</h1>\n<p>Insecure pages do not provide secure connections for visitors. Instead, they use an unencrypted (HTTP) connection, and any information shared with these pages is at risk. Pages that need to transmit private information (such as credit cards, personal information and passwords) need to have a secure connection to help prevent attackers from stealing your information.\n</p><p>You should not enter private information, such as passwords or any personal detail, on a page with an insecure connection. The information you enter over an insecure connection can be stolen. To learn more, see <a href=\"/en-US/kb/how-do-i-tell-if-my-connection-is-secure\">How do I tell if my connection to a website is secure?</a>\n</p>\n<h1 id=\"w_note-for-developers\">Note for developers</h1>\n<p>For developers looking to learn more about this warning, please see <a href=\"https://developer.mozilla.org/docs/Web/Security/Insecure_passwords\">this <em>MDN Web Docs</em> page</a>. The documentation explains when and why Firefox shows this warning, and provides some details on how to fix the issue. For more information, see <a href=\"https://blog.mozilla.org/tanvi/2016/01/28/no-more-passwords-over-http-please/\">this Mozilla blog post</a>.\n</p>",
  "text": "A secure webpage will have an address that begins with https:// and a lock icon in the address bar. If a login page you're viewing does not have a secure connection, the Firefox address bar will show a lock icon with a red strike-through . If you enter a password on an insecure webpage, eavesdroppers or attackers could steal it. You will also see a warning message when you click inside the login box to enter a username or password. Note: When you start entering your login information, the warning message can obscure the password entry box. To dismiss the warning, either press the Tab key or click the page background after you type in your username. What can I do if a login page is insecure? If the login page is not secure, check if a secure version exists by adding https:// in front of the website address. You can also contact the website administrator and ask them to secure the connection. Otherwise, it is not recommended that you submit any information through the page. About insecure pages Insecure pages do not provide secure connections for visitors. Instead, they use an unencrypted (HTTP) connection, and any information shared with these pages is at risk. Pages that need to transmit private information (such as credit cards, personal information and passwords) need to have a secure connection to help prevent attackers from stealing your information. You should not enter private information, such as passwords or any personal detail, on a page with an insecure connection. The information you enter over an insecure connection can be stolen. To learn more, see How do I tell if my connection to a website is secure? Note for developers For developers looking to learn more about this warning, please see this MDN Web Docs page . The documentation explains when and why Firefox shows this warning, and provides some details on how to fix the issue. For more information, see this Mozilla blog post .",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3417,
    "text_bytes": 1925,
    "word_count": 330,
    "downloaded_at": "2025-08-26T10:36:56.355123"
  }
}