{
  "slug": "ive-lost-my-firefox-sync-account-information",
  "title": "I've lost my Firefox Sync account information - What to do",
  "summary": "This article explains what to do if you forget or lose your Mozilla account password and can't access your Sync account.",
  "url": "https://support.mozilla.org/en-US/kb/ive-lost-my-firefox-sync-account-information",
  "html": "<p>\n</p>\n<div class=\"warning\"><strong>This article may include outdated content. Please see <a href=\"/en-US/kb/how-change-or-reset-your-mozilla-account-password\">How to change or reset your Mozilla account password</a> for current information and instructions.</strong></div>\n<p>Firefox Sync works by storing your data on Mozilla servers and synchronizing it with your computers and devices. When you set up Sync, you enter an email address and password in order to prevent others from accessing your account. In addition, we <a href=\"http://en.wikipedia.org/wiki/Encrypted\">encrypt</a> your data with a key derived from your password in order to keep it safe on the server. This article explains what to do if you forget or lose any of this important information and are unable to access your Sync account.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_ive-forgotten-my-mozilla-account-password-how-do-i-reset-it\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">I’ve forgotten my Mozilla account password – how do I reset it?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-no-longer-have-access-to-my-mozilla-account-email-address\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">I no longer have access to my Mozilla account email address</span></a></li></ul></div>\n<h1 id=\"w_ive-forgotten-my-mozilla-account-password-how-do-i-reset-it\">I’ve forgotten my Mozilla account password – how do I reset it?</h1>\n<p>To get a new password, follow these steps.\n</p>\n<div class=\"warning\">Any data you have on the server will be erased when you reset your password (unless you use <a href=\"/en-US/kb/reset-your-firefox-account-password-recovery-keys\">recovery keys</a>). Your other devices will stop synchronizing unless you update them with the new password.</div>\n<ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and click <span class=\"button\">Sign In</span> next to <em>Sync and save data</em>.\n</li><li>On the <em>Sign in</em> page, click <strong>Forgot password?</strong> Firefox will send you a reset email.\n</li><li>Follow the instructions in your reset email to change your password.\n</li><li>After signing in with your new password, remember to update your password on each of your synced devices.\n</li></ol>\n<div class=\"note\"><strong>Note:</strong> If you don't see the Overflow Menu <img alt=\"OverflowMenuIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-08-10-10-20-06-811d3d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"20\"> button (More Tools), click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, then click <span class=\"button\">Sign In</span> next to <em>Sync and save data</em>.</div>\n<h1 id=\"w_i-no-longer-have-access-to-my-mozilla-account-email-address\">I no longer have access to my Mozilla account email address</h1>\n<p>Unfortunately, you can't change or recover the email address associated with a Firefox Sync account (except as noted below). You would need to create a new account following the steps described in <a href=\"/en-US/kb/how-do-i-set-sync-my-computer\">this article</a>.\n</p>\n<div class=\"note\"><strong>Note:</strong> If you lost access to your Mozilla account email address, it's possible to <a href=\"/en-US/kb/change-primary-email-address-firefox-accounts\">change the primary email address</a>, but only if you previously registered a secondary address for that account. That's because you are sent an email to your primary email address to confirm it, when you add a secondary address.</div>",
  "text": "This article may include outdated content. Please see How to change or reset your Mozilla account password for current information and instructions. Firefox Sync works by storing your data on Mozilla servers and synchronizing it with your computers and devices. When you set up Sync, you enter an email address and password in order to prevent others from accessing your account. In addition, we encrypt your data with a key derived from your password in order to keep it safe on the server. This article explains what to do if you forget or lose any of this important information and are unable to access your Sync account. Table of Contents 1 I’ve forgotten my Mozilla account password – how do I reset it? 2 I no longer have access to my Mozilla account email address I’ve forgotten my Mozilla account password – how do I reset it? To get a new password, follow these steps. Any data you have on the server will be erased when you reset your password (unless you use recovery keys ). Your other devices will stop synchronizing unless you update them with the new password. Click the menu button and click Sign In next to Sync and save data . On the Sign in page, click Forgot password? Firefox will send you a reset email. Follow the instructions in your reset email to change your password. After signing in with your new password, remember to update your password on each of your synced devices. Note: If you don't see the Overflow Menu button (More Tools), click the menu button , then click Sign In next to Sync and save data . I no longer have access to my Mozilla account email address Unfortunately, you can't change or recover the email address associated with a Firefox Sync account (except as noted below). You would need to create a new account following the steps described in this article . Note: If you lost access to your Mozilla account email address, it's possible to change the primary email address , but only if you previously registered a secondary address for that account. That's because you are sent an email to your primary email address to confirm it, when you add a secondary address.",
  "products": [
    "firefox",
    "mozilla-account"
  ],
  "topics": [
    "account-management",
    "accounts",
    "backup-recovery-and-sync",
    "passwords-and-sign-in",
    "reset-passwords",
    "sync-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4193,
    "text_bytes": 2114,
    "word_count": 375,
    "downloaded_at": "2025-08-26T10:35:22.561556"
  }
}