{
  "slug": "manage-downloads-preferences-using-downloads-menu",
  "title": "How file downloads are handled in Firefox",
  "summary": "This article describes changes to how downloads are handled and answers some frequently asked questions.",
  "url": "https://support.mozilla.org/en-US/kb/manage-downloads-preferences-using-downloads-menu",
  "html": "<p>This article describes enhancements made to how downloads are handled since <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 98 and answers some frequently asked questions.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_firefox-no-longer-asks-what-to-do-for-each-file-by-default\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Firefox no longer asks what to do for each file by default</span></a></li><li class=\"toclevel-1\"><a href=\"#w_downloads-panel-automatically-opens\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Downloads panel automatically opens</span></a></li><li class=\"toclevel-1\"><a href=\"#w_downloaded-files-are-saved-to-disk\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Downloaded files are saved to disk</span></a></li><li class=\"toclevel-1\"><a href=\"#w_set-a-default-app-to-open-a-file-type\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Set a default app to open a file type</span></a></li><li class=\"toclevel-1\"><a href=\"#w_always-open-similar-files-and-other-downloads-panel-options\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">“Always Open Similar Files” and other Downloads panel options</span></a></li><li class=\"toclevel-1\"><a href=\"#w_frequently-asked-questions\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Frequently asked questions</span></a></li></ul></div>\n<h1 id=\"w_firefox-no-longer-asks-what-to-do-for-each-file-by-default\">Firefox no longer asks what to do for each file by default</h1>\n<p>You are not prompted to choose a helper application or save to disk before downloading a file, unless you have <a href=\"/en-US/kb/change-firefox-behavior-when-open-file#w_changing-download-actions\">changed your setting</a> for that type of file, for Firefox to always ask what action to take:\n</p>\n<dl><dt><img alt=\"Fx78OpeningFLVfile\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-07-20-07-06-50-26e332.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"400\">\n</dt></dl>\n<h1 id=\"w_downloads-panel-automatically-opens\">Downloads panel automatically opens</h1>\n<p>Every time you start a download, Firefox will automatically bring up the Downloads panel by default, so you can experience minimal interruptions and easily find your downloaded files (to avoid having to close it several times, the panel won't show if there are multiple downloads in progress).\n</p>\n<dl><dt><img alt=\"Fx97DownloadFile\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-01-24-03-20-18-abcb2e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"400\">\n</dt></dl>\n<p>To hide this panel when a download begins, right-click on the downloads button <img alt=\"Fx91DownloadsButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-01-30-12-15-40-415bec.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, and uncheck the option <span class=\"menu\">Show Panel When Download Begins</span>.\n</p>\n<dl><dt><img alt=\"Downloads_ContextM\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-06-24-07-57-40-69fb53.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"250\">\n</dt></dl>\n<h1 id=\"w_downloaded-files-are-saved-to-disk\">Downloaded files are saved to disk</h1>\nThe files you download will be immediately saved on your disk. Depending on the current configuration, they will be saved in your preferred download folder, or you will be asked to select a location for each download. Windows and Linux users will find their downloaded files in the destination folder (this is usually the Downloads folder). They are not put in the Temp folder first.<div class=\"note\"><strong>Note:</strong> You can delete downloaded files directly from the Downloads panel or <a href=\"/en-US/kb/where-find-and-manage-downloaded-files-firefox#w_see-downloads-history\">Downloads Library window</a>. <span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Control</span> key while you click</span>\n the file entry and select <span class=\"menu\">Delete</span> from the context menu.</div>\n<p>If you have security software installed on your system, such as an antivirus, it can scan any files you download. If you notice that downloading large files takes a while to complete, sometimes increasing the CPU usage, this is not done by Firefox, but by the security software.\n</p>\n<h1 id=\"w_set-a-default-app-to-open-a-file-type\">Set a default app to open a file type</h1>\n<p>When you <a href=\"/en-US/kb/change-firefox-behavior-when-open-file\">set an application to open files of a specific type</a> in your Firefox preference settings, those files will open automatically, even files served by the website with <em>content-disposition: attachment</em>. The same applies to PDF files that are set to open in Firefox by default. This is a fix to <a href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=453455\">bug 453455</a>.\n</p>\n<h1 id=\"w_always-open-similar-files-and-other-downloads-panel-options\">“Always Open Similar Files” and other Downloads panel options</h1>\n<p>When you download a file that can be opened with an installed application, you can <a href=\"/en-US/kb/change-firefox-behavior-when-open-file#w_adding-download-actions\">add a preference</a> to always open similar files, from the Downloads panel context menu for the file. <span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Control</span> key while you click</span>\n the file to see this menu item and other available options for that download. (The <em>Always Open Similar Files</em> option is also available for files listed in the <a href=\"/en-US/kb/where-find-and-manage-downloaded-files-firefox#w_see-downloads-history\">Downloads Library window</a>.)\n</p>\n<dl><dt><img alt=\"Fx98Downloads-FileContextMenu\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-02-23-16-10-39-02aa06.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>The following options are available. You will not see some of these options for files that have been deleted, renamed or moved from the download folder.\n</p>\n<ul><li><strong>Always Open Similar Files:</strong> Make Firefox automatically open downloaded files of the same type with the system default application. (This option may be missing in some cases, such as files served by the website with the wrong content type, or executable files.)\n</li><li><strong>Show In Folder:</strong> Open the folder that contains your downloaded files and select the file used to open the context menu.\n</li><li><strong>Go To Download Page:</strong> Open in a new tab the page from which the file was downloaded, even after leaving the site or closing the tab.\n</li><li><strong>Copy Download Link:</strong> Copy the download link to share it, save it, or for any applicable use.\n</li><li><strong>Delete:</strong> Remove a downloaded file from your disk. It will appear in the list as <em>File deleted</em>.\n</li><li><strong>Remove From History:</strong> Remove a file from your list of downloaded files. The downloaded file is not deleted from your disk.\n</li><li><strong>Clear Preview Panel:</strong> Clear the list of downloaded items in the preview panel that opens when you start a download.\n</li></ul>\n<p>To learn more about managing downloads, see the article <a href=\"/en-US/kb/where-find-and-manage-downloaded-files-firefox\">Where to find and manage downloaded files in Firefox</a>.\n</p>\n<h1 id=\"w_frequently-asked-questions\">Frequently asked questions</h1>\n<p><strong>The <em>What should Firefox do with this file?</em> dialog was a helpful way to see when something downloaded. How do I notice this now?</strong><br>\nThe Downloads panel will show automatically after you start a download.\n</p><p><strong>I want to approve each download before it happens, is there a way to do this?</strong><br>\nFirefox no longer shows the dialog by default because downloads are usually intentional. Having to click a second time for a download to start is usually unnecessary. Once a content type has been set up on the Settings page, you can change its action from <strong>Save file</strong> to <strong>Always ask</strong>. The steps are listed below under “I want to configure a different behavior for some files. How do I do that without the dialog?”\n</p><p>If you prefer to have Firefox ask you what to do with files that do <strong>not</strong> have an action defined on the Settings page, you can go to the bottom of the <em>Applications</em> section under <em>What should Firefox do with other files?</em> and select <strong>Ask whether to open or save files</strong>.\n</p>\n<dl><dt><img alt=\"Fx101settings-Applications-OtherFiles\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-05-04-05-39-45-6cd522.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>When you choose the setting <em>Ask whether to open or save files</em>, you will see a <em>What should Firefox do with this file?</em> prompt when you download any file that has no defined content type.\n</p><p><strong>Why does Firefox keep asking me where to save files?</strong><br>\nThis will happen if you have configured your Firefox settings to always ask you where to save files. To check your download settings:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>In the <span class=\"menu\">General</span> panel, find the <strong>Downloads</strong> section under <em>Files and Applications</em>.\n<dl><dt><span class=\"for\" data-for=\"win\"><img alt=\"Fx101ChangeDownloadLocation-win\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-07-03-23-31-59-c51cf8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</dt></dl>\n</li></ol>\n<p>See <a href=\"/en-US/kb/where-find-and-manage-downloaded-files-firefox#w_change-where-downloads-are-saved\">Change where downloads are saved</a> for more information.\n</p><p><strong>When I open a file with an application, why is it also saved to my Downloads folder?</strong><br>\nBefore Firefox version 98, files you opened in Firefox with an application were also saved to the system Temp folder on Windows and Linux, even though you may not have been aware of it. Firefox no longer saves files to a temporary folder because of the downsides to saving files in a location that is hard to discover. Instead, files are saved to the <em>Save files to</em> folder location shown in Firefox settings, in the <span class=\"menu\">General</span> panel <strong>Downloads</strong> section under <em>Files and Applications</em>. (Firefox will not ask you to choose a folder when opening files if you have selected the <em>Always ask you where to save files</em> setting, to prevent unnecessary interruptions.)\n</p><p><strong>I want to configure a different behavior for some files. How do I do that without the dialog?</strong><br>\nWhen you select <em>Always Open Similar Files</em> in the context menu for a downloaded file, it will set Firefox to always open that type of file with the system default application. If you want a different behavior:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>In the <span class=\"menu\">General</span> panel, go to the <strong>Applications</strong> section.\n<dl><dt><img alt=\"Fx97ChangeDownloadActions\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-01-24-04-25-50-30296e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> Select the type of file you wish to change and use the drop-down menu to change the download action, such as using another application to open that type of file or having Firefox always ask you what to do.\n</li></ol>\n<p>For more information, see <a href=\"/en-US/kb/change-firefox-behavior-when-open-file\">Manage file types and download actions in Firefox</a>.\n</p>",
  "text": "This article describes enhancements made to how downloads are handled since Firefox version 98 and answers some frequently asked questions. Table of Contents 1 Firefox no longer asks what to do for each file by default 2 Downloads panel automatically opens 3 Downloaded files are saved to disk 4 Set a default app to open a file type 5 “Always Open Similar Files” and other Downloads panel options 6 Frequently asked questions Firefox no longer asks what to do for each file by default You are not prompted to choose a helper application or save to disk before downloading a file, unless you have changed your setting for that type of file, for Firefox to always ask what action to take: Downloads panel automatically opens Every time you start a download, Firefox will automatically bring up the Downloads panel by default, so you can experience minimal interruptions and easily find your downloaded files (to avoid having to close it several times, the panel won't show if there are multiple downloads in progress). To hide this panel when a download begins, right-click on the downloads button , and uncheck the option Show Panel When Download Begins . Downloaded files are saved to disk The files you download will be immediately saved on your disk. Depending on the current configuration, they will be saved in your preferred download folder, or you will be asked to select a location for each download. Windows and Linux users will find their downloaded files in the destination folder (this is usually the Downloads folder). They are not put in the Temp folder first. Note: You can delete downloaded files directly from the Downloads panel or Downloads Library window . Right-click Hold down the Control key while you click the file entry and select Delete from the context menu. If you have security software installed on your system, such as an antivirus, it can scan any files you download. If you notice that downloading large files takes a while to complete, sometimes increasing the CPU usage, this is not done by Firefox, but by the security software. Set a default app to open a file type When you set an application to open files of a specific type in your Firefox preference settings, those files will open automatically, even files served by the website with content-disposition: attachment . The same applies to PDF files that are set to open in Firefox by default. This is a fix to bug 453455 . “Always Open Similar Files” and other Downloads panel options When you download a file that can be opened with an installed application, you can add a preference to always open similar files, from the Downloads panel context menu for the file. Right-click Hold down the Control key while you click the file to see this menu item and other available options for that download. (The Always Open Similar Files option is also available for files listed in the Downloads Library window .) The following options are available. You will not see some of these options for files that have been deleted, renamed or moved from the download folder. Always Open Similar Files: Make Firefox automatically open downloaded files of the same type with the system default application. (This option may be missing in some cases, such as files served by the website with the wrong content type, or executable files.) Show In Folder: Open the folder that contains your downloaded files and select the file used to open the context menu. Go To Download Page: Open in a new tab the page from which the file was downloaded, even after leaving the site or closing the tab. Copy Download Link: Copy the download link to share it, save it, or for any applicable use. Delete: Remove a downloaded file from your disk. It will appear in the list as File deleted . Remove From History: Remove a file from your list of downloaded files. The downloaded file is not deleted from your disk. Clear Preview Panel: Clear the list of downloaded items in the preview panel that opens when you start a download. To learn more about managing downloads, see the article Where to find and manage downloaded files in Firefox . Frequently asked questions The What should Firefox do with this file? dialog was a helpful way to see when something downloaded. How do I notice this now? The Downloads panel will show automatically after you start a download. I want to approve each download before it happens, is there a way to do this? Firefox no longer shows the dialog by default because downloads are usually intentional. Having to click a second time for a download to start is usually unnecessary. Once a content type has been set up on the Settings page, you can change its action from Save file to Always ask . The steps are listed below under “I want to configure a different behavior for some files. How do I do that without the dialog?” If you prefer to have Firefox ask you what to do with files that do not have an action defined on the Settings page, you can go to the bottom of the Applications section under What should Firefox do with other files? and select Ask whether to open or save files . When you choose the setting Ask whether to open or save files , you will see a What should Firefox do with this file? prompt when you download any file that has no defined content type. Why does Firefox keep asking me where to save files? This will happen if you have configured your Firefox settings to always ask you where to save files. To check your download settings: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the General panel, find the Downloads section under Files and Applications . See Change where downloads are saved for more information. When I open a file with an application, why is it also saved to my Downloads folder? Before Firefox version 98, files you opened in Firefox with an application were also saved to the system Temp folder on Windows and Linux, even though you may not have been aware of it. Firefox no longer saves files to a temporary folder because of the downsides to saving files in a location that is hard to discover. Instead, files are saved to the Save files to folder location shown in Firefox settings, in the General panel Downloads section under Files and Applications . (Firefox will not ask you to choose a folder when opening files if you have selected the Always ask you where to save files setting, to prevent unnecessary interruptions.) I want to configure a different behavior for some files. How do I do that without the dialog? When you select Always Open Similar Files in the context menu for a downloaded file, it will set Firefox to always open that type of file with the system default application. If you want a different behavior: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . In the General panel, go to the Applications section. Select the type of file you wish to change and use the drop-down menu to change the download action, such as using another application to open that type of file or having Firefox always ask you what to do. For more information, see Manage file types and download actions in Firefox .",
  "products": [
    "firefox"
  ],
  "topics": [
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 14160,
    "text_bytes": 7314,
    "word_count": 1288,
    "downloaded_at": "2025-08-26T10:54:47.061291"
  }
}