{
  "slug": "mixed-content-blocking-firefox",
  "title": "Mixed content blocking in Firefox",
  "summary": "Firefox automatically blocks insecure or mixed content from secure web pages. We'll explain what that means and what options you have.",
  "url": "https://support.mozilla.org/en-US/kb/mixed-content-blocking-firefox",
  "html": "<p>Firefox protects you from attacks by blocking potentially harmful, insecure content on web pages that are supposed to be secure. Keep reading to learn more about mixed content and how to tell if Firefox has blocked it.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-is-mixed-content-and-what-are-the-risks\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What is mixed content and what are the risks?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-can-i-tell-if-a-page-has-mixed-content\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How can I tell if a page has mixed content?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_no-mixed-content-secure\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">No mixed content: secure</span></a></li><li class=\"toclevel-2\"><a href=\"#w_mixed-content-is-not-blocked-not-secure\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">Mixed content is not blocked: not secure</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_unblock-mixed-content\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Unblock mixed content</span></a></li></ul></div>\n<h1 id=\"w_what-is-mixed-content-and-what-are-the-risks\">What is mixed content and what are the risks?</h1>\n<p>\nHTTP is a system for transmitting information from a web server to your browser. HTTP is not secure, so when you visit a page served over HTTP, your connection is open for eavesdropping and <a href=\"https://wikipedia.org/wiki/Man-in-the-middle_attack\">man-in-the-middle attacks</a>. Most websites are served over HTTP because they don't involve passing sensitive information back and forth and do not need to be secured.\n</p><p>When you visit a page fully transmitted over HTTPS, such as your bank, you'll see a padlock icon <img alt=\"Fx89Padlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-33-33-7bdc86.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the address bar (for details, see <a href=\"/en-US/kb/how-do-i-tell-if-my-connection-is-secure\">How do I tell if my connection to a website is secure?</a>). This means that your connection is authenticated and encrypted, and thus safeguarded from both eavesdroppers and man-in-the-middle attacks.\n</p><p>However, if the HTTPS page you visit includes HTTP content, the HTTP portion can be read or modified by attackers, even though the main page is served over HTTPS. When an HTTPS page has HTTP content, we call that content “mixed”. The page you are visiting is only partially encrypted and even though it appears to be secure, it isn't. For more information about mixed content (active and passive), see <a href=\"https://blog.mozilla.org/tanvi/2013/04/10/mixed-content-blocking-enabled-in-firefox-23\">this blog post</a>.\n</p>\n<div class=\"warning\"><strong>What are the risks of mixed content?</strong> An attacker can replace the HTTP content on the page you're visiting in order to steal your credentials, take over your account, acquire sensitive data about you, or attempt to install malware on your computer.</div>\n<h1 id=\"w_how-can-i-tell-if-a-page-has-mixed-content\">How can I tell if a page has mixed content?</h1>\n<p>There are two types of mixed content: mixed passive/display content and mixed active content. The difference lies in the threat level. Look for a padlock icon in your address bar to determine whether the page has mixed content.\n</p><p><span class=\"for\" data-for=\"not fx138\"><img alt=\"Fx89AddressBarPadlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-29-55-5507f4.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"fx138\"><img alt=\"Fx138AddressBarPadlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-05-19-15-16-20-bc8e53.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</p>\n<div class=\"note\"><strong>Note:</strong> The shield icon <img alt=\"Fx89ShieldIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-05-12-06-f2679d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the address bar tells you which trackers have been blocked on a website. See <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection in Firefox for desktop</a> for more information.</div>\n<h2 id=\"w_no-mixed-content-secure\">No mixed content: secure</h2>\n<ul><li><img alt=\"Fx89Padlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-33-33-7bdc86.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">: You’ll see a padlock when you are on a fully secure (HTTPS) page. To see if Firefox has blocked parts of the page that are not secure, click the padlock.<span class=\"for\" data-for=\"not fx139\"> For more information, see the <a href=\"#w_unblock-mixed-content\">Unblock mixed content</a> section below.</span>\n</li></ul>\n<h2 id=\"w_mixed-content-is-not-blocked-not-secure\">Mixed content is not blocked: not secure</h2>\n<ul><li><img alt=\"Fx89Padlock-RedLine\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-53-30-fe088c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">: If you see a padlock with a red line over it, the page contains mixed active content and Firefox is not blocking insecure elements. That page is open to eavesdropping and attacks where your personal data from the site could be stolen. You shouldn’t see this icon on a secure (HTTPS) website<span class=\"for\" data-for=\"not fx139\"> unless you’ve unblocked mixed content using the instructions in the <a href=\"#w_unblock-mixed-content\">Unblock mixed content</a> section below</span>. <strong>Note:</strong> A padlock with a red line is also shown on unencrypted (HTTP) websites.\n</li><li><img alt=\"Fx89Padlock-Triangle\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-55-22-88c82d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">: A padlock with a triangle indicates that Firefox is not blocking insecure passive content, such as images. By default, Firefox does not block mixed passive content; you will simply see a warning that the page isn't fully secure. Attackers may be able to manipulate parts of the page like displaying misleading or inappropriate content, but they should not be able to steal your personal data from the site.\n</li></ul>\n<p>For more information about mixed active and passive content, see <a href=\"https://developer.mozilla.org/docs/Web/Security/Mixed_content\">this MDN Web Docs' article</a>.\n</p><div class=\"for\" data-for=\"not fx139\">\n<h1 id=\"w_unblock-mixed-content\">Unblock mixed content</h1>\n<p>Unblocking insecure elements is not recommended but can be done, if necessary:\n</p>\n<ol><li>Click the padlock icon <img alt=\"Fx89Padlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-33-33-7bdc86.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the address bar.\n</li><li>Click the arrow in the <a href=\"/en-US/kb/site-information-panel\">Site Information</a> panel:\n<dl><dt><img alt=\"Fx89MixedContent\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-31-09-4f76e2.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>Click <span class=\"button\">Disable protection for now</span>.\n<dl><dt><img alt=\"Fx89MixedContent-Unblock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-05-23-17-4fc4ea.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<p>To enable protection, follow the preceding steps and click <span class=\"button\">Enable protection</span>.\n</p>\n<div class=\"warning\"><strong>Warning:</strong> Unblocking mixed content can leave you vulnerable to attacks.</div>\n</div>\n<div class=\"note\"><strong>Developers:</strong> If your website is generating security errors because of insecure content, see <a href=\"https://developer.mozilla.org/docs/Web/Security/Mixed_content#developer_console\">Mixed content (Developer console)</a> at MDN Web Docs.</div>",
  "text": "Firefox protects you from attacks by blocking potentially harmful, insecure content on web pages that are supposed to be secure. Keep reading to learn more about mixed content and how to tell if Firefox has blocked it. Table of Contents 1 What is mixed content and what are the risks? 2 How can I tell if a page has mixed content? 2.1 No mixed content: secure 2.2 Mixed content is not blocked: not secure 3 Unblock mixed content What is mixed content and what are the risks? HTTP is a system for transmitting information from a web server to your browser. HTTP is not secure, so when you visit a page served over HTTP, your connection is open for eavesdropping and man-in-the-middle attacks . Most websites are served over HTTP because they don't involve passing sensitive information back and forth and do not need to be secured. When you visit a page fully transmitted over HTTPS, such as your bank, you'll see a padlock icon in the address bar (for details, see How do I tell if my connection to a website is secure? ). This means that your connection is authenticated and encrypted, and thus safeguarded from both eavesdroppers and man-in-the-middle attacks. However, if the HTTPS page you visit includes HTTP content, the HTTP portion can be read or modified by attackers, even though the main page is served over HTTPS. When an HTTPS page has HTTP content, we call that content “mixed”. The page you are visiting is only partially encrypted and even though it appears to be secure, it isn't. For more information about mixed content (active and passive), see this blog post . What are the risks of mixed content? An attacker can replace the HTTP content on the page you're visiting in order to steal your credentials, take over your account, acquire sensitive data about you, or attempt to install malware on your computer. How can I tell if a page has mixed content? There are two types of mixed content: mixed passive/display content and mixed active content. The difference lies in the threat level. Look for a padlock icon in your address bar to determine whether the page has mixed content. Note: The shield icon in the address bar tells you which trackers have been blocked on a website. See Enhanced Tracking Protection in Firefox for desktop for more information. No mixed content: secure : You’ll see a padlock when you are on a fully secure (HTTPS) page. To see if Firefox has blocked parts of the page that are not secure, click the padlock. For more information, see the Unblock mixed content section below. Mixed content is not blocked: not secure : If you see a padlock with a red line over it, the page contains mixed active content and Firefox is not blocking insecure elements. That page is open to eavesdropping and attacks where your personal data from the site could be stolen. You shouldn’t see this icon on a secure (HTTPS) website unless you’ve unblocked mixed content using the instructions in the Unblock mixed content section below . Note: A padlock with a red line is also shown on unencrypted (HTTP) websites. : A padlock with a triangle indicates that Firefox is not blocking insecure passive content, such as images. By default, Firefox does not block mixed passive content; you will simply see a warning that the page isn't fully secure. Attackers may be able to manipulate parts of the page like displaying misleading or inappropriate content, but they should not be able to steal your personal data from the site. For more information about mixed active and passive content, see this MDN Web Docs' article . Unblock mixed content Unblocking insecure elements is not recommended but can be done, if necessary: Click the padlock icon in the address bar. Click the arrow in the Site Information panel: Click Disable protection for now . To enable protection, follow the preceding steps and click Enable protection . Warning: Unblocking mixed content can leave you vulnerable to attacks. Developers: If your website is generating security errors because of insecure content, see Mixed content (Developer console) at MDN Web Docs.",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 9353,
    "text_bytes": 4064,
    "word_count": 696,
    "downloaded_at": "2025-08-26T10:35:47.071270"
  }
}