{
  "slug": "private-browsing-use-firefox-without-history",
  "title": "Private Browsing - Use Firefox without saving history",
  "summary": "Firefox Private Browsing is great for viewing websites without saving things such as cookies, temp files and a history of the pages you visit.",
  "url": "https://support.mozilla.org/en-US/kb/private-browsing-use-firefox-without-history",
  "html": "<p>Private Browsing does not save your browsing information, such as history and cookies, and leaves no trace after you end the session. By default, when you browse in private windows, you're shielded from third-party cookies and content trackers. Our <a href=\"https://wiki.mozilla.org/Security/Anti_tracking_policy\">anti-tracking policy</a> reflects our commitment to protecting your privacy and keeping you secure. Firefox also has <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a>, which prevents hidden trackers from collecting your data across multiple sites and slowing down your browsing.\n</p>\n<div class=\"note\">Want to learn more? See the <a href=\"/en-US/kb/smartblock-enhanced-tracking-protection\">SmartBlock for Enhanced Tracking Protection</a> article.</div>\n<p></p><div class=\"youtube-embed\">\n  <iframe src=\"//www.youtube.com/embed/TZ6stqlsVsI?wmode=transparent&amp;rel=0\" frameborder=\"0\" allowfullscreen></iframe>\n</div>\n<p></p>\n<div class=\"warning\"><strong>Important:</strong> Private Browsing does not make you anonymous on the Internet. Your Internet service provider, employer, or the sites themselves can still gather information about pages you visit. Private Browsing also doesn't protect you from <a href=\"https://wikipedia.org/wiki/Keylogger\">keyloggers</a> or <a href=\"https://wikipedia.org/wiki/Spyware\">spyware</a> that may be installed on your computer. To learn more, see <a href=\"/en-US/kb/common-myths-about-private-browsing\">Common Myths about Private Browsing</a>.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_how-do-i-open-a-new-private-window\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">How do I open a new Private Window?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-does-private-browsing-not-save\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">What does Private Browsing not save?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_can-i-set-firefox-to-always-use-private-browsing\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Can I set Firefox to always use Private Browsing?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_other-ways-to-control-what-information-firefox-saves\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Other ways to control what information Firefox saves</span></a></li></ul></div>\n<h1 id=\"w_how-do-i-open-a-new-private-window\">How do I open a new Private Window?</h1>\n<p>There are two ways to open a new Private Window:\n</p><p><strong>Open a new Private Window from the Firefox menu</strong>\n</p>\n<ul><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and then click <span class=\"button\">New private window</span>.\n<dl><dt><img alt=\"New private window\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-12-05-10-15-08-a661ea.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ul>\n<p>The Private Browsing home page will open in a new window.\n</p><p><strong>Open a link in a new Private Window</strong>\n</p>\n<ul><li><span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Control</span> key while you click</span>\n any link and choose <span class=\"menu\">Open Link in New Private Window</span> from the context menu.\n<dl><dt><img alt=\"Open link in private\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-12-05-10-15-45-8a6ba0.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ul>\n<div class=\"note\"><strong>Tip:</strong> Private Browsing windows have a purple mask at the top.</div>\n<dl><dt><img alt=\"windows11 private browsing\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-12-05-11-54-40-abf6ae.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<h1 id=\"w_what-does-private-browsing-not-save\">What does Private Browsing not save?</h1>\n<ul><li> <strong>Visited pages:</strong> Pages will not be added to the list of sites in the History menu, the Library window's history list, nor in the <a href=\"/en-US/kb/address-bar-autocomplete-firefox\">address bar</a> drop-down list.\n</li><li> <strong>Form and Search Bar entries:</strong> Nothing you enter into text boxes on web pages nor the <a href=\"/en-US/kb/add-search-bar-firefox-toolbar\">Search bar</a> will be saved for <a href=\"/en-US/kb/control-whether-firefox-automatically-fills-forms\">Form autocomplete</a>.\n</li><li> <strong>Download List entries:</strong> Files you download will not be listed in the <a href=\"/en-US/kb/where-find-and-manage-downloaded-files-firefox\">Downloads Library</a> after you turn off Private Browsing.\n</li><li> <strong>Cookies:</strong> <a href=\"/en-US/kb/cookies-information-websites-store-on-your-computer\">Cookies</a> store information about websites you visit, such as site preferences and login status. Cookies can also be used by third parties to track you across websites.<span class=\"for\" data-for=\"not fx135\"> See the <a href=\"/en-US/kb/how-do-i-turn-do-not-track-feature\">How do I turn on the Do Not Track feature?</a> article to learn more about tracking.</span> Cookies set in private windows are held temporarily in memory, separate from regular window cookies and discarded at the end of your private session (after the last private window is closed).\n</li><li> <strong>Cached Web Content</strong> and <strong>Offline Web Content and User Data:</strong> Temporary Internet files (<a href=\"https://wikipedia.org/wiki/Web_cache\">cached</a> files) and files that websites save for offline use will not be saved.\n</li></ul>\n<div class=\"note\">\n<p><strong>Note:</strong>\n</p>\n<ul><li> New <a href=\"/en-US/kb/password-manager-remember-delete-edit-logins\">passwords</a> and <a href=\"/en-US/kb/bookmarks-firefox\">bookmarks</a> you create while using Private Browsing will be saved.\n</li><li> Any files you download to your computer while using Private Browsing will be saved.\n</li></ul>\n</div>\n<h1 id=\"w_can-i-set-firefox-to-always-use-private-browsing\">Can I set Firefox to always use Private Browsing?</h1>\n<p>Firefox is set to remember history by default, but you can change this setting in your Firefox Privacy Settings\n:\n</p>\n<ol><li> <span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li> Select the <span class=\"menu\">Privacy &amp; Security</span> panel and go to the <strong>History</strong> section.<br><img alt=\"Use Custom settings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-12-05-11-58-19-90589c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</li><li> Choose <strong>Use custom settings for history</strong> from the drop-down menu and check the <strong>Always use private browsing mode</strong> setting.\n<ul><li> Alternatively, you can select <strong>Never remember history</strong> from the drop-down menu, which is equivalent to always being in Private Browsing mode.\n</li></ul>\n</li><li> Restart Firefox.\n</li></ol>\n<div class=\"warning\"><strong>Important:</strong> When Firefox is set to <strong>Always use private browsing mode</strong> or to <strong>Never remember history</strong>, you won't see a purple mask at the top of each window, even though you are in Private Browsing mode. To restore normal browsing, go to your <span class=\"menu\">Privacy &amp; Security</span> Settings\n and uncheck <strong>Always use private browsing mode</strong> from your <strong>Use custom settings for history</strong> settings (or select <strong>Remember history</strong> from the drop-down menu) and restart Firefox.</div>\n<div class=\"for\" data-for=\"win\"><p>You can also <strong>pin Firefox in Private Browsing mode to the Windows taskbar</strong> for easy access:\n</p>\n<ol><li>Click the menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button and select <span class=\"menu\">New Private Window</span>. A new Firefox icon with a small purple mask will show in the Windows taskbar, this is the Private Browsing mode icon.\n</li><li>Right-click the Firefox in Private Browsing mode icon in the taskbar.\n</li><li>Click <strong>Pin to taskbar</strong>.\n</li></ol>\n</div>\n<h1 id=\"w_other-ways-to-control-what-information-firefox-saves\">Other ways to control what information Firefox saves</h1>\n<ul><li>You can always <a href=\"/en-US/kb/delete-browsing-search-download-history-firefox\">remove recent browsing, search and download history</a> after visiting a site.\n</li><li>Read more articles on <a href=\"/products/firefox/privacy-and-security\">Firefox privacy and security</a>.\n</li></ul>",
  "text": "Private Browsing does not save your browsing information, such as history and cookies, and leaves no trace after you end the session. By default, when you browse in private windows, you're shielded from third-party cookies and content trackers. Our anti-tracking policy reflects our commitment to protecting your privacy and keeping you secure. Firefox also has Enhanced Tracking Protection , which prevents hidden trackers from collecting your data across multiple sites and slowing down your browsing. Want to learn more? See the SmartBlock for Enhanced Tracking Protection article. Important: Private Browsing does not make you anonymous on the Internet. Your Internet service provider, employer, or the sites themselves can still gather information about pages you visit. Private Browsing also doesn't protect you from keyloggers or spyware that may be installed on your computer. To learn more, see Common Myths about Private Browsing . Table of Contents 1 How do I open a new Private Window? 2 What does Private Browsing not save? 3 Can I set Firefox to always use Private Browsing? 4 Other ways to control what information Firefox saves How do I open a new Private Window? There are two ways to open a new Private Window: Open a new Private Window from the Firefox menu Click the menu button and then click New private window . The Private Browsing home page will open in a new window. Open a link in a new Private Window Right-click Hold down the Control key while you click any link and choose Open Link in New Private Window from the context menu. Tip: Private Browsing windows have a purple mask at the top. What does Private Browsing not save? Visited pages: Pages will not be added to the list of sites in the History menu, the Library window's history list, nor in the address bar drop-down list. Form and Search Bar entries: Nothing you enter into text boxes on web pages nor the Search bar will be saved for Form autocomplete . Download List entries: Files you download will not be listed in the Downloads Library after you turn off Private Browsing. Cookies: Cookies store information about websites you visit, such as site preferences and login status. Cookies can also be used by third parties to track you across websites. See the How do I turn on the Do Not Track feature? article to learn more about tracking. Cookies set in private windows are held temporarily in memory, separate from regular window cookies and discarded at the end of your private session (after the last private window is closed). Cached Web Content and Offline Web Content and User Data: Temporary Internet files ( cached files) and files that websites save for offline use will not be saved. Note: New passwords and bookmarks you create while using Private Browsing will be saved. Any files you download to your computer while using Private Browsing will be saved. Can I set Firefox to always use Private Browsing? Firefox is set to remember history by default, but you can change this setting in your Firefox Privacy Settings : In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select the Privacy & Security panel and go to the History section. Choose Use custom settings for history from the drop-down menu and check the Always use private browsing mode setting. Alternatively, you can select Never remember history from the drop-down menu, which is equivalent to always being in Private Browsing mode. Restart Firefox. Important: When Firefox is set to Always use private browsing mode or to Never remember history , you won't see a purple mask at the top of each window, even though you are in Private Browsing mode. To restore normal browsing, go to your Privacy & Security Settings and uncheck Always use private browsing mode from your Use custom settings for history settings (or select Remember history from the drop-down menu) and restart Firefox. You can also pin Firefox in Private Browsing mode to the Windows taskbar for easy access: Click the menu button and select New Private Window . A new Firefox icon with a small purple mask will show in the Windows taskbar, this is the Private Browsing mode icon. Right-click the Firefox in Private Browsing mode icon in the taskbar. Click Pin to taskbar . Other ways to control what information Firefox saves You can always remove recent browsing, search and download history after visiting a site. Read more articles on Firefox privacy and security .",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 10166,
    "text_bytes": 4528,
    "word_count": 767,
    "downloaded_at": "2025-08-26T10:34:48.964363"
  }
}