{
  "slug": "program-your-computer-interferes-mozilla-vpn-exten",
  "title": "A program on your computer interferes with the Mozilla VPN extension",
  "summary": "You got a message saying that “A program on your computer may be causing issues with the Mozilla VPN extension”. Here's how you can fix that.",
  "url": "https://support.mozilla.org/en-US/kb/program-your-computer-interferes-mozilla-vpn-exten",
  "html": "<p>The Mozilla VPN extension may display the message: <strong>A program on your computer may be causing issues with the Mozilla VPN extension.</strong>\n</p><p>This issue is often caused by the Killer Network Service (KNS), which monitors and prioritizes network traffic. Unfortunately, KNS can conflict with Mozilla VPN’s functionality, particularly App Exclusions and the Firefox browser extension. This guide shows how to disable the specific setting of KNS that causes this unwanted behavior and restores the smooth operation of Mozilla VPN.\n</p>\n<h1 id=\"w_disable-killer-network-service-kns\">Disable Killer Network Service (KNS)</h1>\n<p>The Killer Network Service (KNS) is a software typically pre-installed on gaming laptops or high-performance PCs with Intel hardware. It helps prioritize network traffic for activities like online gaming or streaming.\n</p><p>While this feature is beneficial in some cases, it can interfere with Mozilla VPN's browser extension and the App Exclusions functionality. To resolve this issue, follow these steps:\n</p>\n<ol><li>Open the Windows menu, and use the search function to look for the <strong>Killer Intelligence Center</strong>.\n</li><li>Once open, locate the <strong>Quick Settings</strong> section on the right side of the application.\n<dl><dt><img alt=\"KNS Quick settings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-09-12-06-28-ddf16c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>Click the toggle next to <strong>Prioritization Engine</strong> to turn it off.\n<dl><dt><img alt=\"Disable prioritization engine\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-09-12-07-34-bcfacc.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"250\">\n</dt></dl>\n</li></ol>\n<p>You are done! This should resolve any conflict with the Mozilla VPN extension and/or the App Exclusions functionality.\n</p>\n<div class=\"note\"><strong>Note:</strong> The Firefox extension may continue to show this warning, but provided the Prioritization Engine is disabled, everything should work correctly. At that point, feel free to simply dismiss the notification in the Mozilla VPN extension.</div>\n<p>To re-enable KNS’s Prioritization Engine, simply follow the steps above and turn the toggle back on.\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/how-will-dns-work-when-using-vpn-extension\">How will DNS work when using the VPN extension?</a>\n</li><li><a href=\"/en-US/kb/disable-vpn-protection-specific-website\">Disable Mozilla VPN protection for a specific website</a>\n</li></ul>",
  "text": "The Mozilla VPN extension may display the message: A program on your computer may be causing issues with the Mozilla VPN extension. This issue is often caused by the Killer Network Service (KNS), which monitors and prioritizes network traffic. Unfortunately, KNS can conflict with Mozilla VPN’s functionality, particularly App Exclusions and the Firefox browser extension. This guide shows how to disable the specific setting of KNS that causes this unwanted behavior and restores the smooth operation of Mozilla VPN. Disable Killer Network Service (KNS) The Killer Network Service (KNS) is a software typically pre-installed on gaming laptops or high-performance PCs with Intel hardware. It helps prioritize network traffic for activities like online gaming or streaming. While this feature is beneficial in some cases, it can interfere with Mozilla VPN's browser extension and the App Exclusions functionality. To resolve this issue, follow these steps: Open the Windows menu, and use the search function to look for the Killer Intelligence Center . Once open, locate the Quick Settings section on the right side of the application. Click the toggle next to Prioritization Engine to turn it off. You are done! This should resolve any conflict with the Mozilla VPN extension and/or the App Exclusions functionality. Note: The Firefox extension may continue to show this warning, but provided the Prioritization Engine is disabled, everything should work correctly. At that point, feel free to simply dismiss the notification in the Mozilla VPN extension. To re-enable KNS’s Prioritization Engine, simply follow the steps above and turn the toggle back on. Related articles How will DNS work when using the VPN extension? Disable Mozilla VPN protection for a specific website",
  "products": [
    "firefox",
    "mozilla-vpn"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2873,
    "text_bytes": 1775,
    "word_count": 274,
    "downloaded_at": "2025-08-26T10:58:59.804647"
  }
}