{
  "slug": "recover-user-data-missing-after-firefox-update",
  "title": "Recover user data missing after Firefox update",
  "summary": "If your bookmarks, passwords, preference settings and other data are missing, it may be available in another Firefox profile. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/recover-user-data-missing-after-firefox-update",
  "html": "<p>If Firefox starts up without your bookmarks, passwords, saved tabs and other settings, check whether your data is available in a different <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile</a>. This can happen because Firefox creates a <a href=\"/en-US/kb/dedicated-profiles-firefox-installation\">dedicated profile for each installation of Firefox</a>.\n</p><p>To recover your Firefox data and settings from another profile:\n</p><p>Type <strong>about:profiles</strong> into the Firefox address bar and press the <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span> key. This will open the <em>About Profiles</em> page.<br><span class=\"for\" data-for=\"win\"><img alt=\"Fx96aboutprofiles-Win\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-01-29-00-08-24-5e11bb.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"mac\"><img alt=\"about:profiles macOS\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2018-10-07-13-36-23-103333.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> </span><span class=\"for\" data-for=\"linux\"><img alt=\"Fx52_about-profiles-linux\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2017-10-14-01-05-24-eccbc8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</p><p>This page should list at least one profile and could list many. The profile that Firefox is currently using will have this under the profile name: <strong>This is the profile in use and it cannot be deleted.</strong>\n</p>\n<div class=\"warning\"><strong>Warning:</strong> Please do not delete any profiles. Don't use any <em>Remove</em> buttons.</div>\n<p>If you have another profile listed on this page, it may contain your missing profile data. You can click the <span class=\"button\">Launch profile in new browser</span> button to open another Firefox window using that profile. If the other profile doesn't contain your missing data, simply close that new window. If it does contain the missing data, you can set it as the profile that Firefox will open by default. Click the <span class=\"button\">Set as default profile</span> button for that profile, and Firefox will use it automatically the next time you open Firefox.\n</p><p>If you can't recover your missing data this way, you may be able to manually recover data from another profile. See the <a href=\"/en-US/kb/restore-bookmarks-passwords-and-data-from-an-old-firefox-profile\">Restore bookmarks, passwords, and data from an old Firefox profile</a> article for details.\n</p><p>For more information about managing Firefox profiles, see the <a href=\"/en-US/kb/profile-manager-create-remove-switch-firefox-profiles\">Profile Manager</a> article.\n</p>",
  "text": "If Firefox starts up without your bookmarks, passwords, saved tabs and other settings, check whether your data is available in a different profile . This can happen because Firefox creates a dedicated profile for each installation of Firefox . To recover your Firefox data and settings from another profile: Type about:profiles into the Firefox address bar and press the Enter Return key. This will open the About Profiles page. This page should list at least one profile and could list many. The profile that Firefox is currently using will have this under the profile name: This is the profile in use and it cannot be deleted. Warning: Please do not delete any profiles. Don't use any Remove buttons. If you have another profile listed on this page, it may contain your missing profile data. You can click the Launch profile in new browser button to open another Firefox window using that profile. If the other profile doesn't contain your missing data, simply close that new window. If it does contain the missing data, you can set it as the profile that Firefox will open by default. Click the Set as default profile button for that profile, and Firefox will use it automatically the next time you open Firefox. If you can't recover your missing data this way, you may be able to manually recover data from another profile. See the Restore bookmarks, passwords, and data from an old Firefox profile article for details. For more information about managing Firefox profiles, see the Profile Manager article.",
  "products": [
    "firefox"
  ],
  "topics": [
    "backup-recovery-and-sync",
    "installation-and-updates",
    "recover-data",
    "update"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3195,
    "text_bytes": 1510,
    "word_count": 255,
    "downloaded_at": "2025-08-26T10:48:03.899152"
  }
}