{
  "slug": "recommended-firefox-privacy-and-security-settings-families",
  "title": "Recommended Firefox privacy and security settings for families",
  "summary": "Firefox lets you customize privacy and security settings so you and your family can browse safely online. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/recommended-firefox-privacy-and-security-settings-families",
  "html": "<p>Firefox lets you customize privacy and security preferences so you and your family can browse safely online. To learn more or adjust these settings:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Go to the <span class=\"menu\">Privacy &amp; Security</span> panel.\n</li></ol>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_privacy-settings\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Privacy settings</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_enhanced-tracking-protection\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Enhanced Tracking Protection</span></a></li><li class=\"toclevel-2\"><a href=\"#w_ask-not-to-be-tracked\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Ask not to be tracked</span></a></li><li class=\"toclevel-2\"><a href=\"#w_tell-websites-not-to-sell-or-share-your-information\"><span class=\"tocnumber\">1.3</span> <span class=\"toctext\">Tell websites not to sell or share your information</span></a></li><li class=\"toclevel-2\"><a href=\"#w_cookies-and-site-data\"><span class=\"tocnumber\">1.4</span> <span class=\"toctext\">Cookies and site data</span></a></li><li class=\"toclevel-2\"><a href=\"#w_password-settings\"><span class=\"tocnumber\">1.5</span> <span class=\"toctext\">Password settings</span></a></li><li class=\"toclevel-2\"><a href=\"#w_history-settings\"><span class=\"tocnumber\">1.6</span> <span class=\"toctext\">History settings</span></a></li><li class=\"toclevel-2\"><a href=\"#w_address-bar-settings\"><span class=\"tocnumber\">1.7</span> <span class=\"toctext\">Address bar settings</span></a></li><li class=\"toclevel-2\"><a href=\"#w_permissions\"><span class=\"tocnumber\">1.8</span> <span class=\"toctext\">Permissions</span></a></li><li class=\"toclevel-2\"><a href=\"#w_data-collection\"><span class=\"tocnumber\">1.9</span> <span class=\"toctext\">Data collection</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_security-settings\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Security settings</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_deceptive-content-and-dangerous-software-protection\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Deceptive Content and Dangerous Software Protection</span></a></li><li class=\"toclevel-2\"><a href=\"#w_https-only-mode\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">HTTPS-Only mode</span></a></li></ul></li></ul></div>\n<h1 id=\"w_privacy-settings\">Privacy settings</h1>\n<h2 id=\"w_enhanced-tracking-protection\">Enhanced Tracking Protection</h2>\n<p><a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a> blocks known trackers that gather information about your online activity and are hidden in the websites you visit. Enhanced tracking protection also includes <a href=\"/en-US/kb/introducing-total-cookie-protection-standard-mode\">Total Cookie Protection</a>, which prevents websites from tracking your behavior to create a profile based on your activity.\n</p><div class=\"for\" data-for=\"not fx135\">\n<h2 id=\"w_ask-not-to-be-tracked\">Ask not to be tracked</h2>\n<p>You can set Firefox's privacy settings to <a href=\"/en-US/kb/how-do-i-turn-do-not-track-feature\">ask websites not to track your online activity</a>.\n</p></div><div class=\"for\" data-for=\"fx120\">\n<h2 id=\"w_tell-websites-not-to-sell-or-share-your-information\">Tell websites not to sell or share your information</h2>\n<p>You can set Firefox's privacy settings to <a href=\"/en-US/kb/global-privacy-control\">tell websites not to sell or share your data</a>. This will notify websites not to sell or share information about your browsing session.\n</p></div>\n<h2 id=\"w_cookies-and-site-data\">Cookies and site data</h2>\n<p>By setting cookies and site data preferences in Firefox, you can choose which cookies you want to allow on your computer. You can <a href=\"/en-US/kb/clear-cookies-and-site-data-firefox\">clear cookies</a>, manage websites that use cookie data, <a href=\"/en-US/kb/block-websites-storing-cookies-site-data-firefox\">block websites from storing cookies</a> or set Firefox to automatically delete cookies upon exiting the browser.\n</p>\n<h2 id=\"w_password-settings\">Password settings</h2>\n<p>Manage your logins with the <a href=\"/en-US/kb/password-manager-remember-delete-edit-logins\">Firefox Password Manager</a>, enable or disable password autofill, let Firefox suggest a <a href=\"/en-US/kb/password-strength\">strong password</a> when you sign up for a new website or ask Firefox to warn you of <a href=\"/en-US/kb/firefox-password-manager-alerts-breached-websites\">password breaches</a>.\n</p>\n<h2 id=\"w_history-settings\">History settings</h2>\n<p>Your browsing history contains the sites you have visited. You can choose to have Firefox always remember browsing history and downloads, clear your history automatically when Firefox closes, or always navigate in Private Browsing mode. To learn more, see <a href=\"/en-US/kb/private-browsing-use-firefox-without-history\">Private Browsing - Use Firefox without saving history</a> and <a href=\"/en-US/kb/delete-browsing-search-download-history-firefox\">Delete browsing, search and download history on Firefox</a>.\n</p>\n<h2 id=\"w_address-bar-settings\">Address bar settings</h2>\n<p>You can configure the suggestions you'd like to see when you type into the address bar, such as suggestions from your history, bookmarks, open tabs, shortcuts, and search engines. The <a href=\"/en-US/kb/address-bar-autocomplete-firefox\">Address bar autocomplete suggestions in Firefox</a> article explains how. \n</p>\n<h2 id=\"w_permissions\">Permissions</h2>\n<p>Some websites may ask your permission to use personal information like your location or resources on your computer as part of the service they provide. The <a href=\"/en-US/kb/site-permissions-panel\">Site Permissions panel</a> will show any special permissions you have granted to a website.  You can choose and manage websites that have access to your location, camera, microphone, and other computer capabilities. For more information, see <a href=\"/en-US/kb/does-firefox-share-my-location-websites\">Does Firefox share my location with websites?</a> and <a href=\"/en-US/kb/how-manage-your-camera-and-microphone-permissions\">How to manage your camera and microphone permissions with Firefox</a>.\n</p>\n<h2 id=\"w_data-collection\">Data collection</h2>\n<p>Firefox collects only the necessary information to evaluate performance and improve your experience. In the Firefox Data Collection and Use settings, you can make changes to your <a href=\"/en-US/kb/technical-and-interaction-data\">data collection preferences</a>.\n</p>\n<h1 id=\"w_security-settings\">Security settings</h1>\n<h2 id=\"w_deceptive-content-and-dangerous-software-protection\">Deceptive Content and Dangerous Software Protection</h2>\n<p>Block suspicious content and downloads from malicious websites to keep your computer safe. When <a href=\"/en-US/kb/how-does-phishing-and-malware-protection-work\">this protection</a> is enabled, Firefox will notify you when a website tries to install malware or unwanted software on your computer.\n</p>\n<h2 id=\"w_https-only-mode\">HTTPS-Only mode</h2>\n<p><a href=\"/en-US/kb/https-only-prefs\">HTTPS-Only Mode</a> forces all connections to websites to use a secure encrypted connection called HTTPS.\n</p>",
  "text": "Firefox lets you customize privacy and security preferences so you and your family can browse safely online. To learn more or adjust these settings: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Go to the Privacy & Security panel. Table of Contents 1 Privacy settings 1.1 Enhanced Tracking Protection 1.2 Ask not to be tracked 1.3 Tell websites not to sell or share your information 1.4 Cookies and site data 1.5 Password settings 1.6 History settings 1.7 Address bar settings 1.8 Permissions 1.9 Data collection 2 Security settings 2.1 Deceptive Content and Dangerous Software Protection 2.2 HTTPS-Only mode Privacy settings Enhanced Tracking Protection Enhanced Tracking Protection blocks known trackers that gather information about your online activity and are hidden in the websites you visit. Enhanced tracking protection also includes Total Cookie Protection , which prevents websites from tracking your behavior to create a profile based on your activity. Ask not to be tracked You can set Firefox's privacy settings to ask websites not to track your online activity . Tell websites not to sell or share your information You can set Firefox's privacy settings to tell websites not to sell or share your data . This will notify websites not to sell or share information about your browsing session. Cookies and site data By setting cookies and site data preferences in Firefox, you can choose which cookies you want to allow on your computer. You can clear cookies , manage websites that use cookie data, block websites from storing cookies or set Firefox to automatically delete cookies upon exiting the browser. Password settings Manage your logins with the Firefox Password Manager , enable or disable password autofill, let Firefox suggest a strong password when you sign up for a new website or ask Firefox to warn you of password breaches . History settings Your browsing history contains the sites you have visited. You can choose to have Firefox always remember browsing history and downloads, clear your history automatically when Firefox closes, or always navigate in Private Browsing mode. To learn more, see Private Browsing - Use Firefox without saving history and Delete browsing, search and download history on Firefox . Address bar settings You can configure the suggestions you'd like to see when you type into the address bar, such as suggestions from your history, bookmarks, open tabs, shortcuts, and search engines. The Address bar autocomplete suggestions in Firefox article explains how. Permissions Some websites may ask your permission to use personal information like your location or resources on your computer as part of the service they provide. The Site Permissions panel will show any special permissions you have granted to a website. You can choose and manage websites that have access to your location, camera, microphone, and other computer capabilities. For more information, see Does Firefox share my location with websites? and How to manage your camera and microphone permissions with Firefox . Data collection Firefox collects only the necessary information to evaluate performance and improve your experience. In the Firefox Data Collection and Use settings, you can make changes to your data collection preferences . Security settings Deceptive Content and Dangerous Software Protection Block suspicious content and downloads from malicious websites to keep your computer safe. When this protection is enabled, Firefox will notify you when a website tries to install malware or unwanted software on your computer. HTTPS-Only mode HTTPS-Only Mode forces all connections to websites to use a secure encrypted connection called HTTPS.",
  "products": [
    "firefox"
  ],
  "topics": [
    "customization",
    "privacy-and-security",
    "security",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 7886,
    "text_bytes": 3809,
    "word_count": 601,
    "downloaded_at": "2025-08-26T10:55:18.512753"
  }
}