{
  "slug": "refresh-firefox-reset-add-ons-and-settings",
  "title": "Refresh Firefox - reset add-ons and settings",
  "summary": "A Refresh can fix many issues by restoring Firefox to its default state while saving essential information like bookmarks and passwords.",
  "url": "https://support.mozilla.org/en-US/kb/refresh-firefox-reset-add-ons-and-settings",
  "html": "<p></p><div class=\"for\" data-for=\"not fx\"><div class=\"warning\">This feature is available on Firefox for desktop or laptop computers.</div></div>\n<p></p><p>If you're having problems with Firefox, refreshing may help by restoring the browser to its default state while saving your essential information, like bookmarks and passwords.\n</p>\n<div class=\"warning\"><strong>Important:</strong> A Firefox refresh removes add-ons and other customizations, such as <a href=\"/en-US/kb/find-and-install-add-ons-add-features-to-firefox#w_what-types-of-add-ons-can-i-install\">extensions</a>, extension data, and <a href=\"/en-US/kb/about-config-editor-firefox\">preference configurations</a>. If you've made accessibility customizations to Firefox, you may need to add them back after refreshing. Consider using <a href=\"/en-US/kb/diagnose-firefox-issues-using-troubleshoot-mode\">Firefox Troubleshoot Mode</a> to diagnose issues before you refresh Firefox.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_refresh-firefox\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Refresh Firefox</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-does-the-refresh-feature-do\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">What does the refresh feature do?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_firefox-will-save-these-items\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Firefox will save these items</span></a></li><li class=\"toclevel-2\"><a href=\"#w_these-items-and-settings-will-be-removed\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">These items and settings will be removed</span></a></li></ul></li></ul></div>\n<h1 id=\"w_refresh-firefox\">Refresh Firefox</h1>\n<p></p><ol><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"menu\">Help</span>, and select <span class=\"menu\">More Troubleshooting Information</span>.\n</li><li>Click <span class=\"button\">Refresh Firefox…</span> then <span class=\"button\">Refresh Firefox</span> in the confirmation window that opens. Firefox will close to refresh itself.\n</li><li>When finished, a window will list your imported information. Click the <span class=\"button\">Finish</span> button. Firefox will open.\n</li><li>Select whether you want Firefox to restore all or some windows and tabs, and click the <span class=\"button\">Let's go!</span> button.\n</li></ol>\n<div class=\"note\"><strong>Note:</strong> There's a Refresh Firefox button in the Firefox <a href=\"/en-US/kb/diagnose-firefox-issues-using-troubleshoot-mode\">Troubleshoot Mode</a> window, if you can't start Firefox normally. You can also do a manual refresh by <a href=\"/en-US/kb/restore-bookmarks-passwords-and-data-from-an-old-firefox-profile#w_create-a-new-firefox-profile\">creating a new profile and transferring your important data to the new profile</a>.</div>\n<p></p>\n<h1 id=\"w_what-does-the-refresh-feature-do\">What does the refresh feature do?</h1>\n<p>Firefox stores all your settings and personal information in a <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile folder</a>. The refresh feature creates a new profile folder and saves your important data.\n</p><p>The refresh feature removes add-ons normally stored inside the Firefox profile folder (such as <a href=\"https://addons.mozilla.org/firefox/extensions/\">extensions</a> and <a href=\"/en-US/kb/use-themes-change-look-of-firefox\">themes</a>). Add-ons stored in other locations are not removed (although any modified preferences are reset).\n</p>\n<h2 id=\"w_firefox-will-save-these-items\">Firefox will save these items</h2>\n<ul><li>Bookmarks\n</li><li>Browsing and download history\n</li><li>Passwords\n</li><li>Cookies\n</li><li>Web form autofill information\n</li><li>Personal dictionary\n</li></ul>\n<h2 id=\"w_these-items-and-settings-will-be-removed\">These items and settings will be removed</h2>\n<ul><li><a href=\"/en-US/kb/find-and-install-add-ons-add-features-to-firefox\">Extensions and themes</a>\n</li><li>Website permissions\n</li><li>Modified preferences\n</li><li><a href=\"/en-US/kb/add-or-remove-search-engine-firefox#w_add-a-search-engine\">Added search engines</a>\n</li><li>DOM storage\n</li><li><a href=\"/en-US/kb/secure-website-certificate\">Security certificate</a> and device settings\n</li><li><a href=\"/en-US/kb/change-firefox-behavior-when-open-file\">Download actions</a>\n</li><li><a href=\"/en-US/kb/customize-firefox-controls-buttons-and-toolbars\">Toolbar customizations</a>\n</li><li>User styles (<span class=\"filepath\">chrome</span> subfolder containing <span class=\"filepath\">userChrome</span> and/or <span class=\"filepath\">userContent</span> <a href=\"https://wikipedia.org/wiki/Cascading_Style_Sheets\">CSS files</a>, if previously created)\n</li></ul>\n<div class=\"note\"><strong>Note:</strong> The refresh will place your old Firefox profile on your desktop in a folder named <em>Old Firefox Data</em>. If your problem persists, you can partially restore lost information by <a href=\"/en-US/kb/restore-bookmarks-passwords-and-data-from-an-old-firefox-profile#w_copying-files-between-profile-folders\">copying files to the newly created profile</a>. If you no longer need this folder, we encourage you to delete it, since it contains sensitive information.</div>",
  "text": "This feature is available on Firefox for desktop or laptop computers. If you're having problems with Firefox, refreshing may help by restoring the browser to its default state while saving your essential information, like bookmarks and passwords. Important: A Firefox refresh removes add-ons and other customizations, such as extensions , extension data, and preference configurations . If you've made accessibility customizations to Firefox, you may need to add them back after refreshing. Consider using Firefox Troubleshoot Mode to diagnose issues before you refresh Firefox. Table of Contents 1 Refresh Firefox 2 What does the refresh feature do? 2.1 Firefox will save these items 2.2 These items and settings will be removed Refresh Firefox Click the menu button , click Help , and select More Troubleshooting Information . Click Refresh Firefox… then Refresh Firefox in the confirmation window that opens. Firefox will close to refresh itself. When finished, a window will list your imported information. Click the Finish button. Firefox will open. Select whether you want Firefox to restore all or some windows and tabs, and click the Let's go! button. Note: There's a Refresh Firefox button in the Firefox Troubleshoot Mode window, if you can't start Firefox normally. You can also do a manual refresh by creating a new profile and transferring your important data to the new profile . What does the refresh feature do? Firefox stores all your settings and personal information in a profile folder . The refresh feature creates a new profile folder and saves your important data. The refresh feature removes add-ons normally stored inside the Firefox profile folder (such as extensions and themes ). Add-ons stored in other locations are not removed (although any modified preferences are reset). Firefox will save these items Bookmarks Browsing and download history Passwords Cookies Web form autofill information Personal dictionary These items and settings will be removed Extensions and themes Website permissions Modified preferences Added search engines DOM storage Security certificate and device settings Download actions Toolbar customizations User styles ( chrome subfolder containing userChrome and/or userContent CSS files , if previously created) Note: The refresh will place your old Firefox profile on your desktop in a folder named Old Firefox Data . If your problem persists, you can partially restore lost information by copying files to the newly created profile . If you no longer need this folder, we encourage you to delete it, since it contains sensitive information.",
  "products": [
    "firefox"
  ],
  "topics": [
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5509,
    "text_bytes": 2598,
    "word_count": 402,
    "downloaded_at": "2025-08-26T10:35:24.750860"
  }
}