{
  "slug": "relay-integration",
  "title": "Add Firefox Relay to the Firefox password manager",
  "summary": "Integrate Firefox Relay into the password manager to conveniently generate or reuse email masks from within email fields. Learn how.",
  "url": "https://support.mozilla.org/en-US/kb/relay-integration",
  "html": "<p>The <a href=\"/en-US/kb/password-manager-remember-delete-edit-logins\">Firefox password manager</a> allows you to securely store your usernames and passwords. This is a useful tool for keeping your information safe and generating secure passwords for website logins. Additionally, if you're using <a href=\"/en-US/kb/activate-firefox-relay-mask-your-email-address\">Firefox Relay</a> to mask your email address, you can create new masks or reuse an existing mask right from the Firefox password manager. This article describes the steps you need to follow to integrate Firefox Relay into the Firefox password manager.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_add-your-mozilla-account-to-the-password-manager\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Add your Mozilla account to the password manager</span></a></li><li class=\"toclevel-1\"><a href=\"#w_generate-new-firefox-relay-masks-with-the-password-manager\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Generate New Firefox Relay Masks with the password manager</span></a></li><li class=\"toclevel-1\"><a href=\"#w_frequently-asked-questions\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Frequently asked questions</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_what-is-firefox-relay-and-how-does-it-work\"><span class=\"tocnumber\">3.1</span> <span class=\"toctext\">What is Firefox Relay and how does it work?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_why-is-firefox-relay-shown-in-my-password-manager\"><span class=\"tocnumber\">3.2</span> <span class=\"toctext\">Why is Firefox Relay shown in my password manager?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_do-i-have-to-pay-for-relay\"><span class=\"tocnumber\">3.3</span> <span class=\"toctext\">Do I have to pay for Relay?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_how-many-masks-do-i-get-can-i-reuse-my-masks\"><span class=\"tocnumber\">3.4</span> <span class=\"toctext\">How many masks do I get? Can I reuse my masks?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_where-can-i-manage-my-masks-how-do-i-delete-a-mask\"><span class=\"tocnumber\">3.5</span> <span class=\"toctext\">Where can I manage my masks? How do I delete a mask?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_where-can-i-use-relay-email-masks\"><span class=\"tocnumber\">3.6</span> <span class=\"toctext\">Where can I use Relay email masks?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_how-can-i-remove-firefox-relay-from-the-firefox-password-manager\"><span class=\"tocnumber\">3.7</span> <span class=\"toctext\">How can I remove Firefox Relay from the Firefox password manager?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_the-password-manager-only-displays-email-autofill-and-not-the-firefox-relay-option-what-can-i-do\"><span class=\"tocnumber\">3.8</span> <span class=\"toctext\">The password manager only displays email autofill and not the Firefox Relay option ⁠— What can I do?</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<h1 id=\"w_add-your-mozilla-account-to-the-password-manager\">Add your Mozilla account to the password manager</h1>\n<p>To create new masks using the password manager, you need a Mozilla account. If you don't have one, Firefox will help you create it when you sign up for a new website. After that, just log in to your Mozilla account following the steps below, and your Mozilla account will be automatically added to the password manager.\n</p>\n<ol><li>Open Firefox and log in with your Mozilla account.\n</li><li>Click the menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button in the top right corner of the Firefox window.\n</li><li>Click <span class=\"button\">Log in</span> next to <em>Sync and save data</em>.\n</li><li>Enter your Mozilla account email and password.\n</li></ol>\n<h1 id=\"w_generate-new-firefox-relay-masks-with-the-password-manager\">Generate New Firefox Relay Masks with the password manager</h1>\n<p>When you fill out an email field, the password manager will suggest emails from your saved logins, and it will also give you the option to generate or reuse a Firefox Relay mask.\n</p>\n<ol><li>Visit a website that requires you to log in or create an account.\n</li><li>Click the <strong>Protect your email address: Use Firefox Relay email mask</strong> option in the dropdown that appears on the email field.\n<dl><dt><img alt=\"Password manager 1\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-09-11-10-23-50-3bfa56.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"400\"> \n</dt><dt><div class=\"note\"><strong>Note:</strong> Please note that while the password manager does its best to detect email fields on websites, it may not always detect them all. If you're having trouble generating or reusing masks from the password manager, you can visit your <a href=\"https://relay.firefox.com/accounts/profile/\">Firefox Relay dashboard</a> to generate or reuse a mask.</div>\n</dt></dl>\n</li><li>To create a new mask, click <span class=\"button\">Use email mask</span> on the confirmation pop-up that appears next.\n<dl><dt><img alt=\"Password manager 2\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-09-11-10-26-06-5f01b7.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"500\"> \n</dt></dl>\n<ul><li>With a free subscription, you can generate up to five Firefox Relay masks to protect your online identity. Using different masks can help to reduce the chances of your activity being tracked and your identity being exposed. <a href=\"/en-US/kb/subscribe-firefox-relay-premium\">Upgrade to a premium account</a> for unlimited masks.\n</li></ul>\n</li><li>When you reach your mask limit, the password manager lets you choose from your available masks.\n<dl><dt><img alt=\"Password manager 3\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-09-11-10-27-23-b5e7d9.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\"> \n</dt></dl>\n</li><li>Click <span class=\"button\">Manage masks</span> at the bottom of the panel to visit your Firefox Relay dashboard and access additional settings such as deleting masks, blocking promotional emails, <a href=\"/en-US/kb/subscribe-firefox-relay-premium\">subscribing to Firefox Relay Premium</a> and more.\n</li></ol>\n<h1 id=\"w_frequently-asked-questions\">Frequently asked questions</h1>\n<h2 id=\"w_what-is-firefox-relay-and-how-does-it-work\">What is Firefox Relay and how does it work?</h2>\n<p>Firefox Relay offers secure email masking to hide your real email address and protect your identity. Your email address can be used to track you online, so using an email mask allows you to sign up for accounts without providing your real email. Email masks also make it easier to stop spam from reaching your inbox.\nTo use Relay, simply use a Relay email mask in place of your real email. All emails sent to your email mask will be forwarded to your real email address unless you decide to block them. You can block senders, delete masks that get too much spam, and label your masks from your <a href=\"https://relay.firefox.com/\">Relay dashboard</a>.\n</p>\n<h2 id=\"w_why-is-firefox-relay-shown-in-my-password-manager\">Why is Firefox Relay shown in my password manager?</h2>\n<p>As a current Relay user, we’ve added Relay to your password manager to make it easier to use a Relay mask whenever a website asks for your email address.\n</p>\n<h2 id=\"w_do-i-have-to-pay-for-relay\">Do I have to pay for Relay?</h2>\n<p>By using Firefox Relay in your password manager, you’ll be automatically signed up for a free account that includes 5 email masks. This is not a free trial; it is always free, and you’ll never be charged, unless you decide to sign up for Relay Premium.\n</p><p><strong>There are two options for Relay Premium:</strong>\n</p>\n<ol><li><strong>Premium email masking</strong> includes unlimited email masks, a unique Relay email domain that you can use to create masks on the go, and greater inbox controls with the ability to block only promotional emails. Relay Premium email masking is available in the United States, Germany, United Kingdom, Canada, Singapore, Malaysia, New Zealand, France, Belgium, Austria, Spain, Italy, Switzerland, Netherlands, and Ireland.\n</li><li><strong>Premium email masking plus phone masking</strong> gives you the same Premium features, plus a phone number mask that protects your real phone number. All calls and text messages sent to your phone number mask will be forwarded to your real phone number. ⁨Relay Premium phone masking is only available in the US and Canada.\n</li></ol>\n<h2 id=\"w_how-many-masks-do-i-get-can-i-reuse-my-masks\">How many masks do I get? Can I reuse my masks?</h2>\n<p>Your free account includes 5 email masks. You can reuse them as many times as you like. However, using a unique mask for each account is the most secure option. You can upgrade to <a href=\"/en-US/kb/subscribe-firefox-relay-premium\">Relay Premium</a> for unlimited email masks.\n</p>\n<h2 id=\"w_where-can-i-manage-my-masks-how-do-i-delete-a-mask\">Where can I manage my masks? How do I delete a mask?</h2>\n<p>Sign in to your <a href=\"https://relay.firefox.com/\">Relay dashboard</a> to block senders, delete masks that get too much spam, and label your masks.\n</p>\n<h2 id=\"w_where-can-i-use-relay-email-masks\">Where can I use Relay email masks?</h2>\n<p>You can use Relay on any site that you don’t want to share your real email address with. For example, when restaurants ask for your email to order online. Or when retailers ask for your email address, so you can get a promo code. We don’t recommend using it on sites that you trust, such as your bank or credit card website. Occasionally, a website may not accept a Relay email mask, in which case you’d need to use your real email address.\n</p>\n<h2 id=\"w_how-can-i-remove-firefox-relay-from-the-firefox-password-manager\">How can I remove Firefox Relay from the Firefox password manager?</h2>\n<p>To stop seeing Firefox Relay in the password manager suggestions:\n</p>\n<ol><li>Click the menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button in the top right corner of the Firefox window.\n</li><li>Click <span class=\"menu\">Settings</span>.\n</li><li>Select <span class=\"menu\">Privacy &amp; Security</span> in the panel to the left.\n</li><li>Scroll down to the <span class=\"for\" data-for=\"not fx122\"><strong>Logins and Passwords</strong></span><span class=\"for\" data-for=\"fx122\"><strong>Passwords</strong></span> section.\n<dl><dt> <span class=\"for\" data-for=\"not fx122\"><img alt=\"Uncheck Relay\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-11-27-11-51-10-e58b1a.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\"></span><span class=\"for\" data-for=\"fx122\"><img alt=\"Suggest relay password\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-09-16-15-48-27-f76304.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\"></span>\n</dt></dl>\n</li><li>Uncheck the box next to <strong>Suggest Firefox Relay email masks to protect your email address</strong>.\n</li></ol>\n<h2 id=\"w_the-password-manager-only-displays-email-autofill-and-not-the-firefox-relay-option-what-can-i-do\">The password manager only displays email autofill and not the Firefox Relay option ⁠— What can I do?</h2>\n<p>We are actively working to improve the experience for our users and to make Firefox Relay available on more websites. In the meantime, you can generate or reuse a mask from the right-click menu with the <a href=\"https://addons.mozilla.org/firefox/addon/private-relay\">Firefox Relay add-on from Add-ons Mozilla</a>.\n</p>\n<ol><li>Follow the installation prompts and log in to Firefox Relay with your Mozilla account.\n</li><li>Visit the website where you would like to register.\n</li><li>Right-click on the email field where you want to use Firefox Relay.\n</li><li>Select <span class=\"menu\">Generate new mask</span> or <span class=\"menu\">Recent mask</span> from the right-click menu.\n</li></ol>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/integrate-firefox-relay-firefox-password-manager\">Integrate Firefox Relay into the Firefox Password Manager</a>\n</li><li><a href=\"/en-US/kb/create-email-mask-through-firefox-relay\">Create an email mask through Firefox Relay</a>\n</li></ul>",
  "text": "The Firefox password manager allows you to securely store your usernames and passwords. This is a useful tool for keeping your information safe and generating secure passwords for website logins. Additionally, if you're using Firefox Relay to mask your email address, you can create new masks or reuse an existing mask right from the Firefox password manager. This article describes the steps you need to follow to integrate Firefox Relay into the Firefox password manager. Table of Contents 1 Add your Mozilla account to the password manager 2 Generate New Firefox Relay Masks with the password manager 3 Frequently asked questions 3.1 What is Firefox Relay and how does it work? 3.2 Why is Firefox Relay shown in my password manager? 3.3 Do I have to pay for Relay? 3.4 How many masks do I get? Can I reuse my masks? 3.5 Where can I manage my masks? How do I delete a mask? 3.6 Where can I use Relay email masks? 3.7 How can I remove Firefox Relay from the Firefox password manager? 3.8 The password manager only displays email autofill and not the Firefox Relay option ⁠— What can I do? 4 Related articles Add your Mozilla account to the password manager To create new masks using the password manager, you need a Mozilla account. If you don't have one, Firefox will help you create it when you sign up for a new website. After that, just log in to your Mozilla account following the steps below, and your Mozilla account will be automatically added to the password manager. Open Firefox and log in with your Mozilla account. Click the menu button in the top right corner of the Firefox window. Click Log in next to Sync and save data . Enter your Mozilla account email and password. Generate New Firefox Relay Masks with the password manager When you fill out an email field, the password manager will suggest emails from your saved logins, and it will also give you the option to generate or reuse a Firefox Relay mask. Visit a website that requires you to log in or create an account. Click the Protect your email address: Use Firefox Relay email mask option in the dropdown that appears on the email field. Note: Please note that while the password manager does its best to detect email fields on websites, it may not always detect them all. If you're having trouble generating or reusing masks from the password manager, you can visit your Firefox Relay dashboard to generate or reuse a mask. To create a new mask, click Use email mask on the confirmation pop-up that appears next. With a free subscription, you can generate up to five Firefox Relay masks to protect your online identity. Using different masks can help to reduce the chances of your activity being tracked and your identity being exposed. Upgrade to a premium account for unlimited masks. When you reach your mask limit, the password manager lets you choose from your available masks. Click Manage masks at the bottom of the panel to visit your Firefox Relay dashboard and access additional settings such as deleting masks, blocking promotional emails, subscribing to Firefox Relay Premium and more. Frequently asked questions What is Firefox Relay and how does it work? Firefox Relay offers secure email masking to hide your real email address and protect your identity. Your email address can be used to track you online, so using an email mask allows you to sign up for accounts without providing your real email. Email masks also make it easier to stop spam from reaching your inbox. To use Relay, simply use a Relay email mask in place of your real email. All emails sent to your email mask will be forwarded to your real email address unless you decide to block them. You can block senders, delete masks that get too much spam, and label your masks from your Relay dashboard . Why is Firefox Relay shown in my password manager? As a current Relay user, we’ve added Relay to your password manager to make it easier to use a Relay mask whenever a website asks for your email address. Do I have to pay for Relay? By using Firefox Relay in your password manager, you’ll be automatically signed up for a free account that includes 5 email masks. This is not a free trial; it is always free, and you’ll never be charged, unless you decide to sign up for Relay Premium. There are two options for Relay Premium: Premium email masking includes unlimited email masks, a unique Relay email domain that you can use to create masks on the go, and greater inbox controls with the ability to block only promotional emails. Relay Premium email masking is available in the United States, Germany, United Kingdom, Canada, Singapore, Malaysia, New Zealand, France, Belgium, Austria, Spain, Italy, Switzerland, Netherlands, and Ireland. Premium email masking plus phone masking gives you the same Premium features, plus a phone number mask that protects your real phone number. All calls and text messages sent to your phone number mask will be forwarded to your real phone number. ⁨Relay Premium phone masking is only available in the US and Canada. How many masks do I get? Can I reuse my masks? Your free account includes 5 email masks. You can reuse them as many times as you like. However, using a unique mask for each account is the most secure option. You can upgrade to Relay Premium for unlimited email masks. Where can I manage my masks? How do I delete a mask? Sign in to your Relay dashboard to block senders, delete masks that get too much spam, and label your masks. Where can I use Relay email masks? You can use Relay on any site that you don’t want to share your real email address with. For example, when restaurants ask for your email to order online. Or when retailers ask for your email address, so you can get a promo code. We don’t recommend using it on sites that you trust, such as your bank or credit card website. Occasionally, a website may not accept a Relay email mask, in which case you’d need to use your real email address. How can I remove Firefox Relay from the Firefox password manager? To stop seeing Firefox Relay in the password manager suggestions: Click the menu button in the top right corner of the Firefox window. Click Settings . Select Privacy & Security in the panel to the left. Scroll down to the Logins and Passwords Passwords section. Uncheck the box next to Suggest Firefox Relay email masks to protect your email address . The password manager only displays email autofill and not the Firefox Relay option ⁠— What can I do? We are actively working to improve the experience for our users and to make Firefox Relay available on more websites. In the meantime, you can generate or reuse a mask from the right-click menu with the Firefox Relay add-on from Add-ons Mozilla . Follow the installation prompts and log in to Firefox Relay with your Mozilla account. Visit the website where you would like to register. Right-click on the email field where you want to use Firefox Relay. Select Generate new mask or Recent mask from the right-click menu. Related articles Integrate Firefox Relay into the Firefox Password Manager Create an email mask through Firefox Relay",
  "products": [
    "firefox",
    "relay"
  ],
  "topics": [
    "passwords-and-sign-in",
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 13484,
    "text_bytes": 7076,
    "word_count": 1241,
    "downloaded_at": "2025-08-26T10:55:47.376137"
  }
}