{
  "slug": "restore-bookmarks-passwords-and-data-from-an-old-firefox-profile",
  "title": "Restore bookmarks, passwords, and data from an old Firefox profile",
  "summary": "If you need to create a new Firefox profile, learn how to recover your old Firefox data such as bookmarks, history and passwords.",
  "url": "https://support.mozilla.org/en-US/kb/restore-bookmarks-passwords-and-data-from-an-old-firefox-profile",
  "html": "<p>A Firefox <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data\">profile</a> stores all of your important data, such as your bookmarks, history, cookies, and passwords. If you've lost your Firefox settings, bookmarks, or saved passwords after updating or reinstalling, you might still be able to recover them from an old profile. This article explains how to locate your old Firefox profile and copy important data into your current one.\n</p>\n<ul><li>To sync and share data among multiple profiles and devices, see <a href=\"/en-US/kb/how-do-i-set-sync-my-computer\">How do I set up Sync on my computer?</a> and <a href=\"/en-US/kb/how-do-i-choose-what-information-sync-firefox\">How do I choose what information to sync on Firefox?</a>\n</li><li>To switch to another profile to recover missing data and settings, see <a href=\"/en-US/kb/recover-user-data-missing-after-firefox-update\">Recover user data missing after Firefox update</a>.\n</li></ul>\n<div class=\"note\"><strong>Note:</strong> Because your preferences and extensions often cause problems, this article does not explain how to copy these between profiles. If you follow the steps in this article, you will have to reinstall your extensions and reconfigure your Firefox preferences.</div>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_back-up-your-current-profile\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Back up your current profile</span></a></li><li class=\"toclevel-1\"><a href=\"#w_create-a-new-firefox-profile\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Create a new Firefox profile</span></a></li><li class=\"toclevel-1\"><a href=\"#w_copy-files-between-profile-folders\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Copy files between profile folders</span></a></li><li class=\"toclevel-1\"><a href=\"#w_your-important-data-and-their-files\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Your important data and their files</span></a></li></ul></div>\n<h1 id=\"w_back-up-your-current-profile\">Back up your current profile</h1>\n<p>Before starting it is recommended that you make a complete backup of your existing Firefox profile in case something goes wrong. Please read the <a href=\"/en-US/kb/back-and-restore-information-firefox-profiles\">Back up and restore information in Firefox profiles</a> article for instructions.\n</p>\n<h1 id=\"w_create-a-new-firefox-profile\">Create a new Firefox profile</h1>\n<div class=\"note\"><strong>Note:</strong> This step is not necessary if you already have a new Firefox profile, for example, one you previously created or a <a href=\"/en-US/kb/dedicated-profiles-firefox-installation\">profile created by Firefox for a new installation</a>. This step is also not needed if you want to recover profile data from an <em>Old Firefox Data</em> folder placed on the desktop after you <a href=\"/en-US/kb/refresh-firefox-reset-add-ons-and-settings\">refresh Firefox</a>.</div>\n<p>To learn how to create a brand new Firefox profile, please read the <a href=\"/en-US/kb/profile-manager-create-remove-switch-firefox-profiles\">Profile Manager - Create, remove or switch Firefox profiles</a> article.\n</p>\n<h1 id=\"w_copy-files-between-profile-folders\">Copy files between profile folders</h1>\n<div class=\"note\"><strong>Important:</strong> Firefox <u>must</u> be closed down while copying files between profile folders. If you can't open a profile from within Firefox, see <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data#w_finding-your-profile-without-opening-firefox\">Finding your profile without opening Firefox</a>.</div>\n<ol><li> <strong>Open the old Firefox profile folder</strong> containing the files you want to copy to a new profile.<br>If you are copying data from an <em>Old Firefox Data</em> folder created after you refreshed Firefox, simply open the old profile folder it contains; otherwise, if you can open Firefox using the old profile:<ul><li><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"menu\">Help</span> and select <span class=\"menu\">More Troubleshooting Information</span>.</span><span class=\"for\" data-for=\"mac\">From the <span class=\"menu\">Help</span> menu, select <span class=\"menu\">More Troubleshooting Information</span>.</span> The <strong>Troubleshooting Information</strong> tab will open.\n</li><li>Under the <strong>Application Basics</strong> section next to <em><span class=\"for\" data-for=\"not linux\">Profile Folder</span><span class=\"for\" data-for=\"linux\">Profile Directory</span></em>, click <span class=\"button\"><span class=\"for\" data-for=\"win\">Open Folder</span><span class=\"for\" data-for=\"mac\">Show in Finder</span><span class=\"for\" data-for=\"linux\">Open Directory</span></span>. <span class=\"for\" data-for=\"mac\">A window will open that contains your profile folder.</span><span class=\"for\" data-for=\"win\">Your profile folder will open.</span><span class=\"for\" data-for=\"linux\">Your profile directory will open.</span>\n</li></ul>\n<div class=\"note\"><strong>Note:</strong>  If<span class=\"for\" data-for=\"win10,win11\"> Firefox displays an error after clicking <span class=\"button\">Open Folder</span> or if</span> you are unable to open or use Firefox, follow the instructions in <a href=\"/en-US/kb/profiles-where-firefox-stores-user-data#w_finding-your-profile-without-opening-firefox\">Finding your profile without opening Firefox</a>.</div>\n</li><li> Close Firefox. If it's open: <span class=\"for\" data-for=\"win\">Click the Firefox menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Exit</span>.</span><span class=\"for\" data-for=\"mac\">Click the Firefox menu at the top of the screen and select <span class=\"menu\">Quit Firefox</span>.</span><span class=\"for\" data-for=\"linux\">Click the Firefox menu <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Quit</span>.</span>\n\n</li><li> <span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Control</span> key while you click</span>\n on a file you want to copy and choose <span class=\"menu\">Copy</span>.\n</li><li> <strong>Open the new Firefox profile folder</strong> as explained in step 1, above.\n</li><li> <span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Control</span> key while you click</span>\n inside the profile folder and choose <span class=\"menu\">Paste<span class=\"for\" data-for=\"mac\"> Item</span></span>.\n</li></ol>\n<p>Repeat steps 3-5 for each file you wish to transfer over to your new profile folder.\n</p><p>While copying your personal data from an old Firefox profile to a new Firefox profile, it is possible that you could copy over the file that is causing the problem you are trying to get rid of! The more files you copy over, the greater the chance of this happening. It is therefore recommended that:\n</p>\n<ul><li> You copy over only the minimal amount of files that contain your most important data that you simply can't live without.\n</li><li> You copy over a few files at a time, and then check that the problem you are trying to get rid of hasn't returned.\n</li></ul>\n<div class=\"for\" data-for=\"win\"><p>\n</p>\n<div class=\"note\"><strong>Note:</strong> By default, Windows hides the <span class=\"filepath\">AppData</span> folder where Firefox stores your profile. To set Windows to show hidden files and folders, see <span class=\"for\" data-for=\"win7,win8\"><a href=\"https://support.microsoft.com/help/14201/windows-show-hidden-files\">Show hidden files - Windows Help</a></span><span class=\"for\" data-for=\"win10\"><a href=\"https://support.microsoft.com/windows/view-hidden-files-and-folders-in-windows-97fbc472-c603-9d90-91d0-1166d1d9f4b5#WindowsVersion=Windows_10\">View hidden files and folders in Windows - Microsoft Support</a></span><span class=\"for\" data-for=\"win11\"><a href=\"https://support.microsoft.com/windows/view-hidden-files-and-folders-in-windows-97fbc472-c603-9d90-91d0-1166d1d9f4b5#WindowsVersion=Windows_11\">View hidden files and folders in Windows - Microsoft Support</a></span>.</div>\n</div>\n<h1 id=\"w_your-important-data-and-their-files\">Your important data and their files</h1>\n<p>\nTo learn more about the data and their files within your Firefox profile, see <a href=\"/en-US/kb/about-your-important-data-and-their-files\">About your important data and their files</a>.\n<br> <br>\n</p>",
  "text": "A Firefox profile stores all of your important data, such as your bookmarks, history, cookies, and passwords. If you've lost your Firefox settings, bookmarks, or saved passwords after updating or reinstalling, you might still be able to recover them from an old profile. This article explains how to locate your old Firefox profile and copy important data into your current one. To sync and share data among multiple profiles and devices, see How do I set up Sync on my computer? and How do I choose what information to sync on Firefox? To switch to another profile to recover missing data and settings, see Recover user data missing after Firefox update . Note: Because your preferences and extensions often cause problems, this article does not explain how to copy these between profiles. If you follow the steps in this article, you will have to reinstall your extensions and reconfigure your Firefox preferences. Table of Contents 1 Back up your current profile 2 Create a new Firefox profile 3 Copy files between profile folders 4 Your important data and their files Back up your current profile Before starting it is recommended that you make a complete backup of your existing Firefox profile in case something goes wrong. Please read the Back up and restore information in Firefox profiles article for instructions. Create a new Firefox profile Note: This step is not necessary if you already have a new Firefox profile, for example, one you previously created or a profile created by Firefox for a new installation . This step is also not needed if you want to recover profile data from an Old Firefox Data folder placed on the desktop after you refresh Firefox . To learn how to create a brand new Firefox profile, please read the Profile Manager - Create, remove or switch Firefox profiles article. Copy files between profile folders Important: Firefox must be closed down while copying files between profile folders. If you can't open a profile from within Firefox, see Finding your profile without opening Firefox . Open the old Firefox profile folder containing the files you want to copy to a new profile. If you are copying data from an Old Firefox Data folder created after you refreshed Firefox, simply open the old profile folder it contains; otherwise, if you can open Firefox using the old profile: Click the menu button , click Help and select More Troubleshooting Information . From the Help menu, select More Troubleshooting Information . The Troubleshooting Information tab will open. Under the Application Basics section next to Profile Folder Profile Directory , click Open Folder Show in Finder Open Directory . A window will open that contains your profile folder. Your profile folder will open. Your profile directory will open. Note: If Firefox displays an error after clicking Open Folder or if you are unable to open or use Firefox, follow the instructions in Finding your profile without opening Firefox . Close Firefox. If it's open: Click the Firefox menu and select Exit . Click the Firefox menu at the top of the screen and select Quit Firefox . Click the Firefox menu and select Quit . Right-click Hold down the Control key while you click on a file you want to copy and choose Copy . Open the new Firefox profile folder as explained in step 1, above. Right-click Hold down the Control key while you click inside the profile folder and choose Paste Item . Repeat steps 3-5 for each file you wish to transfer over to your new profile folder. While copying your personal data from an old Firefox profile to a new Firefox profile, it is possible that you could copy over the file that is causing the problem you are trying to get rid of! The more files you copy over, the greater the chance of this happening. It is therefore recommended that: You copy over only the minimal amount of files that contain your most important data that you simply can't live without. You copy over a few files at a time, and then check that the problem you are trying to get rid of hasn't returned. Note: By default, Windows hides the AppData folder where Firefox stores your profile. To set Windows to show hidden files and folders, see Show hidden files - Windows Help View hidden files and folders in Windows - Microsoft Support View hidden files and folders in Windows - Microsoft Support . Your important data and their files To learn more about the data and their files within your Firefox profile, see About your important data and their files .",
  "products": [
    "firefox"
  ],
  "topics": [
    "backup-recovery-and-sync",
    "recover-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 9206,
    "text_bytes": 4469,
    "word_count": 771,
    "downloaded_at": "2025-08-26T09:04:04.856716"
  }
}