{
  "slug": "review-installed-extensions",
  "title": "Review installed extensions",
  "summary": "Reviewing the extensions you have installed periodically can make it harder for malicious extensions to put your security and privacy at risk.",
  "url": "https://support.mozilla.org/en-US/kb/review-installed-extensions",
  "html": "<p><a href=\"/en-US/kb/find-and-install-add-ons-add-features-to-firefox\">Extensions</a> enable you to add features to Firefox to customize your browsing experience. For a safe browsing experience, it is a great idea to review the extensions installed periodically. Doing so can make it harder for bad actors to put your security and privacy at risk.\n</p><p>If you are looking to disable or remove an extension, see <a href=\"/en-US/kb/disable-or-remove-add-ons\">Disable or remove Add-ons</a>.\n</p>\n<h1 id=\"w_why-should-i-review-the-extensions-i-have-installed\">Why should I review the extensions I have installed?</h1>\n<p>Extensions are most often created by third-party developers to modify the way Firefox works. While most developers are trustworthy, some developers are not, and may create extensions that do malicious things such as improperly handling your browsing data. This is why it is a good idea to periodically check the extensions you have installed in the past to make sure you still want them, as well as look for extensions that were inadvertently installed. By reviewing your extensions regularly and removing the ones you don't use or didn't install, you can reduce the likelihood of malicious actors attempting to compromise your security or privacy.\n</p><p>To get started, navigate to the Add-ons Manager: Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"for\" data-for=\"not fx140\"><span class=\"menu\">Add-ons and themes</span></span><span class=\"for\" data-for=\"fx140\"><span class=\"menu\">Extensions and themes</span></span> and select <span class=\"menu\">Extensions</span>.\n\n</p><p>You can also type <strong>about:addons</strong> in the address bar of a new tab to access the Add-ons Manager.\n</p><p>Begin by reading the name of each extension. We recommend that you review all extensions installed individually, even those that are disabled.\n</p><p>If you come across an extension you do not recognize, the following process will guide you in reviewing it.\n</p>\n<h2 id=\"w_do-i-recall-installing-the-extension\">Do I recall installing the extension?</h2>\n<p>If you do not remember installing the extension, it is best to remove it. Such extensions may have been installed without your knowledge and could be malicious.\n</p><p>If you are experiencing difficulties with uninstalling an extension, see <a href=\"/en-US/kb/cannot-remove-add-on-extension-or-theme\">Cannot remove an add-on (extension or theme)</a>.\n</p>\n<h2 id=\"w_do-i-need-this-extension\">Do I need this extension?</h2>\n<p>Ask yourself if you still need the extension. You might have installed an extension in the past to complete a task. Remove the extension if it no longer serves a purpose for you. If you are questioning whether you should keep the extension, continue to the next question.\n</p>\n<h2 id=\"w_what-permissions-have-i-granted\">What permissions have I granted?</h2>\n<p>If you plan on using the extension in the near future, you should look into what the extension is allowed to do.\n</p>\n<ol><li> To view an extension's permissions, click on the extension in the Add-ons Manager <span class=\"menu\">Extensions</span> panel.\n<dl><dt> <img alt=\"select-extension\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-07-01-13-12-14-ee300f.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> Select the <span class=\"menu\">Permissions</span> tab.\n<dl><dt> <img alt=\"extensions permissions tab\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-07-01-13-15-57-4f2300.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> Review the permissions granted.\n</li></ol>\n<p>For information on permissions, see <a href=\"/en-US/kb/permission-request-messages-firefox-extensions\">Permission request messages for Firefox extensions</a>.\n</p><p>You can also disable an extension to prevent it from being active and enable it when needed. Extensions submitted to <a href=\"https://addons.mozilla.org/\">addons.mozilla.org</a> are scanned for common issues and may be subject to human review.\n</p>\n<div class=\"note\"><strong>Note:</strong> Extensions no longer automatically run in private browsing. See <a href=\"/en-US/kb/extensions-private-browsing\">Extensions in Private Browsing</a>.</div>\n<h2 id=\"w_is-it-trustworthy\">Is it trustworthy?</h2>\n<p>If you have reviewed the permissions granted, and are unsure if you would like to keep the extension, read the product’s description and explore its reviews (for extensions installed through <a href=\"https://addons.mozilla.org/\">addons.mozilla.org</a>). The extension’s description should enable you to understand its purpose.\n</p>\n<ol><li> To read the extension’s description, click on the extension in the Add-ons Manager <span class=\"menu\">Extensions</span> panel.\n<dl><dt> <img alt=\"select-extension\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-07-01-13-12-14-ee300f.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li> Select the <span class=\"menu\">Details</span> tab.\n<dl><dt> <img alt=\"extensions details tab\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-07-01-13-35-41-f8c0c5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li></ol>\n<p>On the same page, you can also navigate to view the extension’s reviews by clicking on the <em>number of reviews</em> the extension has in the <em>Rating</em> section.\n</p>\n<dl><dt><img alt=\"Add-onsManagerRating\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-03-14-15-12-17-a3b9b9.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div class=\"note\"><strong>Note:</strong> ratings and reviews are left by other Firefox users – keep in mind that the reviews are simply users expressing their opinion.</div>\n<p>For further guidance, see <a href=\"/en-US/kb/tips-assessing-safety-extension\">Tips for assessing the safety of an extension</a>.\n</p>",
  "text": "Extensions enable you to add features to Firefox to customize your browsing experience. For a safe browsing experience, it is a great idea to review the extensions installed periodically. Doing so can make it harder for bad actors to put your security and privacy at risk. If you are looking to disable or remove an extension, see Disable or remove Add-ons . Why should I review the extensions I have installed? Extensions are most often created by third-party developers to modify the way Firefox works. While most developers are trustworthy, some developers are not, and may create extensions that do malicious things such as improperly handling your browsing data. This is why it is a good idea to periodically check the extensions you have installed in the past to make sure you still want them, as well as look for extensions that were inadvertently installed. By reviewing your extensions regularly and removing the ones you don't use or didn't install, you can reduce the likelihood of malicious actors attempting to compromise your security or privacy. To get started, navigate to the Add-ons Manager: Click the menu button , click Add-ons and themes Extensions and themes and select Extensions . You can also type about:addons in the address bar of a new tab to access the Add-ons Manager. Begin by reading the name of each extension. We recommend that you review all extensions installed individually, even those that are disabled. If you come across an extension you do not recognize, the following process will guide you in reviewing it. Do I recall installing the extension? If you do not remember installing the extension, it is best to remove it. Such extensions may have been installed without your knowledge and could be malicious. If you are experiencing difficulties with uninstalling an extension, see Cannot remove an add-on (extension or theme) . Do I need this extension? Ask yourself if you still need the extension. You might have installed an extension in the past to complete a task. Remove the extension if it no longer serves a purpose for you. If you are questioning whether you should keep the extension, continue to the next question. What permissions have I granted? If you plan on using the extension in the near future, you should look into what the extension is allowed to do. To view an extension's permissions, click on the extension in the Add-ons Manager Extensions panel. Select the Permissions tab. Review the permissions granted. For information on permissions, see Permission request messages for Firefox extensions . You can also disable an extension to prevent it from being active and enable it when needed. Extensions submitted to addons.mozilla.org are scanned for common issues and may be subject to human review. Note: Extensions no longer automatically run in private browsing. See Extensions in Private Browsing . Is it trustworthy? If you have reviewed the permissions granted, and are unsure if you would like to keep the extension, read the product’s description and explore its reviews (for extensions installed through addons.mozilla.org ). The extension’s description should enable you to understand its purpose. To read the extension’s description, click on the extension in the Add-ons Manager Extensions panel. Select the Details tab. On the same page, you can also navigate to view the extension’s reviews by clicking on the number of reviews the extension has in the Rating section. Note: ratings and reviews are left by other Firefox users – keep in mind that the reviews are simply users expressing their opinion. For further guidance, see Tips for assessing the safety of an extension .",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6858,
    "text_bytes": 3653,
    "word_count": 599,
    "downloaded_at": "2025-08-26T10:47:29.231503"
  }
}