{
  "slug": "root-certificate-expiration",
  "title": "Update Firefox to prevent add-ons issues from root certificate expiration",
  "summary": "A root certificate that expired March 14, 2025 can cause issues with add-ons, DRM media and essential features, unless you update Firefox.",
  "url": "https://support.mozilla.org/en-US/kb/root-certificate-expiration",
  "html": "<p>A <a href=\"https://wikipedia.org/wiki/Root_certificate\">root certificate</a> that was used to verify signed content and add-ons for various Mozilla projects, including Firefox, expired on <strong>March 14, 2025</strong>. Without updating to <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 128 or higher (or ESR 115.13+ for <a href=\"/en-US/kb/firefox-esr-release-cycle\">ESR</a> users, including Windows 7/8/8.1 and macOS 10.12–10.14 users), this expiration causes significant issues with add-ons, content signing and DRM-protected media playback.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_why-is-this-update-important\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Why is this update important?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_who-does-this-affect\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Who does this affect?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-to-update-firefox\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How to update Firefox</span></a></li><li class=\"toclevel-1\"><a href=\"#w_faqs\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">FAQs</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_what-is-a-root-certificate-and-why-is-its-expiration-important\"><span class=\"tocnumber\">4.1</span> <span class=\"toctext\">What is a root certificate, and why is its expiration important?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_how-do-i-know-if-im-affected-by-this-issue\"><span class=\"tocnumber\">4.2</span> <span class=\"toctext\">How do I know if I’m affected by this issue?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_what-happens-to-my-bookmarks-passwords-and-settings-if-i-update-firefox\"><span class=\"tocnumber\">4.3</span> <span class=\"toctext\">What happens to my bookmarks, passwords, and settings if I update Firefox?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_can-i-still-use-firefox-if-i-dont-update\"><span class=\"tocnumber\">4.4</span> <span class=\"toctext\">Can I still use Firefox if I don’t update?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_what-are-the-security-risks-if-i-dont-update-firefox\"><span class=\"tocnumber\">4.5</span> <span class=\"toctext\">What are the security risks if I don’t update Firefox?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_does-this-affect-firefox-for-mobile-users-as-well\"><span class=\"tocnumber\">4.6</span> <span class=\"toctext\">Does this affect Firefox for mobile users as well?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_what-if-i-use-firefox-on-multiple-devices\"><span class=\"tocnumber\">4.7</span> <span class=\"toctext\">What if I use Firefox on multiple devices?</span></a></li><li class=\"toclevel-2\"><a href=\"#w_i-use-firefox-esr-what-should-i-do\"><span class=\"tocnumber\">4.8</span> <span class=\"toctext\">I use Firefox ESR – what should I do?</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_need-more-help\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Need more help?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<h1 id=\"w_why-is-this-update-important\">Why is this update important?</h1>\n<p>If you don’t update, Firefox features that rely on remote updates will stop working, and your installed add-ons will be disabled with the message, <em>could not be verified for use in Firefox</em>. <a href=\"https://wikipedia.org/wiki/Digital_rights_management\">DRM-protected content</a>, such as streaming services, may also stop playing due to failed updates. Additionally, systems dependent on content verification could stop functioning properly.\n</p>\n<h1 id=\"w_who-does-this-affect\">Who does this affect?</h1>\n<p>This update is necessary for all Firefox users running versions earlier than 128 (or ESR versions earlier than ESR 115.13), including those using Firefox for Desktop on Windows, macOS and Linux, as well as Firefox for Android. If you were sent to this article through an in-app message in Firefox, it means your browser version is outdated and needs to be updated.\n</p>\n<h1 id=\"w_how-to-update-firefox\">How to update Firefox</h1>\n<p>To resolve these issues, it’s essential to update Firefox. For step-by-step instructions on updating, refer to the appropriate article for your platform:\n</p>\n<ul><li><a href=\"/en-US/kb/update-firefox-latest-release\">Windows, macOS and Linux</a>\n</li><li><a href=\"/en-US/kb/update-latest-version-firefox-android\">Android</a>\n</li></ul>\n<h1 id=\"w_faqs\">FAQs</h1>\n<h2 id=\"w_what-is-a-root-certificate-and-why-is-its-expiration-important\">What is a root certificate, and why is its expiration important?</h2>\n<p>A root certificate is a trusted authority that verifies the authenticity of websites, add-ons and software updates. When it expires, systems relying on that certificate can no longer verify these items, which may cause features like add-ons or secure media playback to stop working. In this case, one of Mozilla’s root certificates  expired on <strong>March 14, 2025</strong>, which could disrupt important functionality in Firefox if the browser isn’t updated. The latest version of Firefox includes a new root certificate that will prevent this expiration and ensure everything continues to work smoothly.\n</p>\n<h2 id=\"w_how-do-i-know-if-im-affected-by-this-issue\">How do I know if I’m affected by this issue?</h2>\n<p>You are affected if you are using a version of Firefox earlier than 128 (or ESR versions earlier than ESR 115.13 for long-term support users). To check your version on Desktop, <span class=\"for\" data-for=\"win,linux\">click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">, click <span class=\"menu\">Help</span> and select <span class=\"menu\">About Firefox</span></span><span class=\"for\" data-for=\"mac\">click <span class=\"menu\">Firefox</span> on the Menu bar and select <span class=\"menu\">About Firefox</span></span>. This will display your current version and automatically check for updates. On Android, open the Firefox app, tap the Menu <img alt=\"Firefox menu Android\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-11-28-05-47-37-8c3fa8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button, select <span class=\"menu\">Settings</span>, scroll down, and tap <span class=\"menu\">About Firefox</span> to view your current version.\n</p>\n<div class=\"note\">If you were directed to this article via an in-app message in Firefox, it means you’re affected and need to update your browser.</div>\n<h2 id=\"w_what-happens-to-my-bookmarks-passwords-and-settings-if-i-update-firefox\">What happens to my bookmarks, passwords, and settings if I update Firefox?</h2>\n<p>Updating Firefox to the latest version will not affect your bookmarks, saved passwords or other settings. Your personal data will remain intact during the update process. However, we recommend <a href=\"/en-US/kb/how-do-i-set-sync-my-computer\">syncing</a> your Mozilla account to ensure everything is backed up before proceeding with any updates.\n</p>\n<h2 id=\"w_can-i-still-use-firefox-if-i-dont-update\">Can I still use Firefox if I don’t update?</h2>\n<p>While it’s possible to use Firefox without updating, you may experience problems such as add-ons being disabled, DRM media difficulties and other interruptions. Skipping the update also means missing important security fixes and performance improvements. We strongly advise you to update to the latest version to avoid these issues and ensure your browser stays secure and efficient.\n</p>\n<h2 id=\"w_what-are-the-security-risks-if-i-dont-update-firefox\">What are the security risks if I don’t update Firefox?</h2>\n<p>Not updating Firefox when the root certificate expires on <strong>March 14, 2025</strong> can expose you to significant security threats. Firefox relies on up-to-date security configurations to protect you from malicious activity. This includes blocklists for harmful add-ons, revocation lists for untrusted SSL certificates and preloaded intermediate certificates used for secure connections. Without the latest updates:\n</p>\n<ul><li><strong>Malicious Add-ons:</strong> You may become vulnerable to harmful extensions that can compromise your data or privacy.\n</li><li><strong>Untrusted Certificates:</strong> Your browser might not recognize revoked or fraudulent security certificates, putting you at risk when visiting websites.\n</li><li><strong>Compromised Passwords:</strong> Features that alert you about breached passwords may stop working, leaving you unaware of potential account compromises.\n</li></ul>\n<p>By updating to Firefox version 128 or higher (or ESR 115.13+), you ensure all these critical security features continue to function properly, keeping your browsing experience safe and secure.\n</p>\n<h2 id=\"w_does-this-affect-firefox-for-mobile-users-as-well\">Does this affect Firefox for mobile users as well?</h2>\n<p>The issue impacts Firefox for Android users but does not affect those using Firefox for iOS. If you’re on an Android version earlier than 128, please update Firefox in your device’s app store (such as Google’s Play Store or Samsung’s Galaxy Store). iOS users do not need to take any action.\n</p>\n<h2 id=\"w_what-if-i-use-firefox-on-multiple-devices\">What if I use Firefox on multiple devices?</h2>\n<p>If you use Firefox on multiple devices, you will need to ensure that each one is updated to version 128 or higher (or ESR 115.13+ for long-term support users). This will prevent any issues with add-ons, secure media playback, or web content across all your devices.\n</p>\n<h2 id=\"w_i-use-firefox-esr-what-should-i-do\">I use Firefox ESR – what should I do?</h2>\n<p>For Firefox ESR users, you need to ensure that your browser is updated to ESR 115.13+ to avoid issues caused by the root certificate expiration. If you are part of an organization, consult your IT department for assistance.\n</p>\n<h1 id=\"w_need-more-help\">Need more help?</h1>\n<p>If you have any trouble with the update or need further assistance, please check the <a href=\"https://support.mozilla.org/en-US/questions/new/firefox\">Firefox Community Forum</a> for similar questions or ask a new question there. Head over to ask questions and find answers from both the Mozilla team and the community. We’re here to help!\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/best-practices-installing-and-updating-firefox\">Best practices for installing and updating Firefox</a>\n</li><li><a href=\"/en-US/kb/managing-firefox-updates\">Manage Firefox updates</a>\n</li></ul>",
  "text": "A root certificate that was used to verify signed content and add-ons for various Mozilla projects, including Firefox, expired on March 14, 2025 . Without updating to Firefox version 128 or higher (or ESR 115.13+ for ESR users, including Windows 7/8/8.1 and macOS 10.12–10.14 users), this expiration causes significant issues with add-ons, content signing and DRM-protected media playback. Table of Contents 1 Why is this update important? 2 Who does this affect? 3 How to update Firefox 4 FAQs 4.1 What is a root certificate, and why is its expiration important? 4.2 How do I know if I’m affected by this issue? 4.3 What happens to my bookmarks, passwords, and settings if I update Firefox? 4.4 Can I still use Firefox if I don’t update? 4.5 What are the security risks if I don’t update Firefox? 4.6 Does this affect Firefox for mobile users as well? 4.7 What if I use Firefox on multiple devices? 4.8 I use Firefox ESR – what should I do? 5 Need more help? 6 Related articles Why is this update important? If you don’t update, Firefox features that rely on remote updates will stop working, and your installed add-ons will be disabled with the message, could not be verified for use in Firefox . DRM-protected content , such as streaming services, may also stop playing due to failed updates. Additionally, systems dependent on content verification could stop functioning properly. Who does this affect? This update is necessary for all Firefox users running versions earlier than 128 (or ESR versions earlier than ESR 115.13), including those using Firefox for Desktop on Windows, macOS and Linux, as well as Firefox for Android. If you were sent to this article through an in-app message in Firefox, it means your browser version is outdated and needs to be updated. How to update Firefox To resolve these issues, it’s essential to update Firefox. For step-by-step instructions on updating, refer to the appropriate article for your platform: Windows, macOS and Linux Android FAQs What is a root certificate, and why is its expiration important? A root certificate is a trusted authority that verifies the authenticity of websites, add-ons and software updates. When it expires, systems relying on that certificate can no longer verify these items, which may cause features like add-ons or secure media playback to stop working. In this case, one of Mozilla’s root certificates expired on March 14, 2025 , which could disrupt important functionality in Firefox if the browser isn’t updated. The latest version of Firefox includes a new root certificate that will prevent this expiration and ensure everything continues to work smoothly. How do I know if I’m affected by this issue? You are affected if you are using a version of Firefox earlier than 128 (or ESR versions earlier than ESR 115.13 for long-term support users). To check your version on Desktop, click the menu button , click Help and select About Firefox click Firefox on the Menu bar and select About Firefox . This will display your current version and automatically check for updates. On Android, open the Firefox app, tap the Menu button, select Settings , scroll down, and tap About Firefox to view your current version. If you were directed to this article via an in-app message in Firefox, it means you’re affected and need to update your browser. What happens to my bookmarks, passwords, and settings if I update Firefox? Updating Firefox to the latest version will not affect your bookmarks, saved passwords or other settings. Your personal data will remain intact during the update process. However, we recommend syncing your Mozilla account to ensure everything is backed up before proceeding with any updates. Can I still use Firefox if I don’t update? While it’s possible to use Firefox without updating, you may experience problems such as add-ons being disabled, DRM media difficulties and other interruptions. Skipping the update also means missing important security fixes and performance improvements. We strongly advise you to update to the latest version to avoid these issues and ensure your browser stays secure and efficient. What are the security risks if I don’t update Firefox? Not updating Firefox when the root certificate expires on March 14, 2025 can expose you to significant security threats. Firefox relies on up-to-date security configurations to protect you from malicious activity. This includes blocklists for harmful add-ons, revocation lists for untrusted SSL certificates and preloaded intermediate certificates used for secure connections. Without the latest updates: Malicious Add-ons: You may become vulnerable to harmful extensions that can compromise your data or privacy. Untrusted Certificates: Your browser might not recognize revoked or fraudulent security certificates, putting you at risk when visiting websites. Compromised Passwords: Features that alert you about breached passwords may stop working, leaving you unaware of potential account compromises. By updating to Firefox version 128 or higher (or ESR 115.13+), you ensure all these critical security features continue to function properly, keeping your browsing experience safe and secure. Does this affect Firefox for mobile users as well? The issue impacts Firefox for Android users but does not affect those using Firefox for iOS. If you’re on an Android version earlier than 128, please update Firefox in your device’s app store (such as Google’s Play Store or Samsung’s Galaxy Store). iOS users do not need to take any action. What if I use Firefox on multiple devices? If you use Firefox on multiple devices, you will need to ensure that each one is updated to version 128 or higher (or ESR 115.13+ for long-term support users). This will prevent any issues with add-ons, secure media playback, or web content across all your devices. I use Firefox ESR – what should I do? For Firefox ESR users, you need to ensure that your browser is updated to ESR 115.13+ to avoid issues caused by the root certificate expiration. If you are part of an organization, consult your IT department for assistance. Need more help? If you have any trouble with the update or need further assistance, please check the Firefox Community Forum for similar questions or ask a new question there. Head over to ask questions and find answers from both the Mozilla team and the community. We’re here to help! Related articles Best practices for installing and updating Firefox Manage Firefox updates",
  "products": [
    "firefox",
    "mobile"
  ],
  "topics": [
    "installation-and-updates"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 10985,
    "text_bytes": 6458,
    "word_count": 1050,
    "downloaded_at": "2025-08-26T10:56:55.071121"
  }
}