{
  "slug": "secure-connection-failed-firefox-did-not-connect",
  "title": "Fix secure connection failed errors in Firefox",
  "summary": "If a website requires a secure connection that cannot be established, Firefox will not connect and will show you an error page. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/secure-connection-failed-firefox-did-not-connect",
  "html": "<p>When a website that requires a secure (<a href=\"https://wikipedia.org/wiki/HTTPS\">HTTPS</a>) connection tries to communicate with your computer, Firefox cross-checks this attempt to make sure that the <a href=\"/en-US/kb/secure-website-certificate\">website certificate</a> and the connection method are actually secure. If Firefox cannot establish a secure connection it will display an error message, which usually means\n</p>\n<ul><li> Firefox can’t verify the site’s security certificate, or\n</li><li> Something on your computer or network is blocking or replacing the secure connection.\n</li></ul>\n<p>This article explains why you may see a <strong>Secure Connection Failed</strong> page or other connection security error and what you can do about it.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_secure-connection-failed\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Secure Connection Failed</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_tls-version-unsupported\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">TLS version unsupported</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_did-not-connect-potential-security-issue\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Did Not Connect: Potential Security Issue</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_hsts-required\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">HSTS required</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_warning-potential-security-risk-ahead\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Warning: Potential Security Risk Ahead</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_other-possible-solutions\"><span class=\"tocnumber\">3.1</span> <span class=\"toctext\">Other possible solutions</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<h1 id=\"w_secure-connection-failed\">Secure Connection Failed</h1>\n<p>A <em>Secure Connection Failed</em> error page will include a description of the error and a <span class=\"button\">Try Again</span> button. There is no option to add a security exception to bypass this type of error.\n</p>\n<dl><dt><img alt=\"Fx142SecureConnectionFailed\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-08-24-19-00-28-2b3c07.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>The error page will also include the following information:\n</p>\n<ul><li> <em>The page you are trying to view cannot be shown because the authenticity of the received data could not be verified.</em>\n</li><li> <em>Please contact the website owners to inform them of this problem.</em>\n</li></ul>\n<h2 id=\"w_tls-version-unsupported\">TLS version unsupported</h2>\n<p>Some websites try using outdated (no longer secure) <a href=\"http://wikipedia.org/wiki/Transport_Layer_Security\">Transport Layer Security</a> (TLS) mechanisms in an attempt to secure your connection. Firefox protects you by preventing navigation to such sites if there is a problem in securely establishing a connection. Contact the owners of the website and ask them to update their TLS version to a version that is still current and secure.\n</p><p>The minimum TLS version allowed by default is TLS 1.2. Websites that don't support TLS version 1.2 or higher will display a <em>Secure Connection Failed</em> error page with a <em>SSL_ERROR_UNSUPPORTED_VERSION</em> error code and a message that says: <em>This website might not support the TLS 1.2 protocol, which is the minimum version supported by Firefox.</em>  For more information, see <a href=\"https://hacks.mozilla.org/2020/02/its-the-boot-for-tls-1-0-and-tls-1-1/\">this Mozilla blog post</a> and <a href=\"https://developer.mozilla.org/docs/Web/Security/Transport_Layer_Security\">Transport Layer Security (MDN Web Docs)</a>.\n</p>\n<h1 id=\"w_did-not-connect-potential-security-issue\">Did Not Connect: Potential Security Issue</h1>\n<p>Certain secure connection failures will result in a <em>Did Not Connect: Potential Security Issue</em> error page.\n</p>\n<dl><dt><img alt=\"Fx142SecError-DidNotConnect\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-08-24-18-23-38-a5114c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>The error page will include a description of the potential security threat and an <span class=\"button\">Advanced…</span> button to view the error code and other technical details. There is no option to add a security exception to visit the website.\n</p>\n<h2 id=\"w_hsts-required\">HSTS required</h2>\n<p>Websites may require <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Strict-Transport-Security#Description\">HTTP Strict Transport Security</a> (HSTS) and will not allow access with an insecure connection.\n</p>\n<h1 id=\"w_warning-potential-security-risk-ahead\">Warning: Potential Security Risk Ahead</h1>\n<p>Firefox checks a website’s security certificate to ensure the site is legitimate and that your connection is <a href=\"/en-US/kb/how-do-i-tell-if-my-connection-is-secure\">encrypted</a>. If the certificate can’t be validated, Firefox will stop the connection and display a <em>Warning: Potential Security Risk Ahead</em> page.\n</p>\n<dl><dt><img alt=\"Fx142WarningPotentialSecurityRisk\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-08-24-18-50-29-bde5b9.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>Click the <span class=\"button\">Advanced…</span> button to view the error code and additional information. Depending on the error, you may be able to bypass the warning and visit the site. To learn more, see <a href=\"/en-US/kb/what-does-your-connection-is-not-secure-mean\">What do the security warning codes mean?</a>.\n</p><p>This error can be caused security software products that intercept secure connections by default, which can produce connection errors or warnings on secure websites. For more information, see <a href=\"/en-US/kb/error-codes-secure-websites\">Troubleshoot security error codes on secure websites</a>.\n</p><p>An incorrect system clock can also cause Firefox to detect that the website's security certificate is expired or invalid. Make sure your computer is set to the correct date, time and time zone. See <a href=\"/en-US/kb/troubleshoot-time-errors-secure-websites\">Troubleshoot time-related errors on secure websites</a>.\n</p>\n<h2 id=\"w_other-possible-solutions\">Other possible solutions</h2>\n<ul><li><strong>Check if the website is down:</strong> If a website won’t load in Firefox, it might be a problem on the site’s end.\n</li><li><strong>Try opening the same site in another browser:</strong> If it doesn’t load there either, the website is likely experiencing issues.\n</li><li><strong>Clear cached certificates in Firefox:</strong> If Firefox has saved an outdated or untrusted certificate, removing it may fix the error. <span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n Go to the <span class=\"menu\">Privacy &amp; Security</span> panel, go down to the <strong>Certificates</strong> section, click <span class=\"button\">View Certificates…</span>, select any untrusted or outdated site certificates and click <span class=\"button\">Delete or distrust…</span>.\n</li></ul>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li> <a href=\"/en-US/kb/Certificate-contains-the-same-serial-number-as-another-certificate\">Certificate contains the same serial number as another certificate</a>\n</li><li> <a href=\"/en-US/kb/websites-look-wrong-or-appear-differently\">Websites look wrong or appear differently than they should</a>\n</li><li> <a href=\"/en-US/kb/websites-dont-load-troubleshoot-and-fix-errors\">Websites don't load - troubleshoot and fix error messages</a>\n</li></ul>",
  "text": "When a website that requires a secure ( HTTPS ) connection tries to communicate with your computer, Firefox cross-checks this attempt to make sure that the website certificate and the connection method are actually secure. If Firefox cannot establish a secure connection it will display an error message, which usually means Firefox can’t verify the site’s security certificate, or Something on your computer or network is blocking or replacing the secure connection. This article explains why you may see a Secure Connection Failed page or other connection security error and what you can do about it. Table of Contents 1 Secure Connection Failed 1.1 TLS version unsupported 2 Did Not Connect: Potential Security Issue 2.1 HSTS required 3 Warning: Potential Security Risk Ahead 3.1 Other possible solutions 4 Related articles Secure Connection Failed A Secure Connection Failed error page will include a description of the error and a Try Again button. There is no option to add a security exception to bypass this type of error. The error page will also include the following information: The page you are trying to view cannot be shown because the authenticity of the received data could not be verified. Please contact the website owners to inform them of this problem. TLS version unsupported Some websites try using outdated (no longer secure) Transport Layer Security (TLS) mechanisms in an attempt to secure your connection. Firefox protects you by preventing navigation to such sites if there is a problem in securely establishing a connection. Contact the owners of the website and ask them to update their TLS version to a version that is still current and secure. The minimum TLS version allowed by default is TLS 1.2. Websites that don't support TLS version 1.2 or higher will display a Secure Connection Failed error page with a SSL_ERROR_UNSUPPORTED_VERSION error code and a message that says: This website might not support the TLS 1.2 protocol, which is the minimum version supported by Firefox. For more information, see this Mozilla blog post and Transport Layer Security (MDN Web Docs) . Did Not Connect: Potential Security Issue Certain secure connection failures will result in a Did Not Connect: Potential Security Issue error page. The error page will include a description of the potential security threat and an Advanced… button to view the error code and other technical details. There is no option to add a security exception to visit the website. HSTS required Websites may require HTTP Strict Transport Security (HSTS) and will not allow access with an insecure connection. Warning: Potential Security Risk Ahead Firefox checks a website’s security certificate to ensure the site is legitimate and that your connection is encrypted . If the certificate can’t be validated, Firefox will stop the connection and display a Warning: Potential Security Risk Ahead page. Click the Advanced… button to view the error code and additional information. Depending on the error, you may be able to bypass the warning and visit the site. To learn more, see What do the security warning codes mean? . This error can be caused security software products that intercept secure connections by default, which can produce connection errors or warnings on secure websites. For more information, see Troubleshoot security error codes on secure websites . An incorrect system clock can also cause Firefox to detect that the website's security certificate is expired or invalid. Make sure your computer is set to the correct date, time and time zone. See Troubleshoot time-related errors on secure websites . Other possible solutions Check if the website is down: If a website won’t load in Firefox, it might be a problem on the site’s end. Try opening the same site in another browser: If it doesn’t load there either, the website is likely experiencing issues. Clear cached certificates in Firefox: If Firefox has saved an outdated or untrusted certificate, removing it may fix the error. In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Go to the Privacy & Security panel, go down to the Certificates section, click View Certificates… , select any untrusted or outdated site certificates and click Delete or distrust… . Related articles Certificate contains the same serial number as another certificate Websites look wrong or appear differently than they should Websites don't load - troubleshoot and fix error messages",
  "products": [
    "firefox"
  ],
  "topics": [
    "error-codes",
    "performance-and-connectivity"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 8809,
    "text_bytes": 4556,
    "word_count": 738,
    "downloaded_at": "2025-08-26T09:03:54.679258"
  }
}