{
  "slug": "send-tab-firefox-desktop-other-devices",
  "title": "Send Tab from Firefox desktop to other devices",
  "summary": "The Send Tab feature lets you send pages from Firefox desktop to your phone or tablet so you can view them later.",
  "url": "https://support.mozilla.org/en-US/kb/send-tab-firefox-desktop-other-devices",
  "html": "<p>Firefox's Send Tab feature lets you send pages from your computer to other devices, such as an iPhone, iPad or Android device.\n</p>\n<div class=\"note\"><strong>Note:</strong> <em>Other devices</em> can also mean <a href=\"/en-US/kb/profile-manager-create-remove-switch-firefox-profiles\">Firefox profiles</a> on the same computer, if you use more than one Firefox version or profile.</div>\n<dl><dt><img alt=\"sync illustration\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-11-27-13-05-18-63ad9d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_send-tabs-from-your-computer\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Send tabs from your computer</span></a></li><li class=\"toclevel-1\"><a href=\"#w_i-dont-see-my-device-listed\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">I don’t see my device listed</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-remove-old-devices-from-my-send-tab-device-list\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How do I remove old devices from my Send Tab device list?</span></a></li></ul></div>\n<h1 id=\"w_send-tabs-from-your-computer\">Send tabs from your computer</h1>\n<ol><li>Get started by signing in to your <a href=\"/en-US/kb/access-mozilla-services-firefox-account\">Mozilla account</a> on your computer. If you don’t have one yet, you can <a href=\"https://accounts.firefox.com/signup\">sign up for a Mozilla account</a>. It gives you quick access to synced tabs, saved passwords, bookmarks and more!\n</li><li>Sign in to your Mozilla account on your <a href=\"#w_i-dont-see-my-device-listed\">other device</a>.\n</li><li><span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Control</span> key while you click</span>\n a tab on your computer, select <span class=\"menu\">Send Tab to Device</span>, and choose the device to send the tab to.\n<dl><dt><img alt=\"send tab fx71\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-11-27-13-10-06-510066.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\">\n</dt></dl>\n</li></ol>\n<h1 id=\"w_i-dont-see-my-device-listed\">I don’t see my device listed</h1>\n<p>You’ll be able to send tabs to devices that you’ve added to your Mozilla account. If you don’t see a device listed, follow these steps to add that device:\n</p>\n<ol><li>Open Firefox on the device you want to connect.\n</li><li>Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the menu panel.\n\n</li><li>Select <span class=\"menu\">Sign in to Sync</span> or <span class=\"menu\">Sync and save data</span> (depending on the device or version of Firefox).\n</li><li>Follow the prompts to sign in or sign up.\n</li></ol>\n<p>Your Mozilla account will sync and add your device to the list.\n</p>\n<div class=\"note\">\n<p>To send tabs from your phone or tablet, see the following articles:\n</p>\n<ul><li><a href=\"/en-US/kb/send-tab-firefox-ios-another-device\">Send a tab from Firefox for iOS to another device</a>\n</li><li><a href=\"/en-US/kb/send-tab-from-another-mobile-app-to-firefox\">Send Tab from another mobile app to Firefox</a>\n</li></ul>\n</div>\n<h1 id=\"w_how-do-i-remove-old-devices-from-my-send-tab-device-list\">How do I remove old devices from my Send Tab device list?</h1>\n<p>Over time, it is possible that your Send Tab device list contains devices you no longer use, or has repeated devices listed.\n</p><p>To clean up your Send Tab device list:\n</p>\n<ol><li>Make sure you are signed in to your Mozilla account and visit <a href=\"https://accounts.firefox.com/settings\">https://accounts.firefox.com/settings</a>.\n</li><li>Under <em>Connected Services</em>, click <span class=\"button\">Sign out</span> for the devices you want to disconnect from your Mozilla account.\n</li></ol>\n<p>See <a href=\"/en-US/kb/fxa-managing-devices\">Manage the devices linked to your Mozilla account</a> to learn more.\n</p>",
  "text": "Firefox's Send Tab feature lets you send pages from your computer to other devices, such as an iPhone, iPad or Android device. Note: Other devices can also mean Firefox profiles on the same computer, if you use more than one Firefox version or profile. Table of Contents 1 Send tabs from your computer 2 I don’t see my device listed 3 How do I remove old devices from my Send Tab device list? Send tabs from your computer Get started by signing in to your Mozilla account on your computer. If you don’t have one yet, you can sign up for a Mozilla account . It gives you quick access to synced tabs, saved passwords, bookmarks and more! Sign in to your Mozilla account on your other device . Right-click Hold down the Control key while you click a tab on your computer, select Send Tab to Device , and choose the device to send the tab to. I don’t see my device listed You’ll be able to send tabs to devices that you’ve added to your Mozilla account. If you don’t see a device listed, follow these steps to add that device: Open Firefox on the device you want to connect. Click the menu button to open the menu panel. Select Sign in to Sync or Sync and save data (depending on the device or version of Firefox). Follow the prompts to sign in or sign up. Your Mozilla account will sync and add your device to the list. To send tabs from your phone or tablet, see the following articles: Send a tab from Firefox for iOS to another device Send Tab from another mobile app to Firefox How do I remove old devices from my Send Tab device list? Over time, it is possible that your Send Tab device list contains devices you no longer use, or has repeated devices listed. To clean up your Send Tab device list: Make sure you are signed in to your Mozilla account and visit https://accounts.firefox.com/settings . Under Connected Services , click Sign out for the devices you want to disconnect from your Mozilla account. See Manage the devices linked to your Mozilla account to learn more.",
  "products": [
    "firefox"
  ],
  "topics": [
    "sync-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4508,
    "text_bytes": 1979,
    "word_count": 366,
    "downloaded_at": "2025-08-26T10:47:40.256213"
  }
}