{
  "slug": "site-information-panel",
  "title": "Site Information panel",
  "summary": "The Site Information panel in Firefox tells you about a website's connection security and identity. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/site-information-panel",
  "html": "<p>The <strong>Site Information</strong> panel is where you can view information about a website's connection security and identity.\n</p>\n<h2 id=\"w_connection-security\">Connection security</h2>\n<p>A padlock icon <img alt=\"Fx89Padlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-33-33-7bdc86.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the address bar will indicate whether the connection to the website is fully secure. For more information, click the padlock to open the <strong>Site Information</strong> panel. This panel shows you whether the current connection is classified as secure.\n</p><p><img alt=\"Fx135SiteInfoPanel\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-02-11-05-40-47-eba377.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</p><p>Click the right arrow in the Site Information panel to view the <strong>Connection Security</strong> panel. This is where you can learn more about connection security, such as the issuer of a certificate for a secure connection and – if it is made available – the website's owner, or disable the blocking of insecure content on a site. This panel also includes a <span class=\"button\">More Information</span> button that will open the <a href=\"/en-US/kb/firefox-page-info-window\">Page Info window</a> <span class=\"menu\">Security</span> tab for the website.\n</p><p>See <a href=\"/en-US/kb/how-do-i-tell-if-my-connection-is-secure\">How do I tell if my connection to a website is secure?</a> to learn more about connection security. The <a href=\"/en-US/kb/mixed-content-blocking-firefox\">Mixed content blocking in Firefox</a> article tells you about Firefox's mixed content blocking security feature.\n</p>\n<div class=\"note\"><strong>Note:</strong> If you have set any special permissions for the website, you will also see a Permissions icon <img alt=\"Fx89PermissionsIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-10-05-34-30-47c30e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the address bar. Click this icon to view or adjust those permissions. If you don't see a Permissions icon or to edit other permissions, the <a href=\"/en-US/kb/firefox-page-info-window\">Page Info window</a> includes a <span class=\"menu\">Permissions</span> tab with a list of available permission settings for the website. To learn more, see the <a href=\"/en-US/kb/site-permissions-panel\">Site Permissions panel</a> article.</div>",
  "text": "The Site Information panel is where you can view information about a website's connection security and identity. Connection security A padlock icon in the address bar will indicate whether the connection to the website is fully secure. For more information, click the padlock to open the Site Information panel. This panel shows you whether the current connection is classified as secure. Click the right arrow in the Site Information panel to view the Connection Security panel. This is where you can learn more about connection security, such as the issuer of a certificate for a secure connection and – if it is made available – the website's owner, or disable the blocking of insecure content on a site. This panel also includes a More Information button that will open the Page Info window Security tab for the website. See How do I tell if my connection to a website is secure? to learn more about connection security. The Mixed content blocking in Firefox article tells you about Firefox's mixed content blocking security feature. Note: If you have set any special permissions for the website, you will also see a Permissions icon in the address bar. Click this icon to view or adjust those permissions. If you don't see a Permissions icon or to edit other permissions, the Page Info window includes a Permissions tab with a list of available permission settings for the website. To learn more, see the Site Permissions panel article.",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2863,
    "text_bytes": 1441,
    "word_count": 243,
    "downloaded_at": "2025-08-26T10:36:54.114106"
  }
}