{
  "slug": "site-permission-add-ons",
  "title": "Site Permission Add-ons",
  "summary": "Sites can ask to install permission add-ons that modify Firefox’s default security behavior to give them extra privileges. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/site-permission-add-ons",
  "html": "<p>When you browse the web, Firefox protects you by isolating each website from your other tabs and the rest of your computer. You don’t have to do anything special to get this kind of protection. It happens by default.\n</p><p>Websites rarely have a good reason to bypass this protection, but there are occasional exceptions: for example, a site for musicians might want to access an audio synthesizer device that is plugged into your computer.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-are-site-permission-add-ons\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What are site permission add-ons?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-can-i-stay-safe\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How can I stay safe?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_related-articles\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Related articles</span></a></li></ul></div>\n<h1 id=\"w_what-are-site-permission-add-ons\">What are site permission add-ons?</h1>\n<p>Site permission add-ons are a type of software that websites can ask you to install to modify Firefox’s default security behavior and give them extra privileges, such as unrestricted access to devices connected to your computer.\n</p><p>These add-ons can be powerful, but like any other software installed on your computer, they can also be dangerous. There is no way to guarantee that sites are not abusing their extended access, which could include:\n</p>\n<ul><li>Causing physical damage or transmitting malware to your connected devices;\n</li><li>Making changes that are impossible to reverse;\n</li><li>Using the extra information they see to identify who you are (see <a href=\"/en-US/kb/firefox-protection-against-fingerprinting\">fingerprinting</a>).\n</li></ul>\n<h1 id=\"w_how-can-i-stay-safe\">How can I stay safe?</h1>\n<p>If you’re considering whether to install a site permission add-on, we recommend asking yourself the following questions:\n</p>\n<ul><li><strong>Do you trust the website?</strong> Unless you fully trust the source, avoid installing the site permissions add-on. (Keep in mind, some malicious sites may mimic the look and feel of popular, trusted brands.)\n</li><li><strong>Do you really need what the site is offering?</strong> This may seem obvious, but it is worth mentioning – will granting these permissions offer you a clear benefit?\n</li></ul>\n<p>These are just a few tips for figuring out if a permission add-on is trustworthy, but it is by no means a comprehensive guide. Be cautious when considering any software that modifies Firefox's default settings.\n</p><p>Once installed, site permission add-ons will appear in a separate panel in the add-ons manager, where you can <a href=\"/en-US/kb/find-and-install-add-ons-add-features-to-firefox#w_viewing-and-managing-your-installed-add-ons\">view and manage your add-ons</a>.\n</p>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/permission-request-messages-firefox-extensions\">Permission request messages for Firefox extensions</a>\n</li><li><a href=\"/en-US/kb/tips-assessing-safety-extension\">Tips for assessing the safety of an extension</a>\n</li></ul>",
  "text": "When you browse the web, Firefox protects you by isolating each website from your other tabs and the rest of your computer. You don’t have to do anything special to get this kind of protection. It happens by default. Websites rarely have a good reason to bypass this protection, but there are occasional exceptions: for example, a site for musicians might want to access an audio synthesizer device that is plugged into your computer. Table of Contents 1 What are site permission add-ons? 2 How can I stay safe? 3 Related articles What are site permission add-ons? Site permission add-ons are a type of software that websites can ask you to install to modify Firefox’s default security behavior and give them extra privileges, such as unrestricted access to devices connected to your computer. These add-ons can be powerful, but like any other software installed on your computer, they can also be dangerous. There is no way to guarantee that sites are not abusing their extended access, which could include: Causing physical damage or transmitting malware to your connected devices; Making changes that are impossible to reverse; Using the extra information they see to identify who you are (see fingerprinting ). How can I stay safe? If you’re considering whether to install a site permission add-on, we recommend asking yourself the following questions: Do you trust the website? Unless you fully trust the source, avoid installing the site permissions add-on. (Keep in mind, some malicious sites may mimic the look and feel of popular, trusted brands.) Do you really need what the site is offering? This may seem obvious, but it is worth mentioning – will granting these permissions offer you a clear benefit? These are just a few tips for figuring out if a permission add-on is trustworthy, but it is by no means a comprehensive guide. Be cautious when considering any software that modifies Firefox's default settings. Once installed, site permission add-ons will appear in a separate panel in the add-ons manager, where you can view and manage your add-ons . Related articles Permission request messages for Firefox extensions Tips for assessing the safety of an extension",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3207,
    "text_bytes": 2179,
    "word_count": 358,
    "downloaded_at": "2025-08-26T10:55:36.210367"
  }
}