{
  "slug": "smartblock-enhanced-tracking-protection",
  "title": "SmartBlock for Enhanced Tracking Protection",
  "summary": "SmartBlock lets pages load more fully, with less breakage – all while keeping those tracking scripts blocked.",
  "url": "https://support.mozilla.org/en-US/kb/smartblock-enhanced-tracking-protection",
  "html": "<p><a href=\"https://blog.mozilla.org/security/2021/03/23/introducing-smartblock/\">SmartBlock</a> stands in for common tracking scripts, which are blocked in <a href=\"/en-US/kb/private-browsing-use-firefox-without-history\">Private Browsing mode</a> and in <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop#w_adjust-your-global-enhanced-tracking-protection-settings\">Enhanced Tracking Protection <strong>strict</strong> level</a>. By doing so, it lets pages load more fully, with less breakage, without you having to do anything – all while keeping those tracking scripts blocked.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_log-in-with-facebook-when-you-visit-third-party-sites\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Log in with Facebook when you visit third-party sites</span></a></li><li class=\"toclevel-1\"><a href=\"#w_enabling-embedded-content\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Enabling embedded content</span></a></li><li class=\"toclevel-1\"><a href=\"#w_disabling-smartblock\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Disabling SmartBlock</span></a></li></ul></div>\n<p>The difference can be dramatic:\n</p>\n<dl><dt><img alt=\"Smartblock off\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-03-16-12-13-52-8d8508.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"400\"><img alt=\"Smartblock on\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-03-16-12-14-49-5b9cd4.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"400\">\n</dt></dl>\n<h1 id=\"w_log-in-with-facebook-when-you-visit-third-party-sites\">Log in with Facebook when you visit third-party sites</h1>\n<p>SmartBlock lets you log in with your Facebook account when visiting third-party sites in Private Browsing mode without compromising your privacy while avoiding website breakages. Just click the Facebook login button to log in as you normally would, and SmartBlock will allow only the required Facebook scripts, only when you log in by clicking the login button, and will only allow them for that website.\n</p><div class=\"for\" data-for=\"fx136\">\n<h1 id=\"w_enabling-embedded-content\">Enabling embedded content</h1>\n<p>Firefox allows you to unblock trackers to access certain embedded content without leaving the strict level of Enhanced Tracking Protection or Private Browsing mode. When you navigate to a website with supported embedded content, you will see a placeholder on the page in place of the previously blocked content.\n</p>\n<dl><dt><img alt=\"Smartblock placeholder\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-02-26-14-19-32-3decd1.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"400\">\n</dt></dl>\n<p>Clicking the placeholder directs you to the protections panel, where you can unblock the content you wish to see by selecting the appropriate option under <em>Tracking Content</em>.\n</p>\n<dl><dt><img alt=\"Smartblock controls\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-02-26-14-20-48-9f8d48.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"400\">\n</dt></dl>\n<p>Content can be reblocked at a later date by deselecting the option.\n</p><p>Your choice of unblocked content persists throughout your browsing session and is reset when your session ends.\n</p><p>Currently, support is available for Instagram and TikTok embeds with further support coming in the near future.\n</p></div>\n<h1 id=\"w_disabling-smartblock\">Disabling SmartBlock</h1>\n<p>If you're a website developer or advanced user and you wish to disable SmartBlock, you may do so from the <a href=\"/en-US/kb/about-config-editor-firefox\">Firefox Configuration Editor</a>.\n</p><div class=\"warning\"><strong>Warning:</strong> These instructions are for experienced Firefox users. Changing settings in the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a> (<em>about:config</em>) can have serious effects on your browser’s stability, security and performance.\n<br><strong>Only proceed if you are comfortable with advanced settings and understand the potential impacts</strong>.</div>\n<p></p>\n<ol><li>Type <strong>about:config</strong> in the <a href=\"/en-US/kb/search-firefox-address-bar\">address bar</a> and press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>.<br>A warning page may appear. Click <span class=\"button\">Accept the Risk and Continue</span> to go to the <em>about:config</em> page.\n\n</li><li>Find the <span class=\"pref\">extensions.webcompat.enable_shims</span> preference.\n</li><li>Click the <em>Toggle</em> <img alt=\"Fx71aboutconfig-ToggleButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-10-29-08-56-36-b0ab10.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button next to the preference to set it to <span class=\"pref\">false</span>.\n</li></ol>",
  "text": "SmartBlock stands in for common tracking scripts, which are blocked in Private Browsing mode and in Enhanced Tracking Protection strict level . By doing so, it lets pages load more fully, with less breakage, without you having to do anything – all while keeping those tracking scripts blocked. Table of Contents 1 Log in with Facebook when you visit third-party sites 2 Enabling embedded content 3 Disabling SmartBlock The difference can be dramatic: Log in with Facebook when you visit third-party sites SmartBlock lets you log in with your Facebook account when visiting third-party sites in Private Browsing mode without compromising your privacy while avoiding website breakages. Just click the Facebook login button to log in as you normally would, and SmartBlock will allow only the required Facebook scripts, only when you log in by clicking the login button, and will only allow them for that website. Enabling embedded content Firefox allows you to unblock trackers to access certain embedded content without leaving the strict level of Enhanced Tracking Protection or Private Browsing mode. When you navigate to a website with supported embedded content, you will see a placeholder on the page in place of the previously blocked content. Clicking the placeholder directs you to the protections panel, where you can unblock the content you wish to see by selecting the appropriate option under Tracking Content . Content can be reblocked at a later date by deselecting the option. Your choice of unblocked content persists throughout your browsing session and is reset when your session ends. Currently, support is available for Instagram and TikTok embeds with further support coming in the near future. Disabling SmartBlock If you're a website developer or advanced user and you wish to disable SmartBlock, you may do so from the Firefox Configuration Editor . Warning: These instructions are for experienced Firefox users. Changing settings in the Configuration Editor ( about:config ) can have serious effects on your browser’s stability, security and performance. Only proceed if you are comfortable with advanced settings and understand the potential impacts . Type about:config in the address bar and press Enter Return . A warning page may appear. Click Accept the Risk and Continue to go to the about:config page. Find the extensions.webcompat.enable_shims preference. Click the Toggle button next to the preference to set it to false .",
  "products": [
    "firefox"
  ],
  "topics": [
    "privacy-and-security",
    "tracking-protection"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5593,
    "text_bytes": 2454,
    "word_count": 388,
    "downloaded_at": "2025-08-26T10:54:04.482269"
  }
}