{
  "slug": "solutions-can-not-create-temp-folder-archive-error",
  "title": "Solutions for \"Can not create temp folder archive\" error when installing Firefox (Windows 10)",
  "summary": "Stuck with the \"Can not create temp folder archive\" error on 7-Zip when installing Firefox for Windows 10? This article will help you to solve the issue.",
  "url": "https://support.mozilla.org/en-US/kb/solutions-can-not-create-temp-folder-archive-error",
  "html": "<p>When installing Firefox for Windows 10, the error message, <strong>\"Can not create temp folder archive,\"</strong> is shown when 7-Zip tries to unpack the installation file but is not able to locate the Temp folder or it is not able to access it. This is how the error looks like:\n</p><p><img alt=\"can not create temp folder archive error\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-06-06-21-32-21-c0928e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> \n</p><p><strong>Running the Firefox installation file as an administrator or with an administrator account is a common fix for this problem and it can work for some users.</strong> In case if that does not work for you, this article will also be exploring the other possible solutions to help you solve this issue.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_running-the-installation-file-as-administrator\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Running the installation file as administrator</span></a></li><li class=\"toclevel-1\"><a href=\"#w_moving-installation-file-to-desktop\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Moving installation file to Desktop</span></a></li><li class=\"toclevel-1\"><a href=\"#w_ensuring-the-temp-folder-is-in-the-correct-directory\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Ensuring the Temp folder is in the correct directory</span></a></li><li class=\"toclevel-1\"><a href=\"#w_other-solutions\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Other solutions</span></a></li></ul></div>\n<h1 id=\"w_running-the-installation-file-as-administrator\">Running the installation file as administrator</h1>\n<p>Simply right-click on the installation file and select <strong>Run as administrator</strong>. This will give the file admin-level permissions for 7-Zip to create an archive in the Temp folder to proceed with the installation if it is having insufficient permissions to do so.\n</p>\n<h1 id=\"w_moving-installation-file-to-desktop\">Moving installation file to Desktop</h1>\n<p>Before running the file, make sure it is saved in the same drive where Windows is installed. A simple way to ensure this is by <strong>moving the file to the Desktop</strong> and run it. If needed, right click and select <strong>Run as administrator</strong>.\n</p>\n<h1 id=\"w_ensuring-the-temp-folder-is-in-the-correct-directory\">Ensuring the Temp folder is in the correct directory</h1>\n<p>The Temp folder which the installation file is trying to access to unpack files for installation is usually located at: <strong>Users\\[username]\\AppData\\Local\\Temp</strong>\n</p><p>To ensure the Temp folder is located in the correct directory, follow the steps below:\n</p>\n<ol><li> Open up the <strong>start menu</strong>\n</li><li> Search <strong>%appdata%</strong> and hit Enter\n</li><li> Click on <strong>AppData</strong> on the top bar\n</li><li> Go into the <strong>Local</strong> folder\n</li><li> Check if the <strong>Temp</strong> folder exists in here, if it does not exist, create a new folder named <strong>Temp</strong> (make sure letter 'T' is capital)\n</li></ol>\n<p>After that, you may perform the previous solutions again to see if they work this time.\n</p>\n<h1 id=\"w_other-solutions\">Other solutions</h1>\n<ul><li>Ensure Windows 10 is updated to the latest version, this issue might be a bug with Windows and an update might solve the issue. To update Windows 10, go through the steps in <a href=\"https://support.microsoft.com/en-us/windows/update-windows-10-3c5ae7fc-9fb6-9af1-1984-b5e0412c556a\">this article</a> by Microsoft Support.\n</li><li>For more possible solutions, <a href=\"https://www.youtube.com/watch?v=1TVPZ2OZ29g\">please see this video.</a>\n</li></ul>",
  "text": "When installing Firefox for Windows 10, the error message, \"Can not create temp folder archive,\" is shown when 7-Zip tries to unpack the installation file but is not able to locate the Temp folder or it is not able to access it. This is how the error looks like: Running the Firefox installation file as an administrator or with an administrator account is a common fix for this problem and it can work for some users. In case if that does not work for you, this article will also be exploring the other possible solutions to help you solve this issue. Table of Contents 1 Running the installation file as administrator 2 Moving installation file to Desktop 3 Ensuring the Temp folder is in the correct directory 4 Other solutions Running the installation file as administrator Simply right-click on the installation file and select Run as administrator . This will give the file admin-level permissions for 7-Zip to create an archive in the Temp folder to proceed with the installation if it is having insufficient permissions to do so. Moving installation file to Desktop Before running the file, make sure it is saved in the same drive where Windows is installed. A simple way to ensure this is by moving the file to the Desktop and run it. If needed, right click and select Run as administrator . Ensuring the Temp folder is in the correct directory The Temp folder which the installation file is trying to access to unpack files for installation is usually located at: Users\\[username]\\AppData\\Local\\Temp To ensure the Temp folder is located in the correct directory, follow the steps below: Open up the start menu Search %appdata% and hit Enter Click on AppData on the top bar Go into the Local folder Check if the Temp folder exists in here, if it does not exist, create a new folder named Temp (make sure letter 'T' is capital) After that, you may perform the previous solutions again to see if they work this time. Other solutions Ensure Windows 10 is updated to the latest version, this issue might be a bug with Windows and an update might solve the issue. To update Windows 10, go through the steps in this article by Microsoft Support. For more possible solutions, please see this video.",
  "products": [
    "firefox"
  ],
  "topics": [
    "crashing-and-slow-performance",
    "error-codes",
    "installation-and-updates",
    "performance-and-connectivity"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3873,
    "text_bytes": 2200,
    "word_count": 384,
    "downloaded_at": "2025-08-26T10:54:18.110283"
  }
}