{
  "slug": "switching-devices",
  "title": "Back up and transfer your Firefox data to a new device",
  "summary": "Learn how to transfer your browser data when switching devices using Firefox Sync. Back up your bookmarks, history, passwords, etc. with your Mozilla account.",
  "url": "https://support.mozilla.org/en-US/kb/switching-devices",
  "html": "<p>Learn how to move, install or migrate Firefox to a new device. Once you enable your <a href=\"/en-US/kb/sync\">Firefox Sync backup</a>, whenever you change your phone or computer to a new device, you will be able to install Firefox without losing your data. Your bookmarks, browsing history, passwords, and open tabs will migrate with you securely. \n</p>\n<h1 id=\"w_backup-assistant\">Backup assistant</h1>\n<p></p><form-wizard id=\"switching-devices-wizard\" fxa-root=\"https://accounts.firefox.com\">\n  <sign-in-step name=\"sign-into-fxa\"></sign-in-step>\n  <configure-step name=\"configure-sync\"></configure-step>\n  <setup-device-step name=\"setup-new-device\"></setup-device-step>\n</form-wizard>\n<p></p>\n<h1 id=\"w_frequently-asked-questions\">Frequently asked questions</h1>\n<p></p><section class=\"mzp-c-details\">\n<p></p>\n<h2 id=\"w_how-can-i-back-up-my-data-later\">How can I back up my data later?</h2>\n<p>If you aren’t able to perform a data backup at this time, you can do it later from the Firefox menu. These are the steps you need to follow:\n</p>\n<ol><li>Click the menu <img alt=\"PhotonMenuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2017-09-28-11-58-03-e6a66b.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> button in the top right corner of the screen.\n</li><li>Click <span class=\"menu\">Help</span>.\n</li><li>Click <span class=\"menu\">Switching to a new device</span>.\n<dl><dt><img alt=\"switching_devices_button\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-05-24-10-09-28-a3e6bb.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"300\">\n</dt></dl>\n</li><li>Follow the steps in the setup assistant to back up your data.\n</li></ol>\n<h2 id=\"w_what-can-i-do-if-i-lost-my-password\">What can I do if I lost my password?</h2>\n<p>To access your backed-up Firefox data, you need to log in to the same Mozilla account you used on your old device. If you forgot your password, you’ll need to reset it using recovery keys. Resetting your password without <a href=\"/en-US/kb/reset-your-firefox-account-password-recovery-keys\">recovery keys</a> will wipe all your data for security reasons.\n</p>\n<h2 id=\"w_what-data-is-included-in-a-backup\">What data is included in a backup?</h2>\n<p>In this process, we back up the following data:\n</p>\n<ul><li>Bookmarks\n</li><li>History\n</li><li>Lists of open tabs\n</li><li>Passwords\n</li><li>Saved addresses\n</li><li><span class=\"for\" data-for=\"not fx122\">Saved credit cards</span><span class=\"for\" data-for=\"fx122\">Payment methods</span>\n</li><li>Installed add-ons\n</li><li>Selected settings\n</li></ul>\n<h2 id=\"w_can-i-choose-what-data-i-want-to-sync\">Can I choose what data I want to sync?</h2>\n<p>Yes, you can choose the data you want to sync in step 2 of the wizard, by clicking the <strong>browser settings</strong> link. You can also change this later by following the steps in <a href=\"/en-US/kb/how-do-i-choose-what-information-sync-firefox\">How do I choose what information to sync on Firefox?</a>\n</p>\n<h2 id=\"w_how-do-you-handle-my-data\">How do you handle my data?</h2>\n<p>When backing up your data, your history, passwords, addresses, and credit cards are included. However, we do not collect this information and it remains accessible to you alone. Here is a list of frequently asked questions regarding <a href=\"https://www.mozilla.org/privacy/faq/\">how we handle user data</a>.\n</p>\n<h2 id=\"w_can-i-back-up-my-data-without-a-mozilla-account\">Can I back up my data without a Mozilla account?</h2>\n<p>Yes. You can learn how to save your browser data without having to sign up for an account by checking out the steps in <a href=\"/en-US/kb/back-and-restore-information-firefox-profiles\">Back up and restore information in Firefox profiles</a>.\n</p><p></p></section>\n<p></p>",
  "text": "Learn how to move, install or migrate Firefox to a new device. Once you enable your Firefox Sync backup , whenever you change your phone or computer to a new device, you will be able to install Firefox without losing your data. Your bookmarks, browsing history, passwords, and open tabs will migrate with you securely. Backup assistant Frequently asked questions How can I back up my data later? If you aren’t able to perform a data backup at this time, you can do it later from the Firefox menu. These are the steps you need to follow: Click the menu button in the top right corner of the screen. Click Help . Click Switching to a new device . Follow the steps in the setup assistant to back up your data. What can I do if I lost my password? To access your backed-up Firefox data, you need to log in to the same Mozilla account you used on your old device. If you forgot your password, you’ll need to reset it using recovery keys. Resetting your password without recovery keys will wipe all your data for security reasons. What data is included in a backup? In this process, we back up the following data: Bookmarks History Lists of open tabs Passwords Saved addresses Saved credit cards Payment methods Installed add-ons Selected settings Can I choose what data I want to sync? Yes, you can choose the data you want to sync in step 2 of the wizard, by clicking the browser settings link. You can also change this later by following the steps in How do I choose what information to sync on Firefox? How do you handle my data? When backing up your data, your history, passwords, addresses, and credit cards are included. However, we do not collect this information and it remains accessible to you alone. Here is a list of frequently asked questions regarding how we handle user data . Can I back up my data without a Mozilla account? Yes. You can learn how to save your browser data without having to sign up for an account by checking out the steps in Back up and restore information in Firefox profiles .",
  "products": [
    "firefox"
  ],
  "topics": [
    "backup-data",
    "sync-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4025,
    "text_bytes": 2008,
    "word_count": 367,
    "downloaded_at": "2025-08-26T10:55:58.792941"
  }
}