{
  "slug": "sync-custom-preferences",
  "title": "Sync custom preferences",
  "summary": "Firefox Sync allows you to sync your preference settings across all your Firefox Desktop devices. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/sync-custom-preferences",
  "html": "<p></p><div class=\"warning\"><strong>Warning:</strong> These instructions are for experienced Firefox users. Changing settings in the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a> (<em>about:config</em>) can have serious effects on your browser’s stability, security and performance.\n<br><strong>Only proceed if you are comfortable with advanced settings and understand the potential impacts</strong>.</div>\nFirefox Sync allows you to <a href=\"/en-US/kb/how-do-i-choose-what-information-sync-firefox\">choose the types of data to sync</a> across devices. Please note that syncing Firefox preference settings is only supported in Firefox Desktop. We’ve chosen the list of preferences that can be synced so that the average user can sync those settings directly from the Firefox Desktop user interface (UI). Advanced users who want more control over which preferences are synced, however, will benefit the most from this article.\n<p></p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_preferences-that-firefox-will-sync\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Preferences that Firefox will sync</span></a></li><li class=\"toclevel-1\"><a href=\"#w_disable-sync-for-a-default-preference\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Disable sync for a default preference</span></a></li><li class=\"toclevel-1\"><a href=\"#w_sync-custom-preferences\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Sync custom preferences</span></a></li></ul></div>\n<h1 id=\"w_preferences-that-firefox-will-sync\">Preferences that Firefox will sync</h1>\n<p>Firefox whitelists the preferences that it will sync. Every preference that is synced appears in this whitelist. The whitelist itself is also stored in preferences, which includes every preference starting with <strong>services.sync.prefs.sync.</strong> (also known as a “control preference”). These preferences will only be synced if their control preferences have been set to <span class=\"pref\">true</span> in the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor for Firefox</a> (<em>about:config</em> page). For example, the <span class=\"pref\">browser.urlbar.suggest.history</span> preference will be synced only if the <span class=\"pref\">services.sync.prefs.sync.browser.urlbar.suggest.history</span> control preference has been set to <span class=\"pref\">true</span>.\n</p>\n<h1 id=\"w_disable-sync-for-a-default-preference\">Disable sync for a default preference</h1>\n<p>Firefox automatically creates a default whitelist, which is how it determines the default list of preferences to sync. If you don’t want to sync a default preference, you can change its control preference to <span class=\"pref\">false</span>. For example, if you set <span class=\"pref\">services.sync.prefs.sync.&lt;<em>some preference</em>&gt;</span> to <span class=\"pref\">false</span>, then its related preference won’t be synced.\n</p>\n<h1 id=\"w_sync-custom-preferences\">Sync custom preferences</h1>\n<p>For safety reasons, only preferences that already have a local control preference will be applied locally. For example, if you want to sync a new preference that isn’t in the default list, you will need to ensure the new control preference has been created on every device. Firefox Sync won’t automatically copy custom control preferences to new devices.\n</p><p>This can be an issue for users who have many custom preferences synced. When adding a new device, they will need to ensure all the custom control preferences are set up on the new device before those preferences are synced. \n</p><p>To assist setting up new devices, there’s another preference, <span class=\"pref\">services.sync.prefs.dangerously_allow_arbitrary</span>, which controls this behavior. If you set this preference to <span class=\"pref\">true</span>, then all preferences will be synced to the new device and not just those with an existing control preference. Therefore, users with many custom preferences can set the <span class=\"pref\">services.sync.prefs.dangerously_allow_arbitrary</span> preference to <span class=\"pref\">true</span>, perform the sync once, and then set this preference back to <span class=\"pref\">false</span>. This will cause all remote preferences to be applied.\n</p>",
  "text": "Warning: These instructions are for experienced Firefox users. Changing settings in the Configuration Editor ( about:config ) can have serious effects on your browser’s stability, security and performance. Only proceed if you are comfortable with advanced settings and understand the potential impacts . Firefox Sync allows you to choose the types of data to sync across devices. Please note that syncing Firefox preference settings is only supported in Firefox Desktop. We’ve chosen the list of preferences that can be synced so that the average user can sync those settings directly from the Firefox Desktop user interface (UI). Advanced users who want more control over which preferences are synced, however, will benefit the most from this article. Table of Contents 1 Preferences that Firefox will sync 2 Disable sync for a default preference 3 Sync custom preferences Preferences that Firefox will sync Firefox whitelists the preferences that it will sync. Every preference that is synced appears in this whitelist. The whitelist itself is also stored in preferences, which includes every preference starting with services.sync.prefs.sync. (also known as a “control preference”). These preferences will only be synced if their control preferences have been set to true in the Configuration Editor for Firefox ( about:config page). For example, the browser.urlbar.suggest.history preference will be synced only if the services.sync.prefs.sync.browser.urlbar.suggest.history control preference has been set to true . Disable sync for a default preference Firefox automatically creates a default whitelist, which is how it determines the default list of preferences to sync. If you don’t want to sync a default preference, you can change its control preference to false . For example, if you set services.sync.prefs.sync.< some preference > to false , then its related preference won’t be synced. Sync custom preferences For safety reasons, only preferences that already have a local control preference will be applied locally. For example, if you want to sync a new preference that isn’t in the default list, you will need to ensure the new control preference has been created on every device. Firefox Sync won’t automatically copy custom control preferences to new devices. This can be an issue for users who have many custom preferences synced. When adding a new device, they will need to ensure all the custom control preferences are set up on the new device before those preferences are synced. To assist setting up new devices, there’s another preference, services.sync.prefs.dangerously_allow_arbitrary , which controls this behavior. If you set this preference to true , then all preferences will be synced to the new device and not just those with an existing control preference. Therefore, users with many custom preferences can set the services.sync.prefs.dangerously_allow_arbitrary preference to true , perform the sync once, and then set this preference back to false . This will cause all remote preferences to be applied.",
  "products": [
    "firefox"
  ],
  "topics": [
    "advanced-and-experimental-features",
    "sync-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4274,
    "text_bytes": 3040,
    "word_count": 463,
    "downloaded_at": "2025-08-26T10:51:34.048923"
  }
}