{
  "slug": "sync",
  "title": "Sync Firefox data",
  "summary": "Learn what Sync is, how it works, what it lets you do and how to avoid data loss with Sync, Firefox and your Mozilla account.",
  "url": "https://support.mozilla.org/en-US/kb/sync",
  "html": "<p>Mozilla's Sync feature provides a secure method for users to synchronize their data across Mozilla applications using a Mozilla account. Currently exclusive to Firefox, Sync ensures your data is effortlessly shared and up-to-date.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_what-can-i-do-with-sync-in-firefox\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">What can I do with Sync in Firefox?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_examples-of-sync-at-work\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Examples of Sync at work</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_how-does-it-work\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How does it work?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-do-i-set-up-sync-in-firefox\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How do I set up Sync in Firefox?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_is-it-secure\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Is it secure?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_can-i-control-what-gets-synced\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Can I control what gets synced?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-if-i-dont-want-to-sync\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">What if I don't want to sync?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_when-does-my-data-get-deleted\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">When does my data get deleted?</span></a></li><li class=\"toclevel-1\"><a href=\"#w_what-if-my-data-gets-lost\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">What if my data gets lost?</span></a></li></ul></div>\n<h1 id=\"w_what-can-i-do-with-sync-in-firefox\">What can I do with Sync in Firefox?</h1>\n<p>Unlock seamless browsing across multiple Firefox instances with Sync, a feature that ensures your <a href=\"/en-US/kb/how-do-i-choose-what-information-sync-firefox\">bookmarks, logins and passwords, addresses, credit cards, extensions and important settings</a> are consistent and accessible across all your devices. Moreover, Sync enables each Firefox to show which tabs are open on your other devices, allowing for effortless navigation and access.\n</p>\n<h2 id=\"w_examples-of-sync-at-work\">Examples of Sync at work</h2>\n<p>Imagine you're signed in to your Mozilla account on Firefox, both on a desktop and a mobile device. With Sync, you gain the ability to:\n</p>\n<ul><li>Revisit a website from your desktop browsing session directly on your mobile Firefox.\n</li><li>Access bookmarks on any device, seamlessly picking up where you left off, regardless of the device used to create them.\n</li><li>Keep all personal information (like logins, passwords, credit card details and addresses) synchronized across devices, with Firefox's autofill feature ready to assist you.\n</li><li>Maintain consistency with your Firefox extensions across desktop devices, streamlining your browsing experience.\n</li><li>View and open tabs from your desktop on your mobile device, making it easy to switch between devices without losing your place.\n</li><li>View and close tabs on one device from another device.\n</li><li>Instantly send tabs from one device to another (though this feature is available by simply being signed in to your Mozilla account, independent of Sync).\n</li><li>Get suggested results in your address bar based on bookmarks and history from all of your connected devices.\n</li></ul>\n<p>Through Sync, Firefox not only enhances your online experience but also ensures your digital life is interconnected and effortlessly managed across platforms.\n</p>\n<h1 id=\"w_how-does-it-work\">How does it work?</h1>\n<p>Sync operates by storing a combined version of your data on a remote server, which then synchronizes with the local Firefox copy across all your signed-in instances (referred to as <a href=\"/en-US/kb/fxa-managing-devices\">connected devices</a> linked through your <a href=\"/en-US/kb/access-mozilla-services-firefox-account\">Mozilla account</a>).\n</p><p>Generating <a href=\"/en-US/kb/reset-your-firefox-account-password-recovery-keys\">account recovery keys</a> is crucial for account and data retrieval. While prompted during the initial setup, you can also create these keys later via your account settings.\n</p>\n<h1 id=\"w_how-do-i-set-up-sync-in-firefox\">How do I set up Sync in Firefox?</h1>\n<p>For details on how to set up Sync in Firefox, see <a href=\"/en-US/kb/how-do-i-set-sync-my-computer\">Setting up Sync</a>.\n</p>\n<h1 id=\"w_is-it-secure\">Is it secure?</h1>\n<p>Securing your data with Sync involves creating a unique password, which plays a crucial role in encrypting your data for complete privacy. This encryption is end-to-end: your data is encrypted before it ever leaves your browser and can only be decrypted by another instance of Firefox. Once your data reaches a Mozilla-operated server for storage, it's already in an encrypted state, ensuring that not even Mozilla can access or decrypt this information. For those interested in transparency and security, our code is <a href=\"https://firefox-source-docs.mozilla.org/contributing/\">openly available for review</a>. You're welcome to verify our encryption process and the security measures we uphold for yourself.\n</p><p>For details on how Sync works to keep your data safe, also see <a href=\"/en-US/kb/how-firefox-sync-keeps-your-data-safe-even-if-tls-fails\">How Firefox Sync keeps your data safe even if TLS fails</a>.\n</p>\n<h1 id=\"w_can-i-control-what-gets-synced\">Can I control what gets synced?</h1>\n<p>Firefox gives you control over your data by letting you decide exactly which information types you'd like to sync across all your Firefox instances. This way, you maintain control over what's shared and where.\n</p>\n<ul><li>Open tabs\n</li><li>Browsing history\n</li><li>Bookmarks\n</li><li>Logins and passwords\n</li><li>Addresses\n</li><li>Credit card information\n</li><li>Web Extensions\n</li><li>Browser settings\n</li></ul>\n<p>Adjusting these preferences in any version of Firefox will update your experience across all devices you're signed in to. However, note that Web Extensions and Settings are currently only synchronized between desktop versions of Firefox.\n</p><p>For details on how to control what gets synced on your Firefox, see <a href=\"/en-US/kb/how-do-i-choose-what-information-sync-firefox\">How do I choose what information to sync on Firefox?</a>\n</p>\n<h1 id=\"w_what-if-i-dont-want-to-sync\">What if I don't want to sync?</h1>\n<p>Sync is operational only when you're signed in to your Mozilla account in Firefox and have selected at least one data type for syncing. If you decide to uncheck all categories, you'll still stay signed in to your account, but no data will be synced and any previous synced data will be deleted from Mozilla's servers. Signing out of your Mozilla account disconnects Firefox from your account and ceases all syncing activities from that Firefox, underlining the necessity of being signed in for Sync to work.\n</p><p>For details on how to turn off Sync, see <a href=\"/en-US/kb/disable-firefox-sync\">Disable Firefox Sync</a>.\n</p>\n<h1 id=\"w_when-does-my-data-get-deleted\">When does my data get deleted?</h1>\n<p>Data is stored associated to your account. Signing out of your account does not cause your data to be deleted from Mozilla's servers; it stays there so you can access it with other devices.\n</p><p>Your data gets deleted only in three situations:\n</p>\n<ol><li> when you delete your account\n</li><li> when you reset your account password without recovery keys\n</li><li> when you tell us you want to stop syncing something (or everything)\n</li></ol>\n<p>If you delete your account or reset your account password without using recovery keys, we delete your data as a security measure.\n</p><p>If you uncheck a data type in Sync's settings, it will be deleted from our servers. If you uncheck <em>all</em> data types in Sync's settings, we will delete all of your synced data from our servers.\n</p>\n<div class=\"note\"><strong>Note:</strong> In all of these situations, deleting data on the server does not delete it from your devices. Any data that your local devices have from previously using your account and Sync will remain on that device.</div>\n<h1 id=\"w_what-if-my-data-gets-lost\">What if my data gets lost?</h1>\n<div class=\"warning\"><strong>Warning:</strong> By design, resetting your password results in the deletion of any data stored on the remote server, unless you have <a href=\"/en-US/kb/avoid-getting-locked-out-your-mozilla-account\">recovery keys</a> in place.</div>\n<p>When you sign out of your Mozilla account, you're presented with the option to delete all local data. Opting for this action erases your local data upon sign out.\n</p><p>Consequently, if you're using Sync on just one device without recovery keys, signing out of your Mozilla account and deleting local data could potentially lead to data loss.\n</p><p>Fortunately, safeguarding your data is straightforward and doesn't require much effort. Check out the links below for details:\n</p>\n<ul><li> <a href=\"/en-US/kb/how-do-i-set-sync-my-computer\">How to connect additional devices to Sync</a>\n</li><li> <a href=\"/en-US/kb/switching-devices\">Back up and transfer your Firefox data to a new device</a>\n</li><li> <a href=\"/en-US/kb/reset-your-firefox-account-password-recovery-keys\">Reset your Mozilla account password with Recovery Keys</a>\n</li><li> <a href=\"/en-US/kb/ive-lost-my-firefox-sync-account-information\">I've lost my Firefox Sync account information - What to do</a>\n</li><li> <a href=\"/en-US/kb/how-reset-your-password-without-account-recovery-keys-access-data\">How to reset your password without Account Recovery Keys and regain access to your data</a>\n</li></ul>",
  "text": "Mozilla's Sync feature provides a secure method for users to synchronize their data across Mozilla applications using a Mozilla account. Currently exclusive to Firefox, Sync ensures your data is effortlessly shared and up-to-date. Table of Contents 1 What can I do with Sync in Firefox? 1.1 Examples of Sync at work 2 How does it work? 3 How do I set up Sync in Firefox? 4 Is it secure? 5 Can I control what gets synced? 6 What if I don't want to sync? 7 When does my data get deleted? 8 What if my data gets lost? What can I do with Sync in Firefox? Unlock seamless browsing across multiple Firefox instances with Sync, a feature that ensures your bookmarks, logins and passwords, addresses, credit cards, extensions and important settings are consistent and accessible across all your devices. Moreover, Sync enables each Firefox to show which tabs are open on your other devices, allowing for effortless navigation and access. Examples of Sync at work Imagine you're signed in to your Mozilla account on Firefox, both on a desktop and a mobile device. With Sync, you gain the ability to: Revisit a website from your desktop browsing session directly on your mobile Firefox. Access bookmarks on any device, seamlessly picking up where you left off, regardless of the device used to create them. Keep all personal information (like logins, passwords, credit card details and addresses) synchronized across devices, with Firefox's autofill feature ready to assist you. Maintain consistency with your Firefox extensions across desktop devices, streamlining your browsing experience. View and open tabs from your desktop on your mobile device, making it easy to switch between devices without losing your place. View and close tabs on one device from another device. Instantly send tabs from one device to another (though this feature is available by simply being signed in to your Mozilla account, independent of Sync). Get suggested results in your address bar based on bookmarks and history from all of your connected devices. Through Sync, Firefox not only enhances your online experience but also ensures your digital life is interconnected and effortlessly managed across platforms. How does it work? Sync operates by storing a combined version of your data on a remote server, which then synchronizes with the local Firefox copy across all your signed-in instances (referred to as connected devices linked through your Mozilla account ). Generating account recovery keys is crucial for account and data retrieval. While prompted during the initial setup, you can also create these keys later via your account settings. How do I set up Sync in Firefox? For details on how to set up Sync in Firefox, see Setting up Sync . Is it secure? Securing your data with Sync involves creating a unique password, which plays a crucial role in encrypting your data for complete privacy. This encryption is end-to-end: your data is encrypted before it ever leaves your browser and can only be decrypted by another instance of Firefox. Once your data reaches a Mozilla-operated server for storage, it's already in an encrypted state, ensuring that not even Mozilla can access or decrypt this information. For those interested in transparency and security, our code is openly available for review . You're welcome to verify our encryption process and the security measures we uphold for yourself. For details on how Sync works to keep your data safe, also see How Firefox Sync keeps your data safe even if TLS fails . Can I control what gets synced? Firefox gives you control over your data by letting you decide exactly which information types you'd like to sync across all your Firefox instances. This way, you maintain control over what's shared and where. Open tabs Browsing history Bookmarks Logins and passwords Addresses Credit card information Web Extensions Browser settings Adjusting these preferences in any version of Firefox will update your experience across all devices you're signed in to. However, note that Web Extensions and Settings are currently only synchronized between desktop versions of Firefox. For details on how to control what gets synced on your Firefox, see How do I choose what information to sync on Firefox? What if I don't want to sync? Sync is operational only when you're signed in to your Mozilla account in Firefox and have selected at least one data type for syncing. If you decide to uncheck all categories, you'll still stay signed in to your account, but no data will be synced and any previous synced data will be deleted from Mozilla's servers. Signing out of your Mozilla account disconnects Firefox from your account and ceases all syncing activities from that Firefox, underlining the necessity of being signed in for Sync to work. For details on how to turn off Sync, see Disable Firefox Sync . When does my data get deleted? Data is stored associated to your account. Signing out of your account does not cause your data to be deleted from Mozilla's servers; it stays there so you can access it with other devices. Your data gets deleted only in three situations: when you delete your account when you reset your account password without recovery keys when you tell us you want to stop syncing something (or everything) If you delete your account or reset your account password without using recovery keys, we delete your data as a security measure. If you uncheck a data type in Sync's settings, it will be deleted from our servers. If you uncheck all data types in Sync's settings, we will delete all of your synced data from our servers. Note: In all of these situations, deleting data on the server does not delete it from your devices. Any data that your local devices have from previously using your account and Sync will remain on that device. What if my data gets lost? Warning: By design, resetting your password results in the deletion of any data stored on the remote server, unless you have recovery keys in place. When you sign out of your Mozilla account, you're presented with the option to delete all local data. Opting for this action erases your local data upon sign out. Consequently, if you're using Sync on just one device without recovery keys, signing out of your Mozilla account and deleting local data could potentially lead to data loss. Fortunately, safeguarding your data is straightforward and doesn't require much effort. Check out the links below for details: How to connect additional devices to Sync Back up and transfer your Firefox data to a new device Reset your Mozilla account password with Recovery Keys I've lost my Firefox Sync account information - What to do How to reset your password without Account Recovery Keys and regain access to your data",
  "products": [
    "firefox",
    "mobile",
    "ios"
  ],
  "topics": [
    "backup-data",
    "sync-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 9811,
    "text_bytes": 6728,
    "word_count": 1126,
    "downloaded_at": "2025-08-26T10:56:41.463982"
  }
}