{
  "slug": "tab-groups",
  "title": "Tab groups",
  "summary": "How to use tab groups to organize your tabs in Firefox version 137 and above.",
  "url": "https://support.mozilla.org/en-US/kb/tab-groups",
  "html": "<p>Starting in <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 137, a new <em>Tab groups</em> feature that allows you to manage open tabs by grouping them together and labelling them was introduced in a progressive rollout. As of May 6, 2025, this feature should be available to all Firefox users.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_create-a-tab-group\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Create a tab group</span></a></li><li class=\"toclevel-1\"><a href=\"#w_add-a-tab-to-a-tab-group\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Add a tab to a tab group</span></a></li><li class=\"toclevel-1\"><a href=\"#w_remove-a-tab-from-a-group\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Remove a tab from a group</span></a></li><li class=\"toclevel-1\"><a href=\"#w_move-a-tab-from-one-group-to-another\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Move a tab from one group to another</span></a></li><li class=\"toclevel-1\"><a href=\"#w_manage-a-tab-group\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Manage a tab group</span></a></li><li class=\"toclevel-1\"><a href=\"#w_tab-issues\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Tab issues</span></a></li></ul></div>\n<h1 id=\"w_create-a-tab-group\">Create a tab group</h1>\n<dl><dt><img alt=\"Tab group example\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-04-30-10-28-51-0920f2.gif\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> \n</dt></dl>\n<ol><li>Select a tab from your tab bar (either vertical or horizontal).\n</li><li>Drag the tab onto another tab, wait until you see a highlighted area and then release the tab.\n</li><li>You will then have the option to name the group and choose a color. These can be changed at any time.\n</li></ol>\n<p><img alt=\"Tab group colors\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-04-30-10-36-04-197d0d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> \n</p><p>The tab bar will show the group with its label and tabs together, underlined by the group color, or edged with a color line if you use <a href=\"/en-US/kb/use-sidebar-access-tools-and-vertical-tabs\">vertical tabs</a>. You can select the group label to collapse the tabs into the tab group, or select it again to expand the group to see the tabs within it.\n</p>\n<h1 id=\"w_add-a-tab-to-a-tab-group\">Add a tab to a tab group</h1>\n<p><strong>If you have no tab groups yet:</strong> <span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Control</span> key while you click</span>\n a tab and select <span class=\"menu\">Add Tab to New Group</span>. You will see a panel where you can name the group and choose a color. For now, the group will have that tab only.\n</p><p><strong>If you already have groups:</strong> <span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Control</span> key while you click</span>\n a tab and select <span class=\"menu\">Add Tab to Group</span> to see the options. Select either <span class=\"menu\">New Group</span> to create a new group or choose an existing group. You can also just drag a tab into an expanded group on the tab bar.\n</p>\n<h1 id=\"w_remove-a-tab-from-a-group\">Remove a tab from a group</h1>\n<p><span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Control</span> key while you click</span>\n a tab in a group and select <span class=\"menu\">Remove from Group</span>. You can also select the tab you want to remove from the group and drag it out from the group to a different position on the tab bar.\n</p><p>When you remove all tabs from a group, the tab group is deleted. \n</p>\n<h1 id=\"w_move-a-tab-from-one-group-to-another\">Move a tab from one group to another</h1>\n<p><span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Control</span> key while you click</span>\n a tab, select <span class=\"menu\">Add Tab to Group</span> and select another existing group. You can also just drag a tab into another expanded group on the tab bar.\n</p>\n<h1 id=\"w_manage-a-tab-group\">Manage a tab group</h1>\n<p><span class=\"for\" data-for=\"win,linux\">Right-click</span><span class=\"for\" data-for=\"mac\">Hold down the <span class=\"key\">Control</span> key while you click</span>\n a group label to see the options for that tab group:\n</p>\n<ul><li>You can change the name and the color for the tab group.\n</li><li><span class=\"menu\">New tab in group</span> will add a new tab to the selected group.\n</li><li><span class=\"menu\">Move group to new window</span> will open that group in a new Firefox window.\n</li><li>You can <span class=\"menu\">Save and close group</span>, which will save and close the group for you to be able to re-open from the <em>List all tabs</em> <img alt=\"tab icon 2\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-06-25-13-37-26-16c7e5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"20\"> icon on the tab bar (or the <img alt=\"Fx137ListAllTabs\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-03-16-07-06-30-fdad7d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"20\"> toolbar icon, if you use vertical tabs).\n<dl><dt>This icon can be removed if you wish; <a href=\"/en-US/kb/customize-firefox-controls-buttons-and-toolbars\">this support article</a> will help.\n</dt></dl>\n</li><li><span class=\"menu\">Ungroup tabs</span> will keep the tabs open, but no longer grouped.\n</li><li><span class=\"menu\">Delete group</span> will delete the group. All tabs from the group will be closed.\n</li></ul>\n<h1 id=\"w_tab-issues\">Tab issues</h1>\n<ul><li>Tab groups created when using <a href=\"/en-US/kb/private-browsing-use-firefox-without-history\">Private Browsing</a> will be deleted when you close the Private Browsing window.\n</li><li>If your tabs become unexpectedly grouped or ungrouped, it may be due to a compatibility issue with a tab <a href=\"/en-US/kb/find-and-install-add-ons-add-features-to-firefox#w_what-types-of-add-ons-can-i-install\">extension</a>.\n</li></ul>",
  "text": "Starting in Firefox version 137, a new Tab groups feature that allows you to manage open tabs by grouping them together and labelling them was introduced in a progressive rollout. As of May 6, 2025, this feature should be available to all Firefox users. Table of Contents 1 Create a tab group 2 Add a tab to a tab group 3 Remove a tab from a group 4 Move a tab from one group to another 5 Manage a tab group 6 Tab issues Create a tab group Select a tab from your tab bar (either vertical or horizontal). Drag the tab onto another tab, wait until you see a highlighted area and then release the tab. You will then have the option to name the group and choose a color. These can be changed at any time. The tab bar will show the group with its label and tabs together, underlined by the group color, or edged with a color line if you use vertical tabs . You can select the group label to collapse the tabs into the tab group, or select it again to expand the group to see the tabs within it. Add a tab to a tab group If you have no tab groups yet: Right-click Hold down the Control key while you click a tab and select Add Tab to New Group . You will see a panel where you can name the group and choose a color. For now, the group will have that tab only. If you already have groups: Right-click Hold down the Control key while you click a tab and select Add Tab to Group to see the options. Select either New Group to create a new group or choose an existing group. You can also just drag a tab into an expanded group on the tab bar. Remove a tab from a group Right-click Hold down the Control key while you click a tab in a group and select Remove from Group . You can also select the tab you want to remove from the group and drag it out from the group to a different position on the tab bar. When you remove all tabs from a group, the tab group is deleted. Move a tab from one group to another Right-click Hold down the Control key while you click a tab, select Add Tab to Group and select another existing group. You can also just drag a tab into another expanded group on the tab bar. Manage a tab group Right-click Hold down the Control key while you click a group label to see the options for that tab group: You can change the name and the color for the tab group. New tab in group will add a new tab to the selected group. Move group to new window will open that group in a new Firefox window. You can Save and close group , which will save and close the group for you to be able to re-open from the List all tabs icon on the tab bar (or the toolbar icon, if you use vertical tabs). This icon can be removed if you wish; this support article will help. Ungroup tabs will keep the tabs open, but no longer grouped. Delete group will delete the group. All tabs from the group will be closed. Tab issues Tab groups created when using Private Browsing will be deleted when you close the Private Browsing window. If your tabs become unexpectedly grouped or ungrouped, it may be due to a compatibility issue with a tab extension .",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse",
    "tabs"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 6763,
    "text_bytes": 3032,
    "word_count": 600,
    "downloaded_at": "2025-08-26T10:59:39.713784"
  }
}