{
  "slug": "tab-preferences-and-settings",
  "title": "Tab preferences and settings",
  "summary": "Learn how to customize tab settings in Firefox to enhance your browsing experience.",
  "url": "https://support.mozilla.org/en-US/kb/tab-preferences-and-settings",
  "html": "<p>Tabs are an essential part of your browsing experience in Firefox, allowing you to keep multiple websites open in a single window. Firefox provides several options to customize how tabs work to suit your preferences. This article will guide you through these settings.\n</p>\n<h1 id=\"w_review-and-change-tab-settings\">Review and change tab settings</h1>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Select the <span class=\"menu\">General</span> panel and go to the <strong>Tabs</strong> section.\n</li></ol>\n<dl><dt><span class=\"for\" data-for=\"fx129\"><span class=\"for\" data-for=\"not win\"><img alt=\"Tab settings simplified\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-09-02-05-33-57-72082f.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"win\"><img alt=\"Fx129TabSettings-win\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-09-02-12-39-16-eb2f19.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span></span><span class=\"for\" data-for=\"not fx129\"><span class=\"for\" data-for=\"mac\"><img alt=\"Confirm_MactabModal\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-09-01-09-22-07-3ecc05.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"linux\"><img alt=\"Confirm_LinuxtabModal\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-09-01-14-20-54-01d59f.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"win\"><img alt=\"Fx94settingsTabs-Win\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-10-07-09-35-39-eb7cea.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span></span>\n</dt></dl>\n<ul><li><strong>Ctrl+Tab cycles through tabs in recently used order:</strong> Select this setting if you want to use the <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Ctrl</span> + <span class=\"key\">Tab</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Control</span> + <span class=\"key\">Tab</span></span> keyboard shortcut to switch through open tabs in the order you viewed them rather than in the order they appear in the Firefox window.<div class=\"note\"><strong>Note:</strong> If you want to use <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Ctrl</span> + <span class=\"key\">Tab</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Control</span> + <span class=\"key\">Tab</span></span> to switch to the tab next to the current tab and <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Ctrl</span> + <span class=\"key\">Shift</span> + <span class=\"key\">Tab</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Control</span> + <span class=\"key\">Shift</span> + <span class=\"key\">Tab</span></span> to switch to the previous tab, deselect this setting (clear the checkbox).</div>\n</li><li><strong>Open links in tabs instead of new windows:</strong> This setting controls whether links from other applications or from web pages which request to open them in new windows are opened in a new window or a new tab in the most recent window.<div class=\"note\"><strong>Note:</strong> If you have chosen to open pages in new tabs, Firefox will ignore this <span class=\"for\" data-for=\"win\">option</span><span class=\"for\" data-for=\"mac,linux\">preference</span> and will open a new window from a link if the page author specified that the new window should have a specific size, because some pages can only be displayed correctly at a specific size.</div>\n</li><li><strong>When you open a link, image or media in a new tab, switch to it immediately:</strong> When you middle-click on a Web link (or hold down <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Ctrl</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Command</span></span> while clicking with the left mouse button), the page will be opened in a new tab. That new tab will be in the background (the selected tab will not change). The same thing happens when opening a web link, image or video in a new tab using the context menu. Check this setting to load and display the page in a new foreground tab instead.\n</li><li><strong>Confirm before closing multiple tabs:</strong> Select this setting to enable a warning dialog to confirm your choice to close a window with multiple tabs (shown below) to prevent accidentally closing the entire window when you only intend to close the current tab. To learn more, see <a href=\"/en-US/kb/how-configure-close-tab-warnings-firefox\">How to configure Close Tab warnings in Firefox</a>.\n</li></ul>\n<dl><dt><img alt=\"fx89-warn-on-close\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-08-25-16-40-56-5c8a1b.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div class=\"for\" data-for=\"mac\">\n<ul><li><strong>Confirm before quitting with ⌘Q:</strong> On macOS, you can also exit Firefox using the <span class=\"key\">Command ⌘</span> + <span class=\"key\">Q</span> keyboard shortcut. If you want to disable close multiple tabs warnings for when you use this shortcut, uncheck this setting.\n</li></ul>\n</div><div class=\"for\" data-for=\"linux\">\n<ul><li><strong>Confirm before quitting with Ctrl+Q:</strong> On Linux, you can also exit Firefox using the <span class=\"key\">Ctrl</span> + <span class=\"key\">Q</span> keyboard shortcut. Deselect this setting if you want to disable close multiple tabs warnings when you use this shortcut.\n</li></ul>\n</div>\n<ul><li><em>(If applicable)</em> <strong>Warn you when opening multiple tabs might slow down Firefox:</strong> This setting is only shown if you disabled the warning dialog Firefox displays to confirm your choice to open multiple tabs at once (shown below). Check this setting to re-enable the warning, to prevent accidentally slowing down Firefox while loading a large number of tabs.\n</li></ul>\n<dl><dt><img alt=\"fx89-warn-on-open\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-08-25-16-29-14-53af4e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<div class=\"for\" data-for=\"win\">\n<ul><li> <strong>Show tab previews in the Windows taskbar:</strong> When you move your pointer over the Firefox icon in the Windows taskbar, Windows will show you a preview of the Firefox window. With this option check marked, Windows will show you a separate preview for each tab.\n</li></ul>\n</div><div class=\"for\" data-for=\"fx129\">\n<ul><li><strong>Show an image preview when you hover on a tab:</strong> When you move your pointer over a tab, Firefox will show a thumbnail preview image. To disable the preview images, uncheck this setting.\n</li></ul>\n<dl><dt><img alt=\"tab hover over preview\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-09-02-05-49-52-ef69d9.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"500\"> \n</dt></dl>\n</div>\n<h1 id=\"w_related-articles\">Related articles</h1>\n<ul><li><a href=\"/en-US/kb/tabs-organize-websites-single-window\">Use tabs to organize lots of websites in a single window</a> \n</li><li><a href=\"/en-US/kb/tab-overview-menu\">Tab overview menu</a> \n</li><li><a href=\"/en-US/kb/tab-context-menu\">Tab context menu</a>\n</li></ul>",
  "text": "Tabs are an essential part of your browsing experience in Firefox, allowing you to keep multiple websites open in a single window. Firefox provides several options to customize how tabs work to suit your preferences. This article will guide you through these settings. Review and change tab settings In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select the General panel and go to the Tabs section. Ctrl+Tab cycles through tabs in recently used order: Select this setting if you want to use the Ctrl + Tab Control + Tab keyboard shortcut to switch through open tabs in the order you viewed them rather than in the order they appear in the Firefox window. Note: If you want to use Ctrl + Tab Control + Tab to switch to the tab next to the current tab and Ctrl + Shift + Tab Control + Shift + Tab to switch to the previous tab, deselect this setting (clear the checkbox). Open links in tabs instead of new windows: This setting controls whether links from other applications or from web pages which request to open them in new windows are opened in a new window or a new tab in the most recent window. Note: If you have chosen to open pages in new tabs, Firefox will ignore this option preference and will open a new window from a link if the page author specified that the new window should have a specific size, because some pages can only be displayed correctly at a specific size. When you open a link, image or media in a new tab, switch to it immediately: When you middle-click on a Web link (or hold down Ctrl Command while clicking with the left mouse button), the page will be opened in a new tab. That new tab will be in the background (the selected tab will not change). The same thing happens when opening a web link, image or video in a new tab using the context menu. Check this setting to load and display the page in a new foreground tab instead. Confirm before closing multiple tabs: Select this setting to enable a warning dialog to confirm your choice to close a window with multiple tabs (shown below) to prevent accidentally closing the entire window when you only intend to close the current tab. To learn more, see How to configure Close Tab warnings in Firefox . Confirm before quitting with ⌘Q: On macOS, you can also exit Firefox using the Command ⌘ + Q keyboard shortcut. If you want to disable close multiple tabs warnings for when you use this shortcut, uncheck this setting. Confirm before quitting with Ctrl+Q: On Linux, you can also exit Firefox using the Ctrl + Q keyboard shortcut. Deselect this setting if you want to disable close multiple tabs warnings when you use this shortcut. (If applicable) Warn you when opening multiple tabs might slow down Firefox: This setting is only shown if you disabled the warning dialog Firefox displays to confirm your choice to open multiple tabs at once (shown below). Check this setting to re-enable the warning, to prevent accidentally slowing down Firefox while loading a large number of tabs. Show tab previews in the Windows taskbar: When you move your pointer over the Firefox icon in the Windows taskbar, Windows will show you a preview of the Firefox window. With this option check marked, Windows will show you a separate preview for each tab. Show an image preview when you hover on a tab: When you move your pointer over a tab, Firefox will show a thumbnail preview image. To disable the preview images, uncheck this setting. Related articles Use tabs to organize lots of websites in a single window Tab overview menu Tab context menu",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse",
    "settings",
    "tabs"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 8846,
    "text_bytes": 3645,
    "word_count": 653,
    "downloaded_at": "2025-08-26T10:34:24.604071"
  }
}