{
  "slug": "third-party-cookies-firefox-tracking-protection",
  "title": "Third-party cookies and Firefox tracking protection",
  "summary": "Some advertisers use third-party (cross-site) cookies to track your visits to the various websites on which they advertise. Learn more.",
  "url": "https://support.mozilla.org/en-US/kb/third-party-cookies-firefox-tracking-protection",
  "html": "<p>Third-party cookies, also known as cross-site cookies, are <a href=\"/en-US/kb/cookies-information-websites-store-on-your-computer\">cookies</a> set by a website other than the one you are currently on. For example, cnn.com might have a Facebook like button on their site. The like button will set a cookie that can be read by Facebook. That would be considered a third-party (cross-site) cookie. Some advertisers use these types of cookies to track your visits to the various websites on which they advertise. This is called <a href=\"/en-US/kb/third-party-trackers\">cross-site tracking</a>.\n</p>\n<div class=\"note\"><strong>Note:</strong><span class=\"for\" data-for=\"not fx132\">Cross-site tracking cookies are now disabled by default for all Firefox users. See <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a> for more information about how Firefox protects you against tracking.</span><span class=\"for\" data-for=\"fx132\"> Cross-site tracking cookies are now disabled by default for all Firefox users. Enhanced Tracking Protection Strict mode now disables all cross-site cookies. See <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a> for more information about how Firefox protects you against tracking.</span></div>\n<p>When third-party cookies are disabled, it can stop some, but not all types of tracking. If you are concerned about tracking, see also:\n</p><div class=\"for\" data-for=\"not fx135\">\n<ul><li><a href=\"/en-US/kb/how-do-i-turn-do-not-track-feature\">How do I turn on the Do Not Track feature?</a>\n</li></ul>\n</div>\n<ul><li><a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection in Firefox for desktop</a>\n</li><li><a href=\"/en-US/kb/trackers-and-scripts-firefox-blocks-enhanced-track\">Trackers and scripts Firefox blocks in Enhanced Tracking Protection</a>\n</li></ul>\n<h1 id=\"w_disable-third-party-cookies\">Disable third-party cookies</h1>\n<p>To block cross-site trackers or all third-party (cross-site) cookies:\n</p>\n<ol><li><span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li>Select the <span class=\"menu\">Privacy &amp; Security</span> panel.\n</li><li>Under <em><a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a></em>, select the <strong>Custom</strong> radio button.\n</li><li>Check <strong>Cookies</strong> and use the drop-down menu to select the types of cookies you wish to block.\n<dl><dt><img alt=\"Fx111settings-ETPcustom\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-03-18-12-14-24-e725a5.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt><dt>To block all third-party cookies, select <em>All cross-site cookies (may cause websites to break)</em> from the drop-down.\n</dt><dt><div class=\"for\" data-for=\"fx132\"><div class=\"note\"><strong>Note:</strong> Firefox also blocks third-party cookies in <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop#w_strict-enhanced-tracking-protection\">ETP Strict mode</a>. This differs from blocking all third-party cookies through the custom cookie blocking settings in technical details. For more information, see <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Storage_Access_API\">Storage AccessAPI</a> on <em>MDN Web Docs</em>.</div></div>\n</dt></dl>\n</li><li>Select the <img alt=\"reload all tabs retina\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2019-09-13-11-05-25-37ec1e.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"150\"> button (shown when multiple tabs are open) to apply your new setting.\n<dl><dt><div class=\"note\"><strong>Note:</strong> Firefox also includes <a href=\"/en-US/kb/introducing-total-cookie-protection-standard-mode\">Total Cookie Protection</a>, which creates a “cookie jar” for every website. This feature keeps cookies in the site where they were created so that they can't track you across websites. Total Cookie protection is enabled when the <em>Cross-site tracking cookies, and isolate other cross-site cookies</em> setting is selected.</div>\n</dt></dl>\n</li></ol>\n<h1 id=\"w_enable-third-party-cookies-for-specific-sites\">Enable third-party cookies for specific sites</h1>\n<p>Some websites may not work properly when third-party (cross-site) cookies are blocked. To turn off <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a> for a specific website:\n</p>\n<ol><li>Visit the website.\n</li><li>At the left of the address bar, click the shield icon <img alt=\"Fx89ShieldIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-05-12-06-f2679d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"30\">.\n</li><li>At the top of the panel, toggle off the Enhanced Tracking Protection switch <img alt=\"Fx91ETPbluetoggle\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-03-16-12-56-21-3859dc.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"40\">. This will disable Enhanced Tracking Protection for the site, causing the page to automatically reload and enable trackers.\n<dl><dt><span class=\"for\" data-for=\"not fx138\"><img alt=\"Protection panel\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-02-20-06-58-36-8c3fa8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"400\"></span><span class=\"for\" data-for=\"fx138\"><img alt=\"Fx138ProtectionPanelOff\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-05-13-03-19-08-3f5858.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</dt></dl>\n</li></ol>\n<p>Follow the same process to turn Enhanced Tracking Protection back on.\n</p><p>If the issue persists, consider reporting it by submitting a <em>Broken Site Report</em>. This allows the Webcompat team to examine the problem. For more information, see <a href=\"/en-US/kb/report-breakage-due-blocking\">How do I report a broken site in Firefox desktop?</a>\n</p>",
  "text": "Third-party cookies, also known as cross-site cookies, are cookies set by a website other than the one you are currently on. For example, cnn.com might have a Facebook like button on their site. The like button will set a cookie that can be read by Facebook. That would be considered a third-party (cross-site) cookie. Some advertisers use these types of cookies to track your visits to the various websites on which they advertise. This is called cross-site tracking . Note: Cross-site tracking cookies are now disabled by default for all Firefox users. See Enhanced Tracking Protection for more information about how Firefox protects you against tracking. Cross-site tracking cookies are now disabled by default for all Firefox users. Enhanced Tracking Protection Strict mode now disables all cross-site cookies. See Enhanced Tracking Protection for more information about how Firefox protects you against tracking. When third-party cookies are disabled, it can stop some, but not all types of tracking. If you are concerned about tracking, see also: How do I turn on the Do Not Track feature? Enhanced Tracking Protection in Firefox for desktop Trackers and scripts Firefox blocks in Enhanced Tracking Protection Disable third-party cookies To block cross-site trackers or all third-party (cross-site) cookies: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select the Privacy & Security panel. Under Enhanced Tracking Protection , select the Custom radio button. Check Cookies and use the drop-down menu to select the types of cookies you wish to block. To block all third-party cookies, select All cross-site cookies (may cause websites to break) from the drop-down. Note: Firefox also blocks third-party cookies in ETP Strict mode . This differs from blocking all third-party cookies through the custom cookie blocking settings in technical details. For more information, see Storage AccessAPI on MDN Web Docs . Select the button (shown when multiple tabs are open) to apply your new setting. Note: Firefox also includes Total Cookie Protection , which creates a “cookie jar” for every website. This feature keeps cookies in the site where they were created so that they can't track you across websites. Total Cookie protection is enabled when the Cross-site tracking cookies, and isolate other cross-site cookies setting is selected. Enable third-party cookies for specific sites Some websites may not work properly when third-party (cross-site) cookies are blocked. To turn off Enhanced Tracking Protection for a specific website: Visit the website. At the left of the address bar, click the shield icon . At the top of the panel, toggle off the Enhanced Tracking Protection switch . This will disable Enhanced Tracking Protection for the site, causing the page to automatically reload and enable trackers. Follow the same process to turn Enhanced Tracking Protection back on. If the issue persists, consider reporting it by submitting a Broken Site Report . This allows the Webcompat team to examine the problem. For more information, see How do I report a broken site in Firefox desktop?",
  "products": [
    "firefox"
  ],
  "topics": [
    "tracking-protection"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 7334,
    "text_bytes": 3225,
    "word_count": 513,
    "downloaded_at": "2025-08-26T09:04:21.760855"
  }
}