{
  "slug": "unlink-google-or-apple-id-your-account",
  "title": "Unlink your Google or Apple ID from your Mozilla account",
  "summary": "If you no longer want to use your Google or Apple account to sign in to your Mozilla account, you can unlink it in your Mozilla account settings.",
  "url": "https://support.mozilla.org/en-US/kb/unlink-google-or-apple-id-your-account",
  "html": "<p>If you no longer want to use your Google or Apple account to sign in to your Mozilla account, you can unlink it in your Mozilla account settings. Before you do, if you have not already set a password for your Mozilla account, you will be prompted to set one so you have a way of signing in. \n</p>\n<h1 id=\"w_to-unlink-your-google-or-apple-account-and-set-a-new-password\">To unlink your Google or Apple account and set a new password:</h1>\n<ol><li><a href=\"https://accounts.firefox.com/settings\">Go to your account settings</a>.\n</li><li>Scroll down to the <strong>Linked Accounts</strong> section, and click <strong>Unlink</strong>.\n<dl><dt><img alt=\"Linked accounts settings\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-09-20-07-40-24-46cb6d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n</li><li>Click <span class=\"button\">Set password</span> in the notification window that appears if you have not already set a password for your Mozilla account.\n<dl><dt><img alt=\"Unlink account - set password\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-09-20-07-42-02-905f1d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> \n</dt></dl>\n<ul><li>Create your new account password and click <strong>Save</strong>. \n</li></ul>\n<dl><dt>You’ll be redirected back to the settings page. In the <strong>Linked Accounts</strong> section, click <strong>Unlink</strong> again next to the account you want to remove. \n</dt></dl>\n</li><li>Click <span class=\"button\">Unlink</span> in the notification window that appears. \n</li></ol>\n<p><img alt=\"Unlink account notification\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2023-09-20-07-41-46-a123a1.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> \n</p>\n<div class=\"note\">\n<p><strong>Notes:</strong>\n</p>\n<ul><li>Unlinking your Google or Apple account from your Mozilla account will not sign you out of any of the connected Mozilla services. To do that, you’ll need to manually sign out under <a href=\"https://accounts.firefox.com/settings#connected-services\">Connected Services</a>. \n</li><li>Unlinking your Google or Apple account from your Mozilla account will not sign you out of your Google or Apple account in your browser. To do that, you’ll need to go to Google or Apple directly to sign out of your Google or Apple account.\n</li></ul>\n</div>\n<h1 id=\"w_related-content\">Related content</h1>\n<ul><li><a href=\"/en-US/kb/sign-in-accounts-using-3rd-party-auth\">Sign in to a Mozilla account using 3rd-party authentication</a>\n</li><li><a href=\"/en-US/kb/firefox-accounts-managing-account-data\">Mozilla account - Managing account data</a> \n</li><li><a href=\"/en-US/kb/change-your-firefox-accounts-password\">Change your Mozilla account password</a>\n</li></ul>",
  "text": "If you no longer want to use your Google or Apple account to sign in to your Mozilla account, you can unlink it in your Mozilla account settings. Before you do, if you have not already set a password for your Mozilla account, you will be prompted to set one so you have a way of signing in. To unlink your Google or Apple account and set a new password: Go to your account settings . Scroll down to the Linked Accounts section, and click Unlink . Click Set password in the notification window that appears if you have not already set a password for your Mozilla account. Create your new account password and click Save . You’ll be redirected back to the settings page. In the Linked Accounts section, click Unlink again next to the account you want to remove. Click Unlink in the notification window that appears. Notes: Unlinking your Google or Apple account from your Mozilla account will not sign you out of any of the connected Mozilla services. To do that, you’ll need to manually sign out under Connected Services . Unlinking your Google or Apple account from your Mozilla account will not sign you out of your Google or Apple account in your browser. To do that, you’ll need to go to Google or Apple directly to sign out of your Google or Apple account. Related content Sign in to a Mozilla account using 3rd-party authentication Mozilla account - Managing account data Change your Mozilla account password",
  "products": [
    "firefox",
    "mozilla-account"
  ],
  "topics": [
    "account-management",
    "accounts"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3176,
    "text_bytes": 1413,
    "word_count": 252,
    "downloaded_at": "2025-08-26T10:56:27.710824"
  }
}