{
  "slug": "unload-inactive-tabs-save-system-memory-firefox",
  "title": "Unload inactive tabs to save system memory in Firefox",
  "summary": "Learn how to free up system memory by unloading inactive tabs in Firefox.",
  "url": "https://support.mozilla.org/en-US/kb/unload-inactive-tabs-save-system-memory-firefox",
  "html": "<p>Tab Unloading is a feature that helps reduce memory usage by unloading tabs that you are not actively using. To avoid crashes, Firefox will automatically select and unload these open tabs when the system's memory is low, starting in <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 93 on Windows. This is a smart process that avoids unloading tabs that are playing media, using Picture-in-Picture, or WebRTC. For more technical information, see <a href=\"https://hacks.mozilla.org/2021/10/tab-unloading-in-firefox-93/\">this blog post</a> and <a href=\"https://firefox-source-docs.mozilla.org/browser/tabunloader/\">Tab Unloading</a> at Firefox Source Docs.\n</p><p>The <em>about:unloads</em> page is built into Firefox on all Desktop platforms. It displays information about your open tabs, such as the order of priority for unloading tabs, the last time you accessed each tab and the memory each tab is consuming. To open this page, type <em>about:unloads</em> in the address bar and press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Enter</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">Return</span></span>.\n</p><p><span class=\"for\" data-for=\"not fx140\"><img alt=\"Fx128AboutUnloads\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-06-25-23-57-20-4b04ae.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span><span class=\"for\" data-for=\"fx140\"><img alt=\"Fx140AboutUnloads\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-06-25-23-59-58-e84eac.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</p><p>You can manually unload your least-recently-used tabs by going to the <em>about:unloads</em> page and clicking on the <span class=\"button\">Unload</span> button that appears above the table, on the right.\n</p><p><span class=\"for\" data-for=\"fx140\">You can also <a href=\"/en-US/kb/unload-tabs-reduce-memory-usage-firefox\">unload the tabs of your choice</a> from the <a href=\"/en-US/kb/tab-context-menu\">tab context menu</a> to reduce system memory usage in Firefox.</span>\n</p>\n<div class=\"note\"><strong>Note:</strong> If you want to disable the Tab Unloading feature, you can set the preference <span class=\"pref\">browser.tabs.unloadOnLowMemory</span> to <span class=\"pref\">false</span> in the <a href=\"/en-US/kb/about-config-editor-firefox\">Firefox Configuration Editor</a> (about:config page). <div class=\"warning\"><strong>Warning:</strong> These instructions are for experienced Firefox users. Changing settings in the <a href=\"/en-US/kb/about-config-editor-firefox\">Configuration Editor</a> (<em>about:config</em>) can have serious effects on your browser’s stability, security and performance.\n<br><strong>Only proceed if you are comfortable with advanced settings and understand the potential impacts</strong>.</div></div>",
  "text": "Tab Unloading is a feature that helps reduce memory usage by unloading tabs that you are not actively using. To avoid crashes, Firefox will automatically select and unload these open tabs when the system's memory is low, starting in Firefox version 93 on Windows. This is a smart process that avoids unloading tabs that are playing media, using Picture-in-Picture, or WebRTC. For more technical information, see this blog post and Tab Unloading at Firefox Source Docs. The about:unloads page is built into Firefox on all Desktop platforms. It displays information about your open tabs, such as the order of priority for unloading tabs, the last time you accessed each tab and the memory each tab is consuming. To open this page, type about:unloads in the address bar and press Enter Return . You can manually unload your least-recently-used tabs by going to the about:unloads page and clicking on the Unload button that appears above the table, on the right. You can also unload the tabs of your choice from the tab context menu to reduce system memory usage in Firefox. Note: If you want to disable the Tab Unloading feature, you can set the preference browser.tabs.unloadOnLowMemory to false in the Firefox Configuration Editor (about:config page). Warning: These instructions are for experienced Firefox users. Changing settings in the Configuration Editor ( about:config ) can have serious effects on your browser’s stability, security and performance. Only proceed if you are comfortable with advanced settings and understand the potential impacts .",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse",
    "performance-and-connectivity",
    "tabs"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3107,
    "text_bytes": 1554,
    "word_count": 248,
    "downloaded_at": "2025-08-26T10:54:38.112484"
  }
}