{
  "slug": "update-failed-error-message-when-updating",
  "title": "How to fix the Update Failed error message when updating Firefox",
  "summary": "This article presents solutions and workarounds to a failed Firefox update so that you can get it updated and working correctly again.",
  "url": "https://support.mozilla.org/en-US/kb/update-failed-error-message-when-updating",
  "html": "<p>Firefox includes a Software Update feature that automatically checks for updates and prompts you to install them when necessary.\n</p>\n<ul><li>For more information about the Software Update feature, see <a href=\"/en-US/kb/update-firefox-latest-release\">Update Firefox to the latest release</a>.\n</li></ul>\n<p>Sometimes, the updater fails and displays an <strong>Update Failed</strong> error message. This article presents possible solutions and workarounds to get Firefox updated.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_manual-update\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Manual update</span></a></li><li class=\"toclevel-1\"><a href=\"#w_check-for-updates-after-restarting-the-computer\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Check for updates after restarting the computer</span></a></li><li class=\"toclevel-1\"><a href=\"#w_close-other-running-programs\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Close other running programs</span></a></li><li class=\"toclevel-1\"><a href=\"#w_run-as-administrator\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Run as Administrator</span></a></li></ul></div>\n<h1 id=\"w_manual-update\">Manual update</h1>\n<p>One solution is to update Firefox by manually downloading and installing the new version over top of your current version. See <span class=\"for\" data-for=\"win\"><a href=\"/en-US/kb/how-install-firefox-windows\">How to install Firefox on Windows</a></span><span class=\"for\" data-for=\"linux\"><a href=\"/en-US/kb/install-firefox-linux\">Install Firefox on Linux</a></span><span class=\"for\" data-for=\"mac\"><a href=\"/en-US/kb/how-download-and-install-firefox-mac\">How to download and install Firefox on Mac</a></span> for instructions.\n</p>\n<h1 id=\"w_check-for-updates-after-restarting-the-computer\">Check for updates after restarting the computer</h1>\n<p>It's possible that another running program or a previous instance of Firefox that did not close properly is interfering with the Firefox update process. This error can also occur if you share your computer with other users, and another user's account is still logged in with Firefox running. The easiest way to resolve such problems is to restart your computer. Once the computer starts up again:\n</p>\n<ol><li> Start Firefox.\n</li><li><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and click <span class=\"menu\">Help</span>.</span><span class=\"for\" data-for=\"mac\">On the Menu bar, click the <span class=\"menu\">Firefox</span> menu.</span>\n</li><li>Select <span class=\"menu\">About Firefox</span>. Firefox will begin checking for updates.\n</li></ol>\n<h1 id=\"w_close-other-running-programs\">Close other running programs</h1>\n<p>Some programs that can interfere with Firefox are set to start up automatically when you start your computer. Before updating Firefox, try closing or disabling such programs; for example, Spybot TeaTimer and Logitech QuickCam software have been known to interfere with Firefox updates.\n</p><div class=\"for\" data-for=\"win\">\n<h1 id=\"w_run-as-administrator\">Run as Administrator</h1>\n<p>If you are using Windows 7 or Vista:\n</p>\n<ol><li>Restart the computer so that no Firefox processes are active.\n</li><li>Open the Windows Start Menu, type <strong>firefox</strong> and right-click on the <strong>Mozilla Firefox</strong> entry that appears.\n</li><li>Select <span class=\"menu\">Run as Administrator</span> and <span class=\"menu\">Continue</span> if the <em>User Account Control</em> dialog comes up.\n</li></ol>\n<p>If the issue is not resolved, close Firefox and restart the computer again, but, this time, open the program folder where Firefox is installed (e.g., open the <span class=\"filepath\">C:\\Program Files\\Mozilla Firefox</span> folder or, on 64-bit windows, the <span class=\"filepath\">C:\\Program Files (x86)\\Mozilla Firefox</span> folder), right-click on the <strong>firefox</strong> or <strong>firefox.exe</strong> file icon and select <span class=\"menu\">Run as Administrator</span>.\n</p></div>\n<div class=\"note\"><strong>Still can't update Firefox?</strong><br>If you're using a school or work computer, IT admins may lock updates to a specific version to prevent users from updating the application. As a result, when users try to manually update Firefox to a newer version, they won't see any updates available, or they'll see the message that they're already running the latest version as set by their IT admin.</div>\n<p>\n<br> <br>\n<em><strong>Based on information from <a href=\"http://kb.mozillazine.org/Software_Update#Software_Update_not_working_properly\">Software Update (mozillaZine KB)</a></strong></em>\n</p>",
  "text": "Firefox includes a Software Update feature that automatically checks for updates and prompts you to install them when necessary. For more information about the Software Update feature, see Update Firefox to the latest release . Sometimes, the updater fails and displays an Update Failed error message. This article presents possible solutions and workarounds to get Firefox updated. Table of Contents 1 Manual update 2 Check for updates after restarting the computer 3 Close other running programs 4 Run as Administrator Manual update One solution is to update Firefox by manually downloading and installing the new version over top of your current version. See How to install Firefox on Windows Install Firefox on Linux How to download and install Firefox on Mac for instructions. Check for updates after restarting the computer It's possible that another running program or a previous instance of Firefox that did not close properly is interfering with the Firefox update process. This error can also occur if you share your computer with other users, and another user's account is still logged in with Firefox running. The easiest way to resolve such problems is to restart your computer. Once the computer starts up again: Start Firefox. Click the menu button and click Help . On the Menu bar, click the Firefox menu. Select About Firefox . Firefox will begin checking for updates. Close other running programs Some programs that can interfere with Firefox are set to start up automatically when you start your computer. Before updating Firefox, try closing or disabling such programs; for example, Spybot TeaTimer and Logitech QuickCam software have been known to interfere with Firefox updates. Run as Administrator If you are using Windows 7 or Vista: Restart the computer so that no Firefox processes are active. Open the Windows Start Menu, type firefox and right-click on the Mozilla Firefox entry that appears. Select Run as Administrator and Continue if the User Account Control dialog comes up. If the issue is not resolved, close Firefox and restart the computer again, but, this time, open the program folder where Firefox is installed (e.g., open the C:\\Program Files\\Mozilla Firefox folder or, on 64-bit windows, the C:\\Program Files (x86)\\Mozilla Firefox folder), right-click on the firefox or firefox.exe file icon and select Run as Administrator . Still can't update Firefox? If you're using a school or work computer, IT admins may lock updates to a specific version to prevent users from updating the application. As a result, when users try to manually update Firefox to a newer version, they won't see any updates available, or they'll see the message that they're already running the latest version as set by their IT admin. Based on information from Software Update (mozillaZine KB)",
  "products": [
    "firefox"
  ],
  "topics": [
    "error-codes",
    "performance-and-connectivity"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 4946,
    "text_bytes": 2808,
    "word_count": 451,
    "downloaded_at": "2025-08-26T09:03:58.952503"
  }
}