{
  "slug": "usage-ping-settings",
  "title": "Manage daily usage ping data collection settings in Firefox",
  "summary": "Learn how to manage daily usage ping data collection settings in Firefox.",
  "url": "https://support.mozilla.org/en-US/kb/usage-ping-settings",
  "html": "<div class=\"for\" data-for=\"not fx136\"><div class=\"note\"><strong>Note:</strong> This article applies to <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 136 and above.</div></div>\n<p>Firefox collects separate daily usage data to help Mozilla understand how many people use it each day. This article explains what daily usage data is, how it’s used, and how to opt out of daily usage data collection on Android, iOS and Desktop. For more details on Firefox’s data collection, see <a href=\"/en-US/kb/manage-firefox-data-collection-privacy-settings\">Manage Firefox data collection and privacy settings</a>.\n</p>\n<h1 id=\"w_what-is-usage-ping-data\">What is usage ping data?</h1>\n<p>The daily usage ping contains a very limited set of data, which Mozilla uses to count the number of daily active users of Firefox. This data does not contain any information about what you are doing in Firefox, it only shows that you are using it. For details, see <a href=\"https://docs.telemetry.mozilla.org/metrics/metrics#daily-active-users-dau\">Mozilla Data Documentation – Daily Active Users (DAU)</a> for Android, iOS and Desktop.\n</p>\n<h1 id=\"w_where-can-i-learn-more\">Where can I learn more?</h1>\n<p>For a technical overview of the data collected in the daily usage ping, see the definitions in the Glean Dictionary for <a href=\"https://dictionary.telemetry.mozilla.org/apps/fenix/pings/usage-reporting\">Android</a>, <a href=\"https://dictionary.telemetry.mozilla.org/apps/firefox_ios/pings/usage-reporting\">iOS</a> and <a href=\"https://dictionary.telemetry.mozilla.org/apps/firefox_desktop/pings/usage-reporting\">Desktop</a>.\n</p>\n<h1 id=\"w_how-does-mozilla-use-it\">How does Mozilla use it?</h1>\n<p>Mozilla uses daily usage ping data to determine the number of daily active users of Firefox. This data supports Mozilla’s reporting requirements and informs active user estimates for both internal analysis and external reporting needs. These metrics allow Mozilla to assess Firefox’s reach and understand its usage patterns.\n</p><p>Mozilla’s approach to data collection is grounded in its core values, as defined in the <a href=\"https://www.mozilla.org/about/manifesto/\">Mozilla Manifesto</a>. For more information on how we collect, use and protect user data, refer to our <a href=\"https://www.mozilla.org/privacy/firefox/\">Privacy Notice</a>.\n</p>\n<h1 id=\"w_how-can-i-opt-out\">How can I opt out?</h1>\n<p>If you prefer not to participate in daily usage ping data collection, you can opt out by adjusting your settings on Android, iOS or Desktop. For Klar on Android and iOS, the daily usage ping is opt in. Follow the steps below based on your platform:\n</p><section class=\"mzp-c-details\">\n<p></p>\n<h2 id=\"w_on-desktop\">On Desktop</h2>\n<ol><li>Open Firefox and click the Application Menu button ≡ in the upper-right corner.\n</li><li>Select <span class=\"menu\">Settings</span>.\n</li><li>Go to the <span class=\"menu\">Privacy &amp; Security</span> panel, and scroll down to <em>Firefox Data Collection and Use</em>.\n</li><li>Uncheck the box next to <strong>Send daily usage ping to Mozilla</strong> to opt out of this data collection.\n</li></ol>\n<dl><dt><img alt=\"Fx136DataCollection-DailyUsagePing-Simplified\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-02-06-07-42-47-706b6f.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\">\n</dt></dl>\n<p>To completely opt out of telemetry data collection in Firefox, see <a href=\"/en-US/kb/technical-and-interaction-data#w_how-to-turn-off-technical-and-interaction-data-collection\">How to opt out of data collection</a>.\n</p>\n<h2 id=\"w_on-firefox-for-android\">On Firefox for Android</h2>\n<ol><li>Open Firefox and tap the menu button <span class=\"button\">⋮</span> on the browser toolbar.\n</li><li>Select <span class=\"menu\">Settings</span>.\n</li><li>Scroll to <em>Privacy and Security</em>, then tap <span class=\"menu\">Data collection</span>.\n</li><li>Toggle off the <strong>Daily usage ping</strong> option to opt out of this data collection.\n</li></ol>\n<dl><dt><img alt=\"DAU Android\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-31-04-32-38-943359.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"300\">\n</dt></dl>\n<h2 id=\"w_on-firefox-for-ios\">On Firefox for iOS</h2>\n<ol><li>Open Firefox and tap the menu button ≡ on the browser toolbar.\n</li><li>Select <span class=\"menu\">Settings</span>.\n</li><li>Scroll to the <em>Support</em> section.\n</li><li>Toggle off the <strong>Daily Usage Ping</strong> option to opt out of this data collection.\n</li></ol>\n<dl><dt><img alt=\"DAU iOS\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-01-31-04-33-08-8c3fa8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"300\">\n</dt></dl>\n<h2 id=\"w_on-firefox-focus-and-klar-for-android\">On Firefox Focus and Klar for Android</h2>\n<ol><li>Open Firefox Focus or Klar and tap the menu button <span class=\"button\">⋮</span> in the top-right corner.\n</li><li>Select <span class=\"menu\">Settings</span>.\n</li><li>Select <span class=\"menu\">Privacy and Security</span>.\n</li><li>Scroll down to the  <em>Data Choices</em> section.\n</li><li>Toggle off the <strong>Daily usage ping</strong> option to opt out of this data collection.\n<dl><dt><img alt=\"Daily usage ping Focus Android 136\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-03-14-07-43-22-66eb2c.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"350\">\n</dt></dl>\n</li></ol>\n<h2 id=\"w_on-firefox-focus-and-klar-for-ios\">On Firefox Focus and Klar for iOS</h2>\n<ol><li>Open Firefox Focus or Klar and tap the menu button ≡ at the bottom of the screen.\n</li><li>Select <span class=\"menu\">Settings</span>.\n</li><li>Scroll to the <em>Privacy</em> section.\n</li><li>Toggle off the <strong>Daily Usage Ping</strong> option to opt out of this data collection.\n<dl><dt><img alt=\"DailyUsagePingFocusIos\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-04-11-07-49-27-c4ca42.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"350\">\n</dt></dl>\n</li></ol>\n<p></p></section>\n<p></p>\n<h1 id=\"w_what-happens-if-i-disable-this-option\">What happens if I disable this option?</h1>\n<p>If you disable the Daily Usage Ping setting:\n</p>\n<ul><li> Firefox will stop sending daily usage pings to Mozilla.\n</li><li> Mozilla will no longer collect information about your app’s daily activity.\n</li></ul>\n<p>This change won’t affect other data collection settings, such as crash reports or technical telemetry, which can be managed separately.\n</p>\n<h1 id=\"w_related-content\">Related content</h1>\n<ul><li><a href=\"https://www.mozilla.org/privacy/firefox/\">Firefox Privacy Notice</a>\n</li><li><a href=\"/en-US/kb/manage-firefox-data-collection-privacy-settings\">Manage Firefox data collection and privacy settings</a>\n</li><li><a href=\"/en-US/kb/technical-and-interaction-data\">Manage technical and interaction data collection settings in Firefox</a>\n</li></ul>\n<div class=\"for\" data-for=\"win\">\n<ul><li><a href=\"/en-US/kb/telemetry-collection-windows-default-browser-trend\">Telemetry collection - Windows default browser trends</a>\n</li></ul>\n</div>",
  "text": "Note: This article applies to Firefox version 136 and above. Firefox collects separate daily usage data to help Mozilla understand how many people use it each day. This article explains what daily usage data is, how it’s used, and how to opt out of daily usage data collection on Android, iOS and Desktop. For more details on Firefox’s data collection, see Manage Firefox data collection and privacy settings . What is usage ping data? The daily usage ping contains a very limited set of data, which Mozilla uses to count the number of daily active users of Firefox. This data does not contain any information about what you are doing in Firefox, it only shows that you are using it. For details, see Mozilla Data Documentation – Daily Active Users (DAU) for Android, iOS and Desktop. Where can I learn more? For a technical overview of the data collected in the daily usage ping, see the definitions in the Glean Dictionary for Android , iOS and Desktop . How does Mozilla use it? Mozilla uses daily usage ping data to determine the number of daily active users of Firefox. This data supports Mozilla’s reporting requirements and informs active user estimates for both internal analysis and external reporting needs. These metrics allow Mozilla to assess Firefox’s reach and understand its usage patterns. Mozilla’s approach to data collection is grounded in its core values, as defined in the Mozilla Manifesto . For more information on how we collect, use and protect user data, refer to our Privacy Notice . How can I opt out? If you prefer not to participate in daily usage ping data collection, you can opt out by adjusting your settings on Android, iOS or Desktop. For Klar on Android and iOS, the daily usage ping is opt in. Follow the steps below based on your platform: On Desktop Open Firefox and click the Application Menu button ≡ in the upper-right corner. Select Settings . Go to the Privacy & Security panel, and scroll down to Firefox Data Collection and Use . Uncheck the box next to Send daily usage ping to Mozilla to opt out of this data collection. To completely opt out of telemetry data collection in Firefox, see How to opt out of data collection . On Firefox for Android Open Firefox and tap the menu button ⋮ on the browser toolbar. Select Settings . Scroll to Privacy and Security , then tap Data collection . Toggle off the Daily usage ping option to opt out of this data collection. On Firefox for iOS Open Firefox and tap the menu button ≡ on the browser toolbar. Select Settings . Scroll to the Support section. Toggle off the Daily Usage Ping option to opt out of this data collection. On Firefox Focus and Klar for Android Open Firefox Focus or Klar and tap the menu button ⋮ in the top-right corner. Select Settings . Select Privacy and Security . Scroll down to the Data Choices section. Toggle off the Daily usage ping option to opt out of this data collection. On Firefox Focus and Klar for iOS Open Firefox Focus or Klar and tap the menu button ≡ at the bottom of the screen. Select Settings . Scroll to the Privacy section. Toggle off the Daily Usage Ping option to opt out of this data collection. What happens if I disable this option? If you disable the Daily Usage Ping setting: Firefox will stop sending daily usage pings to Mozilla. Mozilla will no longer collect information about your app’s daily activity. This change won’t affect other data collection settings, such as crash reports or technical telemetry, which can be managed separately. Related content Firefox Privacy Notice Manage Firefox data collection and privacy settings Manage technical and interaction data collection settings in Firefox Telemetry collection - Windows default browser trends",
  "products": [
    "firefox",
    "mobile",
    "ios",
    "focus-firefox"
  ],
  "topics": [
    "privacy-and-security"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 7770,
    "text_bytes": 3704,
    "word_count": 642,
    "downloaded_at": "2025-08-26T10:57:22.465508"
  }
}