{
  "slug": "using-primary-password-sync",
  "title": "Use a Primary Password with Sync",
  "summary": "Learn how to use Sync in Firefox with a Primary Password (formerly known as a “Master Password”) for extra protection.",
  "url": "https://support.mozilla.org/en-US/kb/using-primary-password-sync",
  "html": "<p>Firefox for desktop has the option to use a Primary Password to protect your saved passwords. When a Primary Password is enabled, your saved passwords are encrypted and can not be accessed without entering the Primary Password. See <a href=\"/en-US/kb/use-primary-password-protect-stored-logins\">Use a Primary Password to protect stored logins and passwords</a> for more information.\n</p>\n<h1 id=\"w_how-does-my-primary-password-work-with-sync\">How does my Primary Password work with Sync?</h1>\n<p>When <a href=\"/en-US/kb/how-do-i-set-sync-my-computer\">using Sync</a>, your Mozilla account login is stored in the <a href=\"/en-US/kb/password-manager-remember-delete-edit-logins\">Firefox password manager</a>. Your Primary Password must be entered before Sync can access your Mozilla account, allowing <a href=\"/en-US/kb/sync-firefox-desktop\">syncing of your saved passwords</a> and other browser data among your devices.\n</p>\n<h1 id=\"w_how-are-my-passwords-kept-safe\">How are my passwords kept safe?</h1>\n<p>When you save website passwords, the Primary Password feature encrypts them before storing them on your computer. To sync your passwords, once you enter your Primary Password, Sync re-encrypts them based on your Mozilla account password and then sends them to Sync servers. The decrypted copies of your passwords are never transmitted online.\n</p><p>This means the Primary Password is specific to a single device and not your Mozilla account. Each device can have a different (or no) Primary Password, and they are not synced between devices.\n</p>\n<div class=\"note\"><strong>Tip:</strong> Increase protection by enabling a Primary Password on each device. See <a href=\"/en-US/kb/use-primary-password-protect-stored-logins\">Use a Primary Password to protect stored logins and passwords</a>.</div>\n<h1 id=\"w_what-about-android-and-apples-ios\">What about Android and Apple's iOS?</h1>\n<p>Mobile versions of Firefox locally encrypt your passwords, but do so by relying on the built-in security of the device rather than a Primary Password. Your Mozilla account password is required to connect to Sync, so each login can be re-encrypted in a way that other devices are able to decrypt.\n</p>\n<div class=\"note\"><strong>Security tip:</strong> Always choose <a href=\"/en-US/kb/password-strength\">a strong password</a> for your Mozilla account and be careful not to lose it. If you reset your password after forgetting it, you will lose access to your Sync data until you resync your device using the new password.</div>",
  "text": "Firefox for desktop has the option to use a Primary Password to protect your saved passwords. When a Primary Password is enabled, your saved passwords are encrypted and can not be accessed without entering the Primary Password. See Use a Primary Password to protect stored logins and passwords for more information. How does my Primary Password work with Sync? When using Sync , your Mozilla account login is stored in the Firefox password manager . Your Primary Password must be entered before Sync can access your Mozilla account, allowing syncing of your saved passwords and other browser data among your devices. How are my passwords kept safe? When you save website passwords, the Primary Password feature encrypts them before storing them on your computer. To sync your passwords, once you enter your Primary Password, Sync re-encrypts them based on your Mozilla account password and then sends them to Sync servers. The decrypted copies of your passwords are never transmitted online. This means the Primary Password is specific to a single device and not your Mozilla account. Each device can have a different (or no) Primary Password, and they are not synced between devices. Tip: Increase protection by enabling a Primary Password on each device. See Use a Primary Password to protect stored logins and passwords . What about Android and Apple's iOS? Mobile versions of Firefox locally encrypt your passwords, but do so by relying on the built-in security of the device rather than a Primary Password. Your Mozilla account password is required to connect to Sync, so each login can be re-encrypted in a way that other devices are able to decrypt. Security tip: Always choose a strong password for your Mozilla account and be careful not to lose it. If you reset your password after forgetting it, you will lose access to your Sync data until you resync your device using the new password.",
  "products": [
    "firefox"
  ],
  "topics": [
    "passwords-and-sign-in",
    "primary-password",
    "sync-data"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2517,
    "text_bytes": 1898,
    "word_count": 316,
    "downloaded_at": "2025-08-26T10:37:38.008143"
  }
}