{
  "slug": "websites-show-spinning-wheel-never-finish-load",
  "title": "Websites show a spinning wheel and never finish loading",
  "summary": "Sometimes a website will start to load, but never finish. This article covers possible solutions.",
  "url": "https://support.mozilla.org/en-US/kb/websites-show-spinning-wheel-never-finish-load",
  "html": "<p>This article explains what to do when specific websites (not all) start to load, but never finish (i.e. the tab displays a spinning wheel and \"Connecting...\" for several minutes).\n</p>\n<ul><li> If Firefox cannot load websites but displays an error message at the end, see <a href=\"/en-US/kb/firefox-cant-load-websites-other-browsers-can\">Firefox can't load websites but other browsers can</a> and <a href=\"/en-US/kb/websites-dont-load-troubleshoot-and-fix-errors\">Websites don't load - troubleshoot and fix error messages</a>.\n</li><li> If none of the web browsers on your computer can load websites, see <a href=\"/en-US/kb/firefox-and-other-browsers-cant-load-websites\">Firefox and other browsers can't load websites</a>. \n</li></ul>\n<p>If none of the below solutions work, try the methods described in the <a class=\"new\" href=\"/en-US/kb/new?title=Basic+troubleshooting\" title=\"Page does not exist.\">Basic troubleshooting</a> article to see if they will address your problem.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_search-for-malware\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Search for malware</span></a></li><li class=\"toclevel-1\"><a href=\"#w_disable-javascript\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Disable JavaScript</span></a></li></ul></div>\n<h1 id=\"w_search-for-malware\">Search for malware</h1>\n<p>A variant of the <a href=\"http://en.wikipedia.org/wiki/Vundo\">Vundo trojan</a> is known to cause Firefox to have problems loading certain high-traffic sites, including Google, Yahoo, MySpace, Facebook, and more. Not all variants of the Vundo trojan can be detected or removed by malware scanners.\n</p><p>However, you should scan your computer for infections first. For detailed instructions, see <a href=\"/en-US/kb/troubleshoot-firefox-issues-caused-malware\">Troubleshoot Firefox issues caused by malware</a>.\n</p>\n<h1 id=\"w_disable-javascript\">Disable JavaScript</h1>\n<p>In rare cases, a web page may be using an external JavaScript file which is in the wrong format.  Try disabling JavaScript - see <a href=\"/en-US/kb/javascript-settings-for-interactive-web-pages\">JavaScript settings and preferences for interactive web pages</a>.  If the page now finishes loading the bad Javascript file may be coming from:\n</p>\n<ul><li> a proxy filter that is incorrectly filtering that website's files.  If you are running a proxy filter such as Privoxy, try disabling it.\n</li><li> the server.  Contact the site administrator for that website.\n</li></ul>",
  "text": "This article explains what to do when specific websites (not all) start to load, but never finish (i.e. the tab displays a spinning wheel and \"Connecting...\" for several minutes). If Firefox cannot load websites but displays an error message at the end, see Firefox can't load websites but other browsers can and Websites don't load - troubleshoot and fix error messages . If none of the web browsers on your computer can load websites, see Firefox and other browsers can't load websites . If none of the below solutions work, try the methods described in the Basic troubleshooting article to see if they will address your problem. Table of Contents 1 Search for malware 2 Disable JavaScript Search for malware A variant of the Vundo trojan is known to cause Firefox to have problems loading certain high-traffic sites, including Google, Yahoo, MySpace, Facebook, and more. Not all variants of the Vundo trojan can be detected or removed by malware scanners. However, you should scan your computer for infections first. For detailed instructions, see Troubleshoot Firefox issues caused by malware . Disable JavaScript In rare cases, a web page may be using an external JavaScript file which is in the wrong format. Try disabling JavaScript - see JavaScript settings and preferences for interactive web pages . If the page now finishes loading the bad Javascript file may be coming from: a proxy filter that is incorrectly filtering that website's files. If you are running a proxy filter such as Privoxy, try disabling it. the server. Contact the site administrator for that website.",
  "products": [
    "firefox"
  ],
  "topics": [
    "site-breakages"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 2531,
    "text_bytes": 1583,
    "word_count": 261,
    "downloaded_at": "2025-08-26T09:04:25.821728"
  }
}