{
  "slug": "websites-look-wrong-or-appear-differently",
  "title": "Websites look wrong or appear differently than they should",
  "summary": "This article explains how to fix problems with websites that display incorrectly in Firefox or don't work the way they should.",
  "url": "https://support.mozilla.org/en-US/kb/websites-look-wrong-or-appear-differently",
  "html": "<p>This article explains how to fix problems with websites that display incorrectly in Firefox or don't work the way they should.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_clear-the-cookies-and-cache\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Clear the cookies and cache</span></a></li><li class=\"toclevel-1\"><a href=\"#w_reset-zoom\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Reset Zoom</span></a></li><li class=\"toclevel-1\"><a href=\"#w_reset-the-minimum-font-size\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Reset the minimum font size</span></a></li><li class=\"toclevel-1\"><a href=\"#w_reset-the-page-style\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Reset the page style</span></a></li><li class=\"toclevel-1\"><a href=\"#w_check-that-javascript-is-not-blocked\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Check that JavaScript is not blocked</span></a></li><li class=\"toclevel-1\"><a href=\"#w_check-that-your-system-clock-is-set-correctly\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Check that your system clock is set correctly</span></a></li><li class=\"toclevel-1\"><a href=\"#w_disable-problematic-extensions-or-hardware-acceleration\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">Disable problematic extensions or hardware acceleration</span></a></li><li class=\"toclevel-1\"><a href=\"#w_check-if-firefox-has-blocked-insecure-content\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">Check if Firefox has blocked insecure content</span></a></li><li class=\"toclevel-1\"><a href=\"#w_turn-off-enhanced-tracking-protection-for-the-website\"><span class=\"tocnumber\">9</span> <span class=\"toctext\">Turn off Enhanced Tracking Protection for the website</span></a></li><li class=\"toclevel-1\"><a href=\"#w_report-the-website\"><span class=\"tocnumber\">10</span> <span class=\"toctext\">Report the website</span></a></li><li class=\"toclevel-1\"><a href=\"#w_related-links\"><span class=\"tocnumber\">11</span> <span class=\"toctext\">Related links</span></a></li></ul></div>\n<h1 id=\"w_clear-the-cookies-and-cache\">Clear the cookies and cache</h1>\n<p>Firefox caches websites, which means it saves some files on your machine so that it doesn't have to re-download everything when you visit sites. If a website has updated their code, Firefox may still be using some of the old code along with some of the new, which can make a web page display incorrectly. To fix this, you need to clear the cookies and cache:\n</p><div class=\"for\" data-for=\"not fx128\">\n<ol><li> Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the menu panel.\n\n</li><li> Click <span class=\"menu\">History</span> and select <span class=\"menu\">Clear recent history…</span>\n</li><li> In the <em>Time range to clear:</em> drop-down, select <strong>Everything</strong>.\n</li><li> Below the drop-down menu, select both <strong>Cookies</strong> and <strong>Cache</strong>. Make sure other items you want to keep are not selected.\n</li><li> Click <span class=\"button\">Clear Now</span>.\n</li></ol>\n</div><div class=\"for\" data-for=\"fx128\">\n<ol><li> Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> to open the menu panel.\n\n</li><li> Click <span class=\"menu\">History</span> and select <span class=\"menu\">Clear recent history…</span>\n</li><li> In the <em>When:</em> drop-down, select <strong>Everything</strong>.\n</li><li> Below the drop-down menu, select both  <strong>Cookies and site data</strong> and <strong>Temporary cached files and pages</strong>. Make sure other items you want to keep are not selected.\n</li><li> Click <span class=\"button\">Clear</span>.\n</li></ol>\n</div>\nNow that your cookies and cache are cleared, visit the website again to see if the problem is solved.\n<p></p>\n<h1 id=\"w_reset-zoom\">Reset Zoom</h1>\n<p>Some websites may not look right at different zoom levels. To reset Zoom setting, for the site, press <span class=\"for\" data-for=\"win,linux\"><span class=\"key\">Ctrl</span> + <span class=\"key\">0</span></span><span class=\"for\" data-for=\"mac\"><span class=\"key\">command</span> + <span class=\"key\">0</span></span> and for all sites, see the documentation about the Zoom add-on you use.\n</p>\n<h1 id=\"w_reset-the-minimum-font-size\">Reset the minimum font size</h1>\n<p>Some sites do not display properly with a minimum font size. To reset the minimum font size:\n</p>\n<ol><li> <span class=\"for\" data-for=\"mac\">In the Menu bar at the top of the screen, click <span class=\"menu\">Firefox</span> and then select <span class=\"menu\">Preferences</span> or <span class=\"menu\">Settings</span>, depending on your macOS version.</span><span class=\"for\" data-for=\"win,linux\">Click the menu button <img alt=\"Fx89menuButton\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-15-11-18-38-e5b736.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> and select <span class=\"menu\">Settings</span>.</span>\n\n</li><li> Select the <span class=\"menu\">General</span> panel and navigate to <em>Language and Appearance</em>.\n</li><li> In the <strong>Fonts &amp; Colors</strong> section, click <span class=\"button\">Advanced…</span>.\n</li><li> Change the <strong>Minimum font size</strong> to <strong>None</strong>.\n</li></ol>\n<h1 id=\"w_reset-the-page-style\">Reset the page style</h1>\n<p>You may have inadvertently set the page style to <span class=\"menu\">No Style</span>. To ensure Firefox is set to use the page's default style:\n</p>\n<ul><li> <span class=\"for\" data-for=\"win,linux\">Press the <span class=\"key\">Alt</span> key (or the <span class=\"key\">AltGr</span> key) to <a href=\"/en-US/kb/restore-menu-bar-firefox\">temporarily bring up the Firefox Menu bar</a></span><span class=\"for\" data-for=\"mac\">On the menu bar at the top of the Firefox window</span>, click on the <span class=\"menu\">View</span> menu, then select <span class=\"menu\">Page Style</span> and click <span class=\"menu\">Basic Page Style</span>.\n</li></ul>\n<p>Now that the page is using its default style, it may be displayed correctly.\n</p>\n<h1 id=\"w_check-that-javascript-is-not-blocked\">Check that JavaScript is not blocked</h1>\n<p>You should check whether you have an extension (such as NoScript) or Internet security program (such as a firewall, antivirus, or anti-spyware program) that can block JavaScript. To learn more, see <a href=\"/en-US/kb/javascript-settings-for-interactive-web-pages\">JavaScript settings and preferences for interactive web pages</a>.\n</p>\n<h1 id=\"w_check-that-your-system-clock-is-set-correctly\">Check that your system clock is set correctly</h1>\n<p>In some instances the loading and verification of secure web content will be time-dependent, so you should check that date, time and timezone are set correctly on your system.\n</p>\n<h1 id=\"w_disable-problematic-extensions-or-hardware-acceleration\">Disable problematic extensions or hardware acceleration</h1>\n<p>Some extensions may interfere with the way websites are displayed, or your graphics card and drivers don't display some web content correctly when hardware acceleration is turned on. Follow the instructions in the <a href=\"/en-US/kb/troubleshoot-extensions-themes-to-fix-problems\">Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems</a> article to see if one of these is causing the problem.\n</p>\n<h1 id=\"w_check-if-firefox-has-blocked-insecure-content\">Check if Firefox has blocked insecure content</h1>\n<p>Firefox blocks potentially harmful, insecure content on web pages that are supposed to be secure. Click the padlock icon <img alt=\"Fx89Padlock\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-04-33-33-7bdc86.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> in the address bar to see if Firefox has blocked insecure parts of the page. See <a href=\"/en-US/kb/mixed-content-blocking-firefox\">Mixed content blocking in Firefox</a> for details.\n</p>\n<h1 id=\"w_turn-off-enhanced-tracking-protection-for-the-website\">Turn off Enhanced Tracking Protection for the website</h1>\n<p>If a site seems broken, disabling  <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop\">Enhanced Tracking Protection</a> might fix the issue by allowing trackers on just that site. It allows trackers to load on that site only. Enhanced Tracking Protection will still prevent trackers on other sites. To disable it:\n</p>\n<ol><li>Visit the website.\n</li><li>At the left of the address bar, click the <img alt=\"Fx89ShieldIcon\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2021-05-06-05-12-06-f2679d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"30\"> shield icon.\n</li><li>At the top of the panel, toggle off the Enhanced Tracking Protection switch <img alt=\"Fx91ETPbluetoggle\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-03-16-12-56-21-3859dc.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"40\">. This will disable Enhanced Tracking Protection for the site, causing the page to automatically reload and enable trackers.\n<dl><dt><span class=\"for\" data-for=\"not fx138\"><img alt=\"Protection panel\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2024-02-20-06-58-36-8c3fa8.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"400\"></span><span class=\"for\" data-for=\"fx138\"><img alt=\"Fx138ProtectionPanelOff\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2025-05-13-03-19-08-3f5858.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"></span>\n</dt></dl>\n</li></ol>\n<p>Follow the same process to turn Enhanced Tracking Protection back on.\n</p><p>If the issue persists, consider reporting it by submitting a <em>Broken Site Report</em>. This allows the Webcompat team to examine the problem. For more information, see <a href=\"/en-US/kb/report-breakage-due-blocking\">How do I report a broken site in Firefox desktop?</a>\n</p>\n<h1 id=\"w_report-the-website\">Report the website</h1>\n<p>If <a href=\"/en-US/kb/enhanced-tracking-protection-firefox-desktop#w_what-to-do-if-a-site-seems-broken\">turning off Enhanced Tracking Protection</a> allows a page to display and work correctly, you can report the website to help improve Firefox. See the <a href=\"/en-US/kb/report-breakage-due-blocking\">How do I report a broken site in Firefox desktop?</a> article for more information.\n</p><p>Occasionally, you may come across a page that simply doesn't work in Firefox, even when Enhanced Tracking Protection is turned off. If the same page works in another browser, please report the problem with our <a href=\"/en-US/kb/report-breakage-due-blocking\">desktop reporting tool</a>, or by visiting <a href=\"https://webcompat.com/\">Webcompat.com</a>.\n</p>\n<h1 id=\"w_related-links\">Related links</h1>\n<ul><li> <a href=\"/en-US/kb/websites-dont-load-troubleshoot-and-fix-errors\">Websites don't load - troubleshoot and fix error messages</a>\n</li><li> <a href=\"/en-US/kb/fix-problems-images-not-show\">Fix problems that cause images to not show</a>\n</li><li> <a href=\"/en-US/kb/fix-common-audio-and-video-issues\">Fix common audio and video issues</a>\n</li></ul>\n<p><br>\n\n<br><br>\n<em><strong>Based on information from <a href=\"http://kb.mozillazine.org/Websites_look_wrong\">Websites look wrong (mozillaZine KB)</a></strong></em>\n</p>",
  "text": "This article explains how to fix problems with websites that display incorrectly in Firefox or don't work the way they should. Table of Contents 1 Clear the cookies and cache 2 Reset Zoom 3 Reset the minimum font size 4 Reset the page style 5 Check that JavaScript is not blocked 6 Check that your system clock is set correctly 7 Disable problematic extensions or hardware acceleration 8 Check if Firefox has blocked insecure content 9 Turn off Enhanced Tracking Protection for the website 10 Report the website 11 Related links Clear the cookies and cache Firefox caches websites, which means it saves some files on your machine so that it doesn't have to re-download everything when you visit sites. If a website has updated their code, Firefox may still be using some of the old code along with some of the new, which can make a web page display incorrectly. To fix this, you need to clear the cookies and cache: Click the menu button to open the menu panel. Click History and select Clear recent history… In the Time range to clear: drop-down, select Everything . Below the drop-down menu, select both Cookies and Cache . Make sure other items you want to keep are not selected. Click Clear Now . Click the menu button to open the menu panel. Click History and select Clear recent history… In the When: drop-down, select Everything . Below the drop-down menu, select both Cookies and site data and Temporary cached files and pages . Make sure other items you want to keep are not selected. Click Clear . Now that your cookies and cache are cleared, visit the website again to see if the problem is solved. Reset Zoom Some websites may not look right at different zoom levels. To reset Zoom setting, for the site, press Ctrl + 0 command + 0 and for all sites, see the documentation about the Zoom add-on you use. Reset the minimum font size Some sites do not display properly with a minimum font size. To reset the minimum font size: In the Menu bar at the top of the screen, click Firefox and then select Preferences or Settings , depending on your macOS version. Click the menu button and select Settings . Select the General panel and navigate to Language and Appearance . In the Fonts & Colors section, click Advanced… . Change the Minimum font size to None . Reset the page style You may have inadvertently set the page style to No Style . To ensure Firefox is set to use the page's default style: Press the Alt key (or the AltGr key) to temporarily bring up the Firefox Menu bar On the menu bar at the top of the Firefox window , click on the View menu, then select Page Style and click Basic Page Style . Now that the page is using its default style, it may be displayed correctly. Check that JavaScript is not blocked You should check whether you have an extension (such as NoScript) or Internet security program (such as a firewall, antivirus, or anti-spyware program) that can block JavaScript. To learn more, see JavaScript settings and preferences for interactive web pages . Check that your system clock is set correctly In some instances the loading and verification of secure web content will be time-dependent, so you should check that date, time and timezone are set correctly on your system. Disable problematic extensions or hardware acceleration Some extensions may interfere with the way websites are displayed, or your graphics card and drivers don't display some web content correctly when hardware acceleration is turned on. Follow the instructions in the Troubleshoot extensions, themes and hardware acceleration issues to solve common Firefox problems article to see if one of these is causing the problem. Check if Firefox has blocked insecure content Firefox blocks potentially harmful, insecure content on web pages that are supposed to be secure. Click the padlock icon in the address bar to see if Firefox has blocked insecure parts of the page. See Mixed content blocking in Firefox for details. Turn off Enhanced Tracking Protection for the website If a site seems broken, disabling Enhanced Tracking Protection might fix the issue by allowing trackers on just that site. It allows trackers to load on that site only. Enhanced Tracking Protection will still prevent trackers on other sites. To disable it: Visit the website. At the left of the address bar, click the shield icon. At the top of the panel, toggle off the Enhanced Tracking Protection switch . This will disable Enhanced Tracking Protection for the site, causing the page to automatically reload and enable trackers. Follow the same process to turn Enhanced Tracking Protection back on. If the issue persists, consider reporting it by submitting a Broken Site Report . This allows the Webcompat team to examine the problem. For more information, see How do I report a broken site in Firefox desktop? Report the website If turning off Enhanced Tracking Protection allows a page to display and work correctly, you can report the website to help improve Firefox. See the How do I report a broken site in Firefox desktop? article for more information. Occasionally, you may come across a page that simply doesn't work in Firefox, even when Enhanced Tracking Protection is turned off. If the same page works in another browser, please report the problem with our desktop reporting tool , or by visiting Webcompat.com . Related links Websites don't load - troubleshoot and fix error messages Fix problems that cause images to not show Fix common audio and video issues Based on information from Websites look wrong (mozillaZine KB)",
  "products": [
    "firefox"
  ],
  "topics": [
    "performance-and-connectivity",
    "site-breakages"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 12534,
    "text_bytes": 5525,
    "word_count": 949,
    "downloaded_at": "2025-08-26T09:03:56.362990"
  }
}