{
  "slug": "what-mozilla-connect",
  "title": "What is Mozilla Connect?",
  "summary": "Mozilla Connect is a space to give product feedback, share ideas for new features, and participate in conversations about Mozilla products.",
  "url": "https://support.mozilla.org/en-US/kb/what-mozilla-connect",
  "html": "\n<p>Mozilla launched the platform <a href=\"https://connect.mozilla.org/\">Mozilla Connect</a>, in collaboration with <a href=\"https://khoros.com/\">Khoros</a>, as a space for users to give product feedback, share ideas for new features, and participate in meaningful conversations that help shape future releases. You can leave feedback and share ideas for Firefox desktop, mobile, Mozilla VPN, Pocket, Thunderbird and more.\n</p>\n<dl><dt><img alt=\"Mozilla_Connect\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2022-05-16-11-01-57-2e5c28.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" width=\"600\">\n</dt></dl>\n<h1 id=\"w_features\">Features</h1>\n<ul><li>You can sign in to Mozilla Connect using your <a href=\"/en-US/kb/access-mozilla-services-firefox-account\">Mozilla account</a>.\n</li><li>The platform is user-friendly. You can easily find the sections where you can contribute ideas, provide feedback and engage in discussions.\n</li><li>There is a labeling and search system, so other community members and product managers can easily find and engage with contributed posts.\n</li><li>In partnership with Khoros, Mozilla Connect allows you to rank your ideas and earn badges for your contributions.\n</li><li>The members of the community will be able to participate and host interesting events.\n</li></ul>\n<h2 id=\"w_a-better-way-to-give-and-receive-feedback\">A better way to give and receive feedback</h2>\n<p>Mozilla employees will participate by responding directly to ideas, leading discussions, and sharing product demos. Contributors can expect to receive feedback on their ideas from other community members almost immediately. Ideas can be commented and voted on by the community. All top ideas will be shared with the staff for review. The evaluation process can take up to two weeks, and, if an idea needs to be evaluated further, we’ll make sure to keep the community informed.\n</p>\n<h2 id=\"w_ideas-acceptance-criteria\">Ideas Acceptance Criteria</h2>\n<p>We are in the process of creating a rubric that details with what we consider for adopting ideas. This rubric will also be shared with the community. Some of the things we’ll consider are:\n</p>\n<ul><li>Does the idea align with the Mozilla vision?\n</li><li>Does the idea provide user value? Will the idea be impactful?\n</li></ul>\n<h2 id=\"w_how-is-mozilla-connect-different-from-mozilla-support\">How is Mozilla Connect different from Mozilla Support?</h2>\n<p><a href=\"https://support.mozilla.org/\">Mozilla Support</a> is a platform where users can find help articles and an active community of contributors ready to answer questions about Mozilla products in the <a href=\"https://support.mozilla.org/en-US/questions/new\">support forums</a>. On the other hand, <a href=\"https://connect.mozilla.org/\">Mozilla Connect</a> brings the community and the employees closer together to collaborate in developing new features or improving existing ones by sharing ideas or providing feedback about our products.\n</p><p>\n</p>",
  "text": "Mozilla launched the platform Mozilla Connect , in collaboration with Khoros , as a space for users to give product feedback, share ideas for new features, and participate in meaningful conversations that help shape future releases. You can leave feedback and share ideas for Firefox desktop, mobile, Mozilla VPN, Pocket, Thunderbird and more. Features You can sign in to Mozilla Connect using your Mozilla account . The platform is user-friendly. You can easily find the sections where you can contribute ideas, provide feedback and engage in discussions. There is a labeling and search system, so other community members and product managers can easily find and engage with contributed posts. In partnership with Khoros, Mozilla Connect allows you to rank your ideas and earn badges for your contributions. The members of the community will be able to participate and host interesting events. A better way to give and receive feedback Mozilla employees will participate by responding directly to ideas, leading discussions, and sharing product demos. Contributors can expect to receive feedback on their ideas from other community members almost immediately. Ideas can be commented and voted on by the community. All top ideas will be shared with the staff for review. The evaluation process can take up to two weeks, and, if an idea needs to be evaluated further, we’ll make sure to keep the community informed. Ideas Acceptance Criteria We are in the process of creating a rubric that details with what we consider for adopting ideas. This rubric will also be shared with the community. Some of the things we’ll consider are: Does the idea align with the Mozilla vision? Does the idea provide user value? Will the idea be impactful? How is Mozilla Connect different from Mozilla Support? Mozilla Support is a platform where users can find help articles and an active community of contributors ready to answer questions about Mozilla products in the support forums . On the other hand, Mozilla Connect brings the community and the employees closer together to collaborate in developing new features or improving existing ones by sharing ideas or providing feedback about our products.",
  "products": [
    "firefox"
  ],
  "topics": [
    "browse"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 3116,
    "text_bytes": 2187,
    "word_count": 352,
    "downloaded_at": "2025-08-26T10:55:00.456554"
  }
}