{
  "slug": "what-search-hijacking",
  "title": "What is search hijacking?",
  "summary": "This article describes the types of search hijacking that occur.",
  "url": "https://support.mozilla.org/en-US/kb/what-search-hijacking",
  "html": "<p>Firefox lets you regain control of your settings in the event of a search hijacking. If Firefox detects a search hijacker, it fixes itself by resetting to the default settings.\n</p><p>Search hijacking, or browser hijacking, occurs when a third party sneaks files into your computer and alters your browser's settings without your permission. These changes help the hijackers make money by forcing you to look at ads, click on paid links, or give up your private information.\n</p><p>If you are unable to change your home page, remove a toolbar, or change your search settings, it's likely that your browser has been hijacked.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_types-of-search-hijacking\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Types of search hijacking</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_toolbar-hijacking\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Toolbar hijacking</span></a></li><li class=\"toclevel-2\"><a href=\"#w_unwanted-redirects\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Unwanted redirects</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_how-does-search-hijacking-happen\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How does search hijacking happen?</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_add-ons-and-extensions\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Add-ons and extensions</span></a></li><li class=\"toclevel-2\"><a href=\"#w_advertising-networks\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">Advertising networks</span></a></li><li class=\"toclevel-2\"><a href=\"#w_installers\"><span class=\"tocnumber\">2.3</span> <span class=\"toctext\">Installers</span></a></li><li class=\"toclevel-2\"><a href=\"#w_fake-anti-virus-software\"><span class=\"tocnumber\">2.4</span> <span class=\"toctext\">Fake anti-virus software</span></a></li><li class=\"toclevel-2\"><a href=\"#w_free-internet-downloads\"><span class=\"tocnumber\">2.5</span> <span class=\"toctext\">Free Internet downloads</span></a></li><li class=\"toclevel-2\"><a href=\"#w_infected-messages\"><span class=\"tocnumber\">2.6</span> <span class=\"toctext\">Infected messages</span></a></li><li class=\"toclevel-2\"><a href=\"#w_meta-installers-and-download-managers\"><span class=\"tocnumber\">2.7</span> <span class=\"toctext\">Meta installers and download managers</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_firefox-anti-hijacking\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Firefox Anti-hijacking</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_firefox-automatic-search-reset\"><span class=\"tocnumber\">3.1</span> <span class=\"toctext\">Firefox Automatic Search Reset</span></a></li><li class=\"toclevel-2\"><a href=\"#w_user-opt-in-reset\"><span class=\"tocnumber\">3.2</span> <span class=\"toctext\">User Opt-in Reset</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_regain-control-of-your-browser\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Regain control of your browser</span></a></li></ul></div>\n<h1 id=\"w_types-of-search-hijacking\">Types of search hijacking</h1>\n<h2 id=\"w_toolbar-hijacking\">Toolbar hijacking</h2>\n<p>Some hijackers install toolbars that display ads, add unwanted bookmarks, load their page when you open a new tab, or insert ads in your search results, or collect information about your searches. These toolbars may force you to use their search by making it very difficult to change your search engine.\n</p><p>Some companies take Firefox's open source code and create their own customized version of the browser with their built-in toolbar. Make sure to download Firefox only from the <a href=\"https://www.mozilla.org/firefox/new/\">official website</a>.\n</p>\n<h2 id=\"w_unwanted-redirects\">Unwanted redirects</h2>\n<p>Some hijackers redirect your home page, search results page or error pages to their own pages. These pages may include ads, sponsored links and other paid content or trick you into downloading malicious software.\n</p>\n<h1 id=\"w_how-does-search-hijacking-happen\">How does search hijacking happen?</h1>\n<p>Some programs bundle custom search or toolbars with software that you do want. Others trick you into downloading malware that can alter your settings and access your information. Here are the most common ways search hijacking can happen:\n</p>\n<h2 id=\"w_add-ons-and-extensions\">Add-ons and extensions</h2>\n<p>Some companies offer add-ons that claim to improve your browser's performance, but alter your search settings instead. Make sure to install add-ons from a reliable source, such as <a href=\"https://addons.mozilla.org/\">addons.mozilla.org</a>.\n</p>\n<h2 id=\"w_advertising-networks\">Advertising networks</h2>\n<p>Some ads install malware when you click or play them. Avoid clicking on ads or install an add-on to block advertising and other unwanted content, such as <a href=\"https://addons.mozilla.org/firefox/addon/ublock-origin/\">uBlock Origin</a> or\n<a href=\"https://addons.mozilla.org/firefox/addon/adblock-plus/\">Adblock Plus</a>.\n</p><p></p><div class=\"note\">Please reach out to the add-on developer directly, if you need help with a specific add-on.</div>\n<p></p>\n<h2 id=\"w_installers\">Installers</h2>\n<p>Some companies bundle custom toolbars with their software updates. When you install or update any software, be sure to pay attention to all the check boxes to make sure you're not downloading additional software.\n</p>\n<h2 id=\"w_fake-anti-virus-software\">Fake anti-virus software</h2>\n<p>Some companies disguise their hijackers as anti-virus software. They may claim to make your browser run faster or remove malicious files from your computer, but alter your search settings instead.\n</p>\n<h2 id=\"w_free-internet-downloads\">Free Internet downloads</h2>\n<p>Some search hijackers are bundled with free software downloaded from unreliable sites. Be sure to download only from sources that you trust.\n</p>\n<h2 id=\"w_infected-messages\">Infected messages</h2>\n<p>Spam emails or links on your Facebook or Twitter feed may contain links to download malware, so avoid clicking on unfamiliar messages or links.\n</p>\n<h2 id=\"w_meta-installers-and-download-managers\">Meta installers and download managers</h2>\n<p>Meta installers or download managers are software that let you download files from multiple sources. These download managers may take over your toolbar or download manager.\n</p>\n<h1 id=\"w_firefox-anti-hijacking\">Firefox Anti-hijacking</h1>\n<h2 id=\"w_firefox-automatic-search-reset\">Firefox Automatic Search Reset</h2>\n<p>In some circumstances where Firefox detects that you are likely to be in a hijacked state, it may automatically reset to the default search engine for your country.  There is no action you need to take in this case.\n</p><p>Hijacking detection is not 100% accurate so, if Firefox resets your search engine, it's easy to change it back to your preferred search engine. Just navigate to the <strong>Search</strong> panel of Firefox Settings\n and <a href=\"/en-US/kb/change-your-default-search-settings-firefox\">change your default search settings</a>. Your prior engine will still be a choice in the select menu. \n</p>\n<h2 id=\"w_user-opt-in-reset\">User Opt-in Reset</h2>\n<p>In circumstances where Firefox detects that you may be hijacked, you will see a search reset offer in the content window. The reset will go to the default search engine for your country. \n</p>\n<ul><li>To accept the offer, click <span class=\"button\">Change Search Engine</span>.\n</li><li>To reject the offer, click <span class=\"button\">Don’t change</span>.\n</li><li>To choose another search default, click the <strong>Settings page</strong> link.\n</li></ul>\n<dl><dt><img alt=\"restore search 57\" class=\"wiki-image frameless lazy\" data-original-src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/media/uploads/gallery/images/2017-11-29-12-27-20-b1ac2d.png\" src=\"https://assets-prod.sumo.prod.webservices.mozgcp.net/static/placeholder.688345f843bb37ed.gif\" title=\"\"> \n</dt></dl>\n<h1 id=\"w_regain-control-of-your-browser\">Regain control of your browser</h1>\n<p>If Firefox's automatic reset does not fix the problem, see the following articles for additional solutions:\n</p>\n<ul><li><a href=\"/en-US/kb/remove-toolbar-has-taken-over-your-firefox-search\">Remove a toolbar that has taken over your Firefox search or home page</a>\n</li><li><a href=\"/en-US/kb/searches-take-you-to-wrong-search-website\">What to do when searches take you to the wrong search website</a>\n</li><li><a href=\"/en-US/kb/troubleshoot-firefox-issues-caused-malware\">Troubleshoot Firefox issues caused by malware</a>\n</li></ul>\n<p><br>\nShare this article: <a href=\"https://mzl.la/3Gjuqpe\">https://mzl.la/3Gjuqpe</a>\n</p>",
  "text": "Firefox lets you regain control of your settings in the event of a search hijacking. If Firefox detects a search hijacker, it fixes itself by resetting to the default settings. Search hijacking, or browser hijacking, occurs when a third party sneaks files into your computer and alters your browser's settings without your permission. These changes help the hijackers make money by forcing you to look at ads, click on paid links, or give up your private information. If you are unable to change your home page, remove a toolbar, or change your search settings, it's likely that your browser has been hijacked. Table of Contents 1 Types of search hijacking 1.1 Toolbar hijacking 1.2 Unwanted redirects 2 How does search hijacking happen? 2.1 Add-ons and extensions 2.2 Advertising networks 2.3 Installers 2.4 Fake anti-virus software 2.5 Free Internet downloads 2.6 Infected messages 2.7 Meta installers and download managers 3 Firefox Anti-hijacking 3.1 Firefox Automatic Search Reset 3.2 User Opt-in Reset 4 Regain control of your browser Types of search hijacking Toolbar hijacking Some hijackers install toolbars that display ads, add unwanted bookmarks, load their page when you open a new tab, or insert ads in your search results, or collect information about your searches. These toolbars may force you to use their search by making it very difficult to change your search engine. Some companies take Firefox's open source code and create their own customized version of the browser with their built-in toolbar. Make sure to download Firefox only from the official website . Unwanted redirects Some hijackers redirect your home page, search results page or error pages to their own pages. These pages may include ads, sponsored links and other paid content or trick you into downloading malicious software. How does search hijacking happen? Some programs bundle custom search or toolbars with software that you do want. Others trick you into downloading malware that can alter your settings and access your information. Here are the most common ways search hijacking can happen: Add-ons and extensions Some companies offer add-ons that claim to improve your browser's performance, but alter your search settings instead. Make sure to install add-ons from a reliable source, such as addons.mozilla.org . Advertising networks Some ads install malware when you click or play them. Avoid clicking on ads or install an add-on to block advertising and other unwanted content, such as uBlock Origin or Adblock Plus . Please reach out to the add-on developer directly, if you need help with a specific add-on. Installers Some companies bundle custom toolbars with their software updates. When you install or update any software, be sure to pay attention to all the check boxes to make sure you're not downloading additional software. Fake anti-virus software Some companies disguise their hijackers as anti-virus software. They may claim to make your browser run faster or remove malicious files from your computer, but alter your search settings instead. Free Internet downloads Some search hijackers are bundled with free software downloaded from unreliable sites. Be sure to download only from sources that you trust. Infected messages Spam emails or links on your Facebook or Twitter feed may contain links to download malware, so avoid clicking on unfamiliar messages or links. Meta installers and download managers Meta installers or download managers are software that let you download files from multiple sources. These download managers may take over your toolbar or download manager. Firefox Anti-hijacking Firefox Automatic Search Reset In some circumstances where Firefox detects that you are likely to be in a hijacked state, it may automatically reset to the default search engine for your country. There is no action you need to take in this case. Hijacking detection is not 100% accurate so, if Firefox resets your search engine, it's easy to change it back to your preferred search engine. Just navigate to the Search panel of Firefox Settings and change your default search settings . Your prior engine will still be a choice in the select menu. User Opt-in Reset In circumstances where Firefox detects that you may be hijacked, you will see a search reset offer in the content window. The reset will go to the default search engine for your country. To accept the offer, click Change Search Engine . To reject the offer, click Don’t change . To choose another search default, click the Settings page link. Regain control of your browser If Firefox's automatic reset does not fix the problem, see the following articles for additional solutions: Remove a toolbar that has taken over your Firefox search or home page What to do when searches take you to the wrong search website Troubleshoot Firefox issues caused by malware Share this article: https://mzl.la/3Gjuqpe",
  "products": [
    "firefox"
  ],
  "topics": [
    "add-ons-extensions-and-themes"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 8689,
    "text_bytes": 4884,
    "word_count": 783,
    "downloaded_at": "2025-08-26T10:36:29.144382"
  }
}