{
  "slug": "windows-administrator-launcher-process-error-fix",
  "title": "Drag and Drop errors with Firefox Launcher Process enabled and Windows UAC disabled - How to Fix",
  "summary": "How to fix Firefox drag-and-drop errors when running Windows as Administrator with UAC disabled and the Launcher Process enabled.",
  "url": "https://support.mozilla.org/en-US/kb/windows-administrator-launcher-process-error-fix",
  "html": "<div class=\"for\" data-for=\"mac,linux\"><div class=\"for\" data-for=\"not win\"><div class=\"warning\">This article only applies to Firefox on Windows.</div></div></div>\n<p></p>\n<div class=\"note\">This article applies to <a href=\"/en-US/kb/find-what-version-firefox-you-are-using\">Firefox version</a> 67 and above, on all Windows builds.  This article is also for IT Admins who want to configure Firefox on their organization's computers. </div>\n<p>The <a href=\"https://wiki.mozilla.org/Platform/Integration/InjectEject/Launcher_Process/\">Launcher Process</a> is a security-related feature that was enabled for all users in the Firefox version 68 release. When running Windows as an Administrator with <a href=\"https://wikipedia.org/wiki/User_Account_Control\">User Account Control</a> (UAC) disabled and the launcher process enabled, Firefox users may experience unexpected behavior.\n</p>\n<div id=\"toc\"><h2>Table of Contents</h2><ul><li class=\"toclevel-1\"><a href=\"#w_why-the-problem-occurs\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Why the problem occurs</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-to-verify-the-problem\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">How to verify the problem</span></a></li><li class=\"toclevel-1\"><a href=\"#w_how-to-fix\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How to fix</span></a><ul><li class=\"toclevel-2\"><a href=\"#w_re-enable-uac\"><span class=\"tocnumber\">3.1</span> <span class=\"toctext\">Re-enable UAC</span></a></li><li class=\"toclevel-2\"><a href=\"#w_start-firefox-using-the-no-deelevate-command\"><span class=\"tocnumber\">3.2</span> <span class=\"toctext\">Start Firefox Using the -no-deelevate command</span></a></li></ul></li><li class=\"toclevel-1\"><a href=\"#w_partial-workaround\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Partial workaround</span></a></li></ul></div>\n<h1 id=\"w_why-the-problem-occurs\">Why the problem occurs</h1>\n<p>When the launcher process detects that it is running at a <a href=\"https://wikipedia.org/wiki/Mandatory_Integrity_Control\">high integrity level</a>, it will force Firefox to run at a medium integrity level. This intentional security feature is intended to prevent malicious code from gaining write access to sensitive areas of the operating system. Windows does not allow programs running at a lower integrity level to send data to programs running at a higher integrity level. As a result, users may experience errors when trying to drag and drop from Firefox to another application. \n</p>\n<h1 id=\"w_how-to-verify-the-problem\">How to verify the problem</h1>\n<p>To verify this condition, make sure the user is operating Windows as a full Administrator and has disabled User Account Control (UAC) settings. Enter <span class=\"menu\">about:support</span> in the address bar and look under <strong>Application Basics</strong> for the <em>Launcher Process</em> entry. If the Launcher Process is enabled, you may experience errors when trying to drag and drop an image or URL from Firefox to another application or to the Windows desktop (for example, when you try to <a href=\"/en-US/kb/create-desktop-shortcut-website\">create a desktop shortcut to a website</a>).\n</p>\n<div class=\"note\"><strong>Note:</strong> The about:support <strong>Application Basics</strong> <em>Launcher Process</em> entry may show <em>Disabled due to failure</em> even though the <span class=\"pref\">browser.launcherProcess.enabled</span>  preference is set to <span class=\"pref\">true</span> in the <a href=\"/en-US/kb/about-config-editor-firefox\">Firefox Configuration Editor</a> (<em>about:config</em>) page. To enable the Launcher Process, enter <em>about:config</em> in the address bar, find the <span class=\"pref\">browser.launcherProcess.enabled</span> preference, toggle it to  <span class=\"pref\">false</span> and then toggle it back to <span class=\"pref\">true</span>.</div>\n<h1 id=\"w_how-to-fix\">How to fix</h1>\n<p>To fix the problem, users have two options. \n</p>\n<h2 id=\"w_re-enable-uac\">Re-enable UAC</h2>\n<p>First, users can re-enable UAC on their PC. To do so, type <span class=\"menu\">UAC</span> in the search field on your taskbar by right-clicking the Start button and selecting Search. Click <span class=\"menu\">Change User Account Control settings</span>. To turn UAC on, drag the slider to <span class=\"menu\">Notify me only when apps try to make changes to my computer (default)</span>, click <span class=\"menu\">OK</span> and then restart the computer. This option is the most secure fix available. \n</p>\n<h2 id=\"w_start-firefox-using-the-no-deelevate-command\">Start Firefox Using the -no-deelevate command</h2>\n<p>Alternatively, users can solve the issue by launching Firefox using the <span class=\"menu\">-no-deelevate</span> command line option, either directly from the command line or by editing their Firefox shortcut to do so.\n</p>\n<h1 id=\"w_partial-workaround\">Partial workaround</h1>\n<p><em>Copy and Paste</em> often can substitute for drag-and-drop. For example, a user can right-click on an image and choose <span class=\"menu\">Copy Image</span>, then right-click on the Windows desktop and choose <span class=\"menu\">Paste</span>. Where practicable, this is preferred to reducing security by using the <span class=\"menu\">-no-deelevate</span> command line option.\n</p>",
  "text": "This article only applies to Firefox on Windows. This article applies to Firefox version 67 and above, on all Windows builds. This article is also for IT Admins who want to configure Firefox on their organization's computers. The Launcher Process is a security-related feature that was enabled for all users in the Firefox version 68 release. When running Windows as an Administrator with User Account Control (UAC) disabled and the launcher process enabled, Firefox users may experience unexpected behavior. Table of Contents 1 Why the problem occurs 2 How to verify the problem 3 How to fix 3.1 Re-enable UAC 3.2 Start Firefox Using the -no-deelevate command 4 Partial workaround Why the problem occurs When the launcher process detects that it is running at a high integrity level , it will force Firefox to run at a medium integrity level. This intentional security feature is intended to prevent malicious code from gaining write access to sensitive areas of the operating system. Windows does not allow programs running at a lower integrity level to send data to programs running at a higher integrity level. As a result, users may experience errors when trying to drag and drop from Firefox to another application. How to verify the problem To verify this condition, make sure the user is operating Windows as a full Administrator and has disabled User Account Control (UAC) settings. Enter about:support in the address bar and look under Application Basics for the Launcher Process entry. If the Launcher Process is enabled, you may experience errors when trying to drag and drop an image or URL from Firefox to another application or to the Windows desktop (for example, when you try to create a desktop shortcut to a website ). Note: The about:support Application Basics Launcher Process entry may show Disabled due to failure even though the browser.launcherProcess.enabled preference is set to true in the Firefox Configuration Editor ( about:config ) page. To enable the Launcher Process, enter about:config in the address bar, find the browser.launcherProcess.enabled preference, toggle it to false and then toggle it back to true . How to fix To fix the problem, users have two options. Re-enable UAC First, users can re-enable UAC on their PC. To do so, type UAC in the search field on your taskbar by right-clicking the Start button and selecting Search. Click Change User Account Control settings . To turn UAC on, drag the slider to Notify me only when apps try to make changes to my computer (default) , click OK and then restart the computer. This option is the most secure fix available. Start Firefox Using the -no-deelevate command Alternatively, users can solve the issue by launching Firefox using the -no-deelevate command line option, either directly from the command line or by editing their Firefox shortcut to do so. Partial workaround Copy and Paste often can substitute for drag-and-drop. For example, a user can right-click on an image and choose Copy Image , then right-click on the Windows desktop and choose Paste . Where practicable, this is preferred to reducing security by using the -no-deelevate command line option.",
  "products": [
    "firefox",
    "firefox-enterprise"
  ],
  "topics": [
    "performance-and-connectivity",
    "settings"
  ],
  "locale": "en-US",
  "metadata": {
    "html_bytes": 5286,
    "text_bytes": 3158,
    "word_count": 518,
    "downloaded_at": "2025-08-26T10:47:27.009746"
  }
}